{
  "scraped_at": "2025-12-04T17:47:44.331045",
  "total_stories": 70,
  "source": "https://www.visionforisrael.com/en/blog/topic/stories",
  "stories": [
    {
      "title": "StoriesFrom the Fire to a Future: Yuval’s Scholarship of HopeSaturday, October 25, 2025",
      "link": "https://www.visionforisrael.com/en/blog/from-the-fire-to-a-future-yuvals-scholarship-of-hope",
      "image": "https://images.prismic.io/vfi-website/aPLV2Z5xUNkB2HS4_Nova_Reim_shutterstock_2661125095_med.jpg?auto=format%2Ccompress&fit=max&w=3840",
      "image_alt": "From the Fire to a Future: Yuval’s Scholarship of Hope ",
      "category": "Story",
      "full_content": "Dear Friends,At 6:30 a.m. on October 7, 2023, Yuval Siman Tov looked up from the dancefloor at the Nova festival and saw what he thought were fireworks streaking the sky. The music cut, the DJ’s voice came over the speakers: “Lie down”. For a beat, everyone hoped it was only rockets—that the party would resume, that the morning would return to normal. Then a policeman shouted: “Evacuate—now!”. Chaos swallowed the field. People ran in every direction, tripping over mats and chairs, choking on dust, clutching hands so they wouldn’t be torn apart. Cars jammed the exit like pebbles in a narrow stream, engines screaming, horns blaring, no way out but forward.Yuval and his friends—Tamir at the wheel, and Ron in the back—tried a side road, a thin ribbon through low hills. A police car edged ahead, then slowed. They went around. The officer pounded on his door, shouting over the wind: “terrorists are coming straight at you”. Yuval yelled, ”Turn around!” and as they swung south, the first convoy of terrorists appeared: motorcycles, ATVs, a truck with a mounted machine gun. The air filled with metal. “We bent our heads,” Yuval said, “and the first bullets hit.” Glass burst like shrapnel glitter; hundreds of rounds stitched the car. In the back seat, Ron groaned, clutching his stomach—“Guys, I’m dying.”The shooting paused. Tamir tried to restart the car; the engine wouldn’t start. Hearts fell like stones. They had to run. Yuval spilled from the passenger side, felt the blistering quiet of a second, then the crack of more shots. He saw Ron dying and couldn’t speak. Terrorists turned to fire on the next line of cars; others advanced from the south. Yuval grabbed Tamir’s hand. “Run. Run, run, run.”At last, he dropped into a bush, chest to dirt, face angled toward the asphalt, pretending to be dead. For twenty minutes, he dared not blink. He watched cars crumple and exhale smoke; watched people being dragged from seats and being shot; watched small, final movements stop. One gunman stepped out from the trees and leveled his weapon at Yuval from fifty meters, eyes on Yuval’s stillness—then a voice from the road called him back. The barrel lowered. The footsteps receded.The pain in Yuval’s back found him then, sharp and blooming. He stripped off his sweatshirt—it was soaked in blood. Two holes pocked his shirt near the spine. Dizzy and alone, he thought: if I’m going to die, let me try first to survive. He crawled, then somehow stood, then somehow ran. On an inner road, a jeep appeared. He raised his hands, half-naked and bleeding, turned to show his back. The driver slowed, then rolled on— thinking Yuval was a threat, Yuval thinking the same of him. “Please save me!” Yuval shouted. The driver stepped out, weapon trained, and demanded a name. “I’m Yuval, from Rehovot. Please—save me.” The man circled, checked for a weapon, then opened a door and let Yuval in his car. Shortly after, he pushed Yuval into a roadside safety shelter. The roar outside faded; the loneliness did not.Forty minutes later, rescue arrived—a resident from nearby Moshav Yesha who took Yuval to his home and took him to a safe room. Yuval’s phone lit with a miracle: Tamir calling. “I can’t believe it,” Yuval cried. “You’re alive.” “I can’t believe you’re alive,” Tamir answered. Joy lasted a breath, then grief swallowed it: Ron was gone. As the hours unwound, the questions tightened like wire. Should I have dragged him out? Why him and not me? At Ron’s funeral, Yuval took his father’s hand; the father pulled him into an aching embrace. “It wouldn’t have helped anyone,” he whispered, “if instead of two there were zero.”Guilt tried to take root. Yuval would not let it flower. Even before October 7, he had started a small nonprofit linking youth with elderly Israelis—especially Holocaust survivors—who had been left behind, shut in through long months of COVID, their eyes carrying the weight of being unseen. After the massacre, he leaned closer to them. He sat and listened to stories no one else could bear, delivering essentials and, more than that, time. “We all experienced murder in front of our eyes,” he said. “Hatred and anger. Neglect. We need to stick together.” Serving them steadied him. Their endurance taught him to breathe again.Because friends like you refused to look away, Vision for Israel could come alongside Yuval in the months that followed. Your generosity helped us award him a scholarship to continue his university studies—one step toward the future he nearly lost on that road. It didn’t erase the scars or mend every memory. But it did say: your life matters; your calling remains; your hands can still carry hope to the lonely.If you feel led, please help us lift more survivors and students like Yuval with scholarships, trauma care, and practical support.Give todayto Vision for Israel — your gift will help plant new life in scorched places. Thank you for being a refuge for the brokenhearted in Israel.Am Yisrael Chai!Barry & Batya"
    },
    {
      "title": "StoriesPacking Hope into 1,300 BackpacksSaturday, August 30, 2025",
      "link": "https://www.visionforisrael.com/en/blog/packing-hope-into-1300-backpacks",
      "image": "https://images.prismic.io/vfi-website/aLDOq2GNHVfTObKm_WhatsAppImage2025-07-10at05.44-1-.jpg?auto=format%2Ccompress&fit=max&w=3840",
      "image_alt": "",
      "category": "Story",
      "full_content": "Dear Friends,This August, our team set out across central Israel with a simple mission: to place a brand-new school backpack in the hands of every first-grader in need. Thanks to your generosity, 1,300 children began the school year with not only the supplies they need, but also the reassurance that they are seen, valued, and loved.In the city of Lod, we met Golda — a grandmother raising her three young grandchildren. Her life has been marked by unimaginable loss. Two years ago, Golda’s youngest daughter, Aya, was murdered while pregnant with her fourth child, in a brutal act witnessed by her own children. The children’s father, already raising them alone, passed away earlier this year from a broken heart over the loss of his wife. Now, Golda carries the weight of their care on her own shoulders.When we handed her grandson a new backpack, Golda’s eyes filled with tears. She told us how the children are receiving therapy and trying to rebuild a sense of normalcy. Something as small as a backpack, she said, is “a joy and a hope” for her family.Friends, this is the kind of impact you make possible. Your gifts enable us to serve families from every background — Jewish, Christian, Muslim — with the love of God in practical ways. Whether in moments of tragedy or times of joy, your generosity brings light into the darkest of places.Please help us continue reaching Israel’s most vulnerable children with hope, dignity, and the love of Yeshua.Visit our website to give today.Thank you for standing with us, and with families like Golda’s, in this holy work.With gratitude,Barry & Batya"
    },
    {
      "title": "StoriesOfer Survived a Terror Attack—Here’s How You HelpedSaturday, June 28, 2025",
      "link": "https://www.visionforisrael.com/en/blog/ofer-survived-a-terror-attackheres-how-you-helped",
      "image": "https://images.prismic.io/vfi-website/aFn8Xnfc4bHWipd8_man_shutterstock_2022263723-med.jpg?auto=format%2Ccompress&fit=max&w=3840",
      "image_alt": "Ofer Survived a Terror Attack—Here’s How You Helped ",
      "category": "Story",
      "full_content": "Dear Friends,It was a quiet evening in January in Tel Aviv. Ofer*, a 29-year-old young attorney, was standing with friends outside a café—talking, laughing, maybe dreaming of what the future would hold. He had just started a new job, launched his legal career after graduating with honors, and was finally seeing the fruits of years of hard work.But then came a moment that changed everything.Without warning, a terrorist attacked Ofer from behind, stabbing him in the back of the neck with a long, sharp knife. The blade pierced 4 centimeters deep. It was a miracle that he survived. Just seconds earlier, Ofer had borrowed a friend’s visor hat and casually turned it backwards onto his head. That small, seemingly insignificant gesture absorbed enough of the impact to prevent the knife from reaching a main artery—an artery that, had it been severed, would have taken his life instantly.“A second here or a centimeter there,” Ofer later wrote, “and I wouldn’t be alive.”Ofer was rushed to the hospital, bleeding heavily and facing internal injuries. He underwent surgery and spent days in recovery. But when he left the hospital, his journey was far from over. He lost nerve sensation in parts of his head and neck. Chronic pain in his shoulder and arm made even writing an email a struggle. His physical strength—once shaped by regular workouts and athletic training—felt shattered.And mentally? The trauma is deep.He now lives in a state of hyper-alertness. Crowded streets, unfamiliar faces—everyday moments can trigger overwhelming anxiety and fear.He once gave freely of his time and money, volunteering and donating to help others. But now, his own needs have brought him to a place of vulnerability. Medical expenses, especially for trauma therapy, are high. National Insurance has limited support, and psychologists through the public system are overbooked. Ofer had to seek private help—and the cost was more than he could bear.That’s when he reached out to Vision for Israel.Though it was difficult for him to ask, he humbly requested our help. And because of your generosity, we were able to say yes. Ofer is now receiving the specialized trauma therapy he desperately needs. But his road to healing is long, and he cannot walk it alone.Dear friends, Ofer is just one of many who have survived the physical violence of terrorism—only to face an even harder battle for recovery. Right now, he still cannot work. Rent, utilities, treatment—it’s all piling up.Your gift today can help Ofer continue his therapy, cover his basic expenses, and most importantly—hold onto hope.Please give nowto support people like Ofer who have suffered unimaginable trauma but are fighting to heal.Let’s stand with Ofer. Let’s remind him—and others in pain—that they are not alone. That the body of Messiah is still active, still compassionate, and still full of mercy.With gratitude and blessings,Barry & Batya*Name has been changed"
    },
    {
      "title": "StoriesIn Memory of the Heroes Who Stood Their GroundSaturday, May 10, 2025",
      "link": "https://www.visionforisrael.com/en/blog/in-memory-of-the-heroes-who-stood-their-ground",
      "image": "https://images.prismic.io/vfi-website/aBqLGvIqRLdaB7Vk_VFIThumbnail_October7th-1-.png?auto=format%2Ccompress&fit=max&w=3840",
      "image_alt": "In Memory of the Heroes Who Stood Their Ground ",
      "category": "Story",
      "full_content": "Dear Friends,On the morning of October 7th, Israel was shaken to its core. As rockets fell and terrorists crossed into our land, there were many who chose not to run—but to stay, to serve, and to save. One of them was a young paramedic named Amit.We first heard Amit’s story from Ronit Glaser, a longtime medic with Magen David Adom. She was working at the MDA command center in Jerusalem that day, after rushing her own daughters to safety through a barrage of rocket sirens.Ronit took the call from Amit just after 7 AM. Amit was trapped inside the dental clinic in Kibbutz Be’eri—one of the first communities attacked that day. She had multiple gunshot victims with her. Two were already dead. She asked Ronit calmly, “When are you coming?” In the background, Ronit could hear the gunfire.She begged her supervisor for an answer. When it came, she was heavy with sorrow as she told Amit: “You’re one of us so I’ll tell you the truth. We don’t know when we’ll get to you. We’re trying. But we can’t reach you”. Amit was in the middle of a war zone.Still, Amit remained hopeful. Hours later, she called again. In the middle of the call, one of the wounded men with her tried to flee. She stopped him, firmly but gently: “You’re not going anywhere. You’re staying with me. We don’t know what’s outside.”By then, the full tragedy had begun to unfold. Terrorists had blocked entry routes. Special forces were ambushed. Even the local MDA ambulance driver, Avi Yachatz, was gunned down—along with his two young grandsons.And Amit? She stayed.For nearly eight hours, she kept treating the wounded. She had even been shot in the leg—but managed to apply a tourniquet to herself. It wasn’t until terrorists finally breached the clinic that she was killed. She was only 22 years old.They found her two days later, once the building had been cleared of booby traps. She was still wearing her surgical gloves.Amit had been the youngest paramedic trainer in MDA. That morning, her boyfriend urged her to leave and join him somewhere safer. But she refused. “I’m on call this Shabbat,” she said. “I’m staying.”The only survivor from the clinic later told her mother: “She was my paradise in hell. She was an angel.”Stories like these are difficult to hear—but they are vital to remember. They remind us of the real heroes: those who run toward the broken and the bleeding. Those who treat the wounded even when death is near. Those who answer the call.We at Vision for Israel are humbled to stand alongside organizations like MDA—to support the very medics who serve on the frontlines of tragedy. And with your help, we can continue equipping them with ambulances, medical supplies, and protection—tools that help preserve life when every second counts.Stand with the heroes who refuse to leave the suffering behind.Give now and dedicate your gift to the Medical and emergency fund.Amit’s hands remained open until the end—offering care, hope, and life. May we be inspired to do the same, in her memory.Watch the videoWith honor and remembrance,Barry & Batya"
    },
    {
      "title": "StoriesSupporting Re’ut in Her Healing JourneySaturday, March 22, 2025",
      "link": "https://www.visionforisrael.com/en/blog/supporting-reut-in-her-healing-journey",
      "image": "https://images.prismic.io/vfi-website/Z9r33ziBA97Giq01_orthodoxwoman_shutterstock_2378779991_med.jpg?auto=format%2Ccompress&fit=max&w=3840",
      "image_alt": "Supporting Re’ut in Her Healing Journey  ",
      "category": "Story",
      "full_content": "Trauma is a very real issue that the entire nation of Israel has to battle with as a “normal” part of life. And now more than ever, trauma is running rampant throughout the nation of Israel since the horrific terrors of October 7th, 2023. Israelis are in desperate need of God’s healing, true peace, and restoration.VFI recognizes how these terrorists have caused great destruction and trauma in the lives of many. Therefore, we see great value in coming alongside Israelis who are battling trauma to help them rebuild their lives. One precious Israeli that we have been able to support is a woman named Re’ut*. She has received help from the welfare department for several months, along with rehabilitation through the National Insurance Institute.From a young age, Re’ut was exposed to terrorist attacks and horrific trauma. She grew up in Kiryat Arba, near Hebron, a Jewish settlement in the middle of Judea and Samaria. This small Jewish town is completely surrounded by Arab villages. Therefore, the Jewish communities living there have faced the reality and fear of terror attacks daily.As a little girl, Re’ut experienced terrorists attempting to break into her home several times. Can you imagine the amount of fear that puts into a little girl’s heart? Sadly, much worse things happened to Re’ut. One horrific trauma that Re’ut experienced was being raped by several Arabs. She managed to run away from them, but could not run away from the trauma that scarred her innocent heart and body.Re’ut didn’t let this trauma keep her from living her life. She got married and had kids, but she couldn’t run from the pain, hurt, and trauma. She was recognized as a victim of hostility with post-traumatic stress disorder. When October 7th happened, her husband got called to serve in the army, and she lost a baby in pregnancy. Her mental state became even more unstable and her anxiety increased, which also affected her entire family.Due to all of this, Re’ut, who is a graphic designer, has not been able to work for two years. Her husband has been working hard to provide for their financial needs, taking care of the home, and trying to support his wife in the best way he knows including escorting her every time she leaves and enters the settlement.Re'ut is currently in rehabilitation where she is focusing on the occupational aspect. VFI desired to help Re’ut get back on her feet and gave her a laptop so she could go back to work from home as a graphic designer. Being able to work remotely on something she enjoys could help her heal, overcome some of her anxiety, and help improve her family’s financial situation.After Re’ut received the laptop, she wrote us a beautiful letter of gratitude. She wrote:\n\nHow does one begin to say thank you when there are no words that could truly express it? During these days, when the whole nation of Israel is dealing with, and also us personally, severe terror attacks, my husband being drafted, the loss of a pregnancy, and the post-trauma, I came to a state of collapse.But what kept me going is the saying \"Wherever there is destruction there will be expansion\". The Arabs wanted to destroy us and I chose to expand my heart, despite the difficulty.But it's impossible to do this alone. Your help gave me the strength and the light within the darkness. Thanks to you I will be able to rise up from the trouble, and not just me, but also my children and my family. You have rescued me from a mental breakdown, and God forbid, suicide.My heart says thank you, thank you, thank you. You have been the messengers to be my light.From young to old, the people of Israel are battling through trauma right now on many different levels. We invite you to join us in praying for and financially supporting the people of Israel for such a time as this. Pray for God to heal their hearts from all the trauma and rebuild their lives to become even stronger!\n\n*Name has been changed"
    },
    {
      "title": "StoriesShlomit’s Story: Light in the Darkness of IllnessSaturday, January 25, 2025",
      "link": "https://www.visionforisrael.com/en/blog/shlomits-story-light-in-the-darkness-of-illness",
      "image": "https://images.prismic.io/vfi-website/Z4rMv5bqstJ99lqi_shutterstock_1184427253med.jpg?auto=format%2Ccompress&fit=max&w=3840",
      "image_alt": "Shlomit’s Story: Light in the Darkness of Illness ",
      "category": "Story",
      "full_content": "Dear Friends,In Rishon Letzion’s winding streets, we met Shlomit during one of our high holiday gift card distributions. At 48 years old, her body bears the visible scars of NF1 disease—a condition that causes painful tumors both inside and out. While these tumors ravage her body, Shlomit’s spirit shines with an unquenchable light.Shlomit’s challenges are unimaginable. She’s endured multiple surgeries to remove malignant tumors, with more looming. Her husband, a hardworking renovator, has faced severe financial setbacks since the tragic events of October 7th, 2023. Together, they care for their two daughters, their love a beacon amid life’s storms.But Shlomit’s journey is not only one of survival—it's one of incredible generosity. She recalls a time, 18 years ago, when she and her children from her first marriage were homeless, abandoned, and destitute. A kind stranger offered her shelter and hope, helping her rebuild her life, by giving Shlomit and her children a place to live until she could stand up on her own two feet. Today, Shlomit pays that kindness forward. She advocates for struggling families, collects food baskets, and even helped establish a Time Bank (a place where people “deposit“ their volunteer time and cash it when they need help) in Jerusalem to strengthen her community many years ago.Her unwavering faith drives her to lift others, even as her own burdens grow heavier. “It makes me feel good,” she says of her efforts to help others. Her story reminds us of Yeshua’s call to care for the least among us, to show compassion and love even in our own trials.Friends, we can be that source of hope for Shlomit and many others like her. Your support enables us to distribute essential aid, provide medical assistance, and sustain families facing insurmountable challenges. As we step into this new year, let us answer God’s call to stand with the brokenhearted.Will you help families like Shlomit’s continue her fight and bring relief to her family? Your gift can provide critical care and ongoing support during their darkest hours.\n\nPlease give todayand be the light Shlomit and others need. Together, we can transform lives through God’s love.With heartfelt thanks,Barry & Batya"
    },
    {
      "title": "StoriesTriumph Over Addiction: Meet TopazSaturday, November 9, 2024",
      "link": "https://www.visionforisrael.com/en/blog/triumph-over-addiction-meet-topaz",
      "image": "https://images.prismic.io/vfi-website/ZyqxbK8jQArT0PSl_WhatsAppImage2024-09-29at08.18.16cropped.png?auto=format%2Ccompress&rect=0%2C0%2C1195%2C700&w=3840&fit=max",
      "image_alt": "Triumph Over Addiction: Meet Topaz ",
      "category": "Story",
      "full_content": "Dear Friends,We want to share with you a story of a woman who touched our hearts deeply—one who reminds us all why we do what we do. Her name is Topaz*, and her life is a testament to the power of redemption, hope, and the incredible strength that can rise from the ashes of despair.Our team met Topaz in Rishon LeTzion, at the welfare office where we were giving out magnetic gift cards for the high holidays to families in need. She shared her story with us—a story filled with pain, yet overflowing with courage and perseverance. Topaz, now 45, once lived a life controlled by addiction, trauma, and brokenness.At just 17, she began using hard drugs after suffering a horrific rape, and her life spiraled downward from there. Her service in the army was cut short, and things only worsened as she found herself working in a brothel, sleeping on the streets, and seeing death up close when a friend she was staying with passed away.For years, Topaz's parents tried to help her, but each time she ran away from rehabilitation centers, too lost in her struggles to accept their help. In 2010, everything changed. After weeks of not eating or showering, a stranger convinced her to go to a rehabilitation center. She had reached rock bottom, and this time, something stirred within her—a glimmer of hope. For a month, she isolated herself from the world, staying in her room and refusing visitors. Sadly, her parents didn’t even come to visit her. They had given up hope, but God had not.In 2011, her eldest daughter was born in a rehabilitation center, and from that moment on, Topaz knew she had to change—for her daughter, for herself. Slowly, she began rebuilding her life. She returned to Rishon LeTzion in 2012, found work, and rented an apartment. Her journey was far from easy, and she faced further challenges, including a painful diagnosis of fibromyalgia. In 2014 she conceived another daughter and although she decided to break up with her fiance at the time, she kept the baby. Topaz has worked for 13 years at an elderly care company, supporting her family as much as her health allows.She is a proud mother of two daughters, and while her struggles continue, she is a woman transformed by her determination to rise above her past. Her eldest daughter is in boarding school, and Topaz remains deeply involved in her education, determined to break the cycle of pain and give her daughters the future they deserve.When we spoke with Topaz, we saw not only a woman who had endured immense suffering, but a woman who had found the strength to heal, to fight, and to overcome. It was your generosity that helped provide her and her family with the gift card that brightened their holiday. Your support does so much more than meet physical needs—it restores dignity, hope, and a future for people like Topaz.Even as the holidays are over now, we ask you to continue standing with us. Your donations help more families like Topaz’s—families who have faced unimaginable hardships but are filled with hope because of the support they receive.Your generosity brings light to the darkest places. Please, consider donating today to help us continue reaching those in need across Israel. Together, we can offer a hand of hope to so many more who are waiting for their own story of redemption.With blessings and gratitude,The VFI Team\n\n*name has been changed to protect the identity of this person."
    },
    {
      "title": "StoriesOur 30-Year Commitment to IsraelSaturday, June 29, 2024",
      "link": "https://www.visionforisrael.com/en/blog/our-30-year-commitment-to-israel",
      "image": "https://images.prismic.io/vfi-website/Znrcx5bWFbowe2HE_MedicalDisasterRelief.jpg?auto=format%2Ccompress&fit=max&w=3840",
      "image_alt": "Our 30-Year Commitment to Israel ",
      "category": "Story",
      "full_content": "Dear Friends,Today marks VFI’s 30th anniversary!\n\nAs Barry and I were driving to Jerusalem not long ago, we passed the street where our office used to be 35 years ago. Memories flooded back of our early days in publishing journals, magazines, and various publications. We enjoyed every moment of our work, but the situation in Israel was becoming increasingly difficult. Terrorist attacks were on the rise, and the call to \"comfort my people\" echoed in our ears. We realized that we must take the initiative and open a new chapter in our pursuits.The experience we gained in the business world prepared us for what was to come. In 1994, we officially registered Vision for Israel. Our vision was to support and rehabilitate the vulnerable populations in Israeli society, including new immigrants, Holocaust survivors, the elderly, lone soldiers, and those living below the poverty line. The distress of these communities and the need for emergency and rescue support were close to our hearts. We knew we had to act.Our journey has been one of love and commitment. In 1996, we faced the brutal reality of radical Islamic terrorism, which only deepened our resolve to be prepared for emergencies and to offer a helping hand. This shared vision between Barry and me was driven by a deep sense of purpose and a desire to be in the right place at the right time.In February 1996, we visited families who had lost their loved ones to hostilities. In 1998, we opened the Joseph Storehouse, our operations center in the Judean hills. It was a miracle in itself. By 2009, we had managed to purchase a lot to build a permanent home for Vision for Israel. Construction began in 2012, and in 2018, we entered the Millennium Center, the heart of our activities.\n\nReflecting on these memories, we are filled with gratitude. The inner feeling was that we should be prepared for emergencies in times of distress and lend a helping hand. The importance of being in a position to provide solutions in difficult times was clear to us. This drive was rooted in love and a desire to be in the right place at the right time.Over the past thirty years, Vision for Israel has distributed millions of shekels and provided aid to millions of people. We've supported hundreds of thousands of children and tens of thousands of lone soldiers. In times of emergency, we've supplied life-saving equipment to rescue teams and medical centers, including over 260 safety shelters, 8 ambulances, and a bloodmobile for collecting blood donations.We remember the initial days of Vision for Israel, registering as a nonprofit — feeling satisfaction despite not fully understanding the journey ahead. The unanimity and unity from everyone around us fueled our mission. The connection between our supporters worldwide and those in need was a bond we couldn't have anticipated.The path was challenging but filled with profound moments. In February 1996, our hearts broke as we visited families who had lost their loved ones to terrorism. Despite the pain, these visits strengthened our resolve. The opening of the Joseph Storehouse in 1998 marked a significant milestone. It was more than a warehouse; it was a beacon of hope.In 2009, securing a lot to build a permanent home for Vision for Israel was another miracle. The construction that began in 2012 and the completion of the Millennium Center in 2018 symbolized the growth and stability of our mission. This center became the heart of our activities, a place where love and support emanate daily.It's impossible to count and measure the donations and support that went out from Vision for Israel to all the recipients, the organizations, and the thousands of people who received aid each year. The impact is immeasurable, not just in numbers but in the lives touched and transformed.Love knows no boundaries, no numbers, no time. Thirty years is a long time, full of experiences and events, but most importantly, full of love. As we reflect on these three decades, we are filled with gratitude for the support and generosity that have made our work possible.Join us in continuing this journey of love and support. Your donation can make a real difference in the lives of those in need. Clickhereto donate.Thank you for standing with us and for being part of our Vision for Israel family.\n\nShalom and blessings,Barry & Batya Segal"
    },
    {
      "title": "StoriesLove & Support That Never Gives UpSaturday, June 22, 2024",
      "link": "https://www.visionforisrael.com/en/blog/love-support-that-never-gives-up",
      "image": "https://images.prismic.io/vfi-website/ZnBqKZm069VX10L8_Manatplayground_shutterstock_1479579602_med.jpg?auto=format%2Ccompress&fit=max&w=3840",
      "image_alt": "Love & Support That Never Gives Up  ",
      "category": "Story",
      "full_content": "No matter what we go through in life, we all need the faithful love of God that will never give up on us. Yossi’s story is one where we can see the love of God pursuing his heart through the ups and downs of his life.Yossi, 42, lives in Sderot with his mother and brother. At a young age, Yossi became friends with a group of people who negatively influenced him into substance abuse. From that point on, Yossi began to drink and use drugs.Over years of excessive consumption of alcohol, Yossi began to experience significant physical and mental effects. It got so bad that he almost lost his liver. As a result of the damage to the liver, he received 100% disability from National Insurance. To this day, Yossi lives off of this disability.Yossi received help at a rehab center for several years to help him with his addiction. He ended up recovering so well that he began to help others overcome their addictions. For 5 consecutive and dedicated years, he worked as an instructor in rehab helping many teenagers and adults with their rehabilitation. He was highly esteemed by his team and was able to advance to the position of instructor coordinator.In 2021, Yossi lost his father in a fire that broke out in his house while he was sleeping. He also lost a mentor who had accompanied him for years through his journey of recovery. And on top of that, he separated from his partner. With all of these overwhelming and heartbreaking circumstances, Yossi fell hard back into the world of drugs and alcohol.He moved in with his mother in Sderot and was broken, depressed, hopeless, and without any desire to live. Many made the effort to help him go back to rehab and recovery, but Yossi was so overwhelmed with sorrow, shame, and guilt that he couldn’t get out of his addictions.He hit rock bottom when he became a beggar at the central bus station in Tel Aviv. Even though Yossi had given up, his friends, mentors, and God never gave up on him. Many of his friends, who were former addicts, searched for him on the streets of Tel Aviv to encourage him and talk with him. But the final turning point was when Yossi got run over on the roads of Tel Aviv. He suffered serious injuries and almost lost his legs, but God spared his life and his legs. As soon as Yossi’s social worker and friends heard about his accident, they visited him at the hospital. They continued to faithfully visit him day after day during his long recovery at the hospital.When he was finally discharged from the hospital, he agreed to go directly to rehab. He went through rehab successfully and then moved to a therapeutic community for a year. From there he continued to a therapeutic hostel, where he began to thrive and help many others in their recovery process as well. When he finished the program and felt strong, he returned home.Shortly after returning home, the horrific events of October 7th happened. At the time of the incident, Yossi was at his mother’s house, and his sister (divorced) with 6 children, was at her house which was close to the police station in Sderot. This police station was overrun by Hamas terrorists who ruthlessly killed 35 Israeli officers and civilians.When Yossi realized there was danger outside, he called his sister to try and rescue her and the kids. Heroically, Yossi drove towards his sister's house and bravely managed to rescue all of them by piling them into his car. As they drove towards his mother's house, bullets were flying all around them, however, they managed to arrive safely.In the following days, they were relocated with thousands of other Israelis. For several months they were displaced from their homes, but Yossi and his mother have finally returned to her house. Today, Yossi still lives with his mother, but he realizes more and more that he needs his own space and privacy. Yossi had purchased an apartment during his \"good\" years but did not move into it because of the challenging situations he went through. He would like to return to his own apartment but needs financial assistance to continue to pay his mortgage and for the necessary appliances for his apartment.Thankfully today, Yossi has rehabilitated his life and is still connected to his mentors and treatments, who help him maintain his recovery. He also plans to return to instructing and helping others recover from their addictions.If you would like to partner with VFI in supporting Yossi and many others in their recovery process, visit our website and donatehere."
    },
    {
      "title": "StoriesA Lifesaving DonationSaturday, May 18, 2024",
      "link": "https://www.visionforisrael.com/en/blog/a-lifesaving-donation",
      "image": "https://images.prismic.io/vfi-website/ZkI2aEFLKBtrW017_DSC_3944_med.jpeg?auto=compress%2Cformat&rect=0%2C0%2C1700%2C900&w=3840&fit=max",
      "image_alt": "A Lifesaving Donation ",
      "category": "Story",
      "full_content": "Dear Friends,This January, Barry and I had the privilege of visiting the Eshkol region to support its emergency response teams. This visit came in the wake of the tragic events of October 7th, and I feel a deep connection to these teams, who faced unimaginable hardship yet persisted, guarding their communities with remarkable courage.The tragic day took nine of these dedicated security personnel from us, leaving an indelible scar on the Eshkol region. However, their successors continue their legacy, standing as beacons of resilience to protect the lives of those in the settlements. It is thanks to your unwavering support and generosity that Vision for Israel was able to provide a donation of equipment valued at NIS 500,000, including defibrillators, radios, and scanning lights for 32 squads.The event in Eshkol was moving, filled with both sorrow and resolve. As we spoke with the security officers and local leaders, their words resonated with a heavy sense of grief. The massacre of October 7th left a lasting scar, but their spirits are not broken. Their determination to safeguard their communities remains strong, fueled by love for their homes and families.I felt compelled to share a message of faith and unity, reminding them of the support from Christians worldwide. I said, \"We have many friends around the world who love us and know that the nation of Israel is alive, they are many and dear, Christians who love Israel, thanks to whom we can give you the donations today. They would come fight for us here if they could, and they mean what they say.\"I was also reminded of Barry’s dedication over the past two and a half years, installing shelters across the South, including 155 shelters around the Gaza Envelope. This project, fueled by your donations, has saved hundreds of lives, shielding families from rocket fire and other attacks.Your generosity makes a profound difference, supporting not only emergency response teams but the entire Eshkol region. Together, we are rebuilding and restoring the communities, offering hope and resilience in the face of adversity.As we left, I felt a renewed sense of hope. The bravery and dedication of the security teams, the support of our partners and donors, and the love of our global community strengthen us all. Together, we will continue to restore and protect the Eshkol region.Thank you for being a part of this journey and for your steadfast support.Donate Now\n\nWith love and blessings,Batya"
    },
    {
      "title": "StoriesCourage & Faith Amid Chaos & DeathSaturday, April 27, 2024",
      "link": "https://www.visionforisrael.com/en/blog/courage--faith-amid-chaos--death",
      "image": "https://images.prismic.io/vfi-website/ZiaMUfPdc1huKrqA_1_22_med.JPG?auto=compress%2Cformat&rect=0%2C0%2C1500%2C800&w=3840&fit=max",
      "image_alt": "Courage & Faith Amid Chaos & Death",
      "category": "Story",
      "full_content": "***Disclaimer: This testimony contains some graphic details about wounds and death from the war. Please read with caution if you are more sensitive to these details. The name of the security coordinator has been changed to Oren.It is one thing to hear about the war through the news, but it is another level of impact to hear about it from someone who was actually there on the battlefield. Batya had the opportunity to interview the security coordinator of Shlomit from the Eshkol region near the Gaza border. He shared his story at a special event, where VFI donated supplies to the 32 Eshkol region emergency teams.Now, let’s step onto a kibbutz called Shlomit, on October 7th, 2023 to get a glimpse of what Oren, the security coordinator, experienced that day.“We are used to (the red alerts) here in the area. We go in and out (of the safe room) and continue with life. But (that morning) it wasn't ending, and I, as a Ravshatz (security coordinator), wanted to check what was going on outside my house. As soon as I went out of the Mamad (shelter) I started getting messages (about everything going on). A rocket hit one of our neighbor’s houses, but a second before the rocket hit, they got into the shelter. The house was damaged significantly, (but thankfully) they were okay. The council and our spatial battalion said they saw a few terrorists by Kerem Shalom.“At this point, Oren thought the army would come and handle this situation. However, he was still getting ready in case the IDF soldiers needed backup. He updated his emergency squad with the messages he was receiving and told them he was going to drive around the neighborhood. Two of his good friends and neighbors Boaz, Oren’s deputy and paramedic, and Oz Sasson, a commander of the emergency squad, arrived ready in their gear without Oren even asking them to come.The first place they checked was the house that was hit by a rocket.As they continued to drive around the kibbutz, they listened to the two-way radio. They heard security coordinators reporting about terrorists infiltrating into many Israeli communities near the Gaza border saying:“Terrorists are going from house to house, purging the houses, and if the army doesn’t come they will slaughter the whole kibbutz…”Oren recounts moment by moment what happens next:“It was like a big wave, a tsunami that was slowly gaining power… At 7:38 am I heard Lotem, the security coordinator of Eshkol, share that he had an encounter with terrorists in Pri-Gan. Then he said, “I’m hurt, I’m disconnecting”. First, I know that he’s not the security coordinator of Pri-Gan, so if he reported it, then it means that their security leader is not there. And if Lotem’s disconnecting, it means that there’s no one else there to help. I also know that the security team in Pri-Gan is not strong enough to be challenged with this ordeal, so I knew that if we didn’t go over there, there would be a massacre…“Oren wrestled with the thought of leaving his own kibbutz to help fight for another one, especially knowing that the terrorists were traveling quickly by motorcycles. He decided to leave half of his strong team at Shlomit. Without hesitation, his two friends Boaz and Oz, joined him to fight in Pri-Gan. As they arrived in Pri-Gan, they could hear shooting and explosions and quickly realized the battle was between civilians and terrorists. They bravely headed toward the terrorists, and on the way, they connected with an emergency squad member of Pri-Gan who was coming out of his house.They joined together for a surprise attack on the terrorists. Oz and Boaz were the first to identify the terrorists, so they started shooting and the terrorists shot back. Some terrorists threw grenades and shot at them, injuring Oz and Boaz. Oz got a bullet in his thigh, and Boaz got a bullet in his back.Oren remembers this horrific moment as he saw his two faithful friends injured:“Boaz tells me ‘I don’t have a lot of time to live’. I heard him telling me ‘5-6 minutes’... he started saying the “Shma” prayer and started confessing. And I say to myself, ‘If Boaz is telling me that he doesn’t have a lot of time, he knows what he’s saying because he’s a paramedic.’ I go into rescue mode, and think, ‘I have only 5-6 minutes. How do I do this? I must get to the vehicle, bring it in a way that the terrorists won’t notice, load Boaz and Oz, and get them out.’ Then, Oz tells me, ‘We must get help’. So I tell him, ‘Get whoever is needed’.“Immediately after getting the call for help, a team from Shlomit started driving towards Pri-Gan. These men understood that every second was significant for rescue and battle. When they arrived, they encountered the terrorists. One person got hit with a bullet that cut his arm in half and collapsed. On the other side of the street, another person got shot in the leg. Oren met with the other security coordinator in the back of a house and they joined to fight and rescue. As Oren went into the street, he saw that one of the guys was with one of the injured team members and was covering him. He was grateful to see him alive and set it in his heart to complete the rescue mission.Meanwhile, another member of the emergency squad was on his way to help but was murdered along the way. Another 4 members of the emergency squad from Shlomit came to help.At this point, you may be wondering who is protecting Oren’s family and community back at Shlomit. This strong community of Shlomit had 2 members of their emergency squad equipped with weapons, along with several other brave residents ready for battle with their handguns. They all joined together to protect the settlement.Back at Pri-Gan, the battle intensified when the terrorists started shooting at two squad members who were hiding next to a very narrow electric pillar. The terrorists shot with such precision and killed both of them. Oren explains:“When I looked through the binoculars I saw that Reuven was killed, and I was left with Moshe and with Michael who is badly injured...”Oren contacted the emergency squad asking for help, and they told him that the army was on the way. A few soldiers showed up but wanted to wait until more soldiers came for reinforcement. It took some time but eventually, the soldiers and emergency squad joined together to fight the terrorists and Oren was able to complete the rescue mission, saving three people.At this point, Oren was amazed that his friends were still alive, but he knew they needed to get to the hospital quickly. At the same time, the terrorists were retreating due to lack of ammunition, injury, and fear of the number of soldiers that were coming to fight against them. Miraculously, not one resident of Pri-Gan was physically injured! The 25 residents of Pri-Gan were in 4 homes inside the safety rooms. Oren and his team heroically fought the terrorists and protected the people of Pri-Gan.Oren and his team brought the people out of the shelters to more protected areas, evacuated the injured, and gathered the ones who lost their lives as they bravely fought against the terrorists. Eventually, the security coordinator of Pri-Gan returned and regained responsibility with the help of the soldiers.After all that happened, Oren was eager to get back to Shlomit to see how his family and community were doing. As soon as he got back, he started preparing his community for a situation of attack. He and his team shared the horrible news of the 3 men from Shlomit who were killed in battle and the 4 men from Shlomit who were wounded in Pri-Gan. This was so hard, especially because they were such close friends and neighbors.Oren finishes the story by saying,“All the credit goes to Shlomit’s emergency squad, and to God almighty who gave us the strength.”This is just one of the many horrific testimonies from October 7th. We acknowledge God’s mighty hand and these brave men who went out of their way to protect the communities of Pri-Gan and Shlomit. We salute Oren, his emergency squad, and the many brave ones who fought to protect this nation.Please continue to pray for all the families that have lost loved ones during this war, and for the soldiers who continue to fight this long and difficult war. And pray for the Lord to continue fighting for Israel and save us from our enemies surrounding us.We also remember the 133 hostages and pray for their release from the hands of Hamas — babies, children, mothers, young women, men, and the elderly. May God set them free and may we see them come home soon!"
    },
    {
      "title": "StoriesHeroes in Israel & Around the WorldSaturday, March 30, 2024",
      "link": "https://www.visionforisrael.com/en/blog/heroes-in-israel--around-the-world",
      "image": "https://images.prismic.io/vfi-website/ZgL_eMcYqOFdyGHw_DSC_3953_med.jpeg?auto=compress%2Cformat&rect=0%2C0%2C1700%2C900&w=3840&fit=max",
      "image_alt": "Heroes in Israel & Around the World",
      "category": "Story",
      "full_content": "It has been 30 wonderful and challenging years of leading Vision for Israel.The Iron Swords War came upon us by complete surprise, and the enemy succeeded in penetrating Israel by harming innocent civilians — a cruel and brutal massacre like no other. However, in this war story, we are encouraged by all of our amazing heroes.We all know that you cannot defeat the enemy without courage and heroes. We have heard heroic stories of men and women who have laid down their lives to fight, protect, and save the lives of many. There are many stories of heroism, and we want to recognize and honor a few special heroes we know.Our heroes are the staff members at VFI, who readily extended help and assistance wherever they could throughout this war. It was a beautiful phenomenon, not only among our staff but also among the people of Israel, unifying together to help one another. This is also what it was like for Israel after the Six-Day War and the Yom Kippur War.One special hero I want to honor is my husband and co-founder of VFI, Barry. He is such a hard worker and goes to every placement of the safety shelters. He travels throughout the nation of Israel, to areas of conflict, right on the borderlines, and endures all kinds of weather conditions and rocket fire to ensure these shelters are placed to protect the people of Israel!And now VFI wants to take a moment to honor another wonderful hero — YOU! When the war began, we saw a wave of financial donations flowing in from you and many others. Before we even had a chance to ask, you generously gave to VFI, so we could help the people here in this time of crisis. In faith, we were donating large amounts of aid that we hadn't raised yet. And by faith, you generously gave, and we witnessed God do amazing miracles of providing for His people through your enormous support.In December 2023, we had to approve a budget for 2024. As I spoke with the CPA and accounting department, I explained that in light of the war, we wanted to help as much as possible. So, I presented a budget that was three times the amount of the budget of the previous year. Today, three months later, the distribution of donations is already fourfold!At the beginning of March, we planned to purchase gift cards for Passover and we had an increase in the number of families in need. Then we received a request to help an additional 200 evacuee families. During the conversation with the applicant, we had to decide if we would increase the budget or not. Even though we hadn’t raised the funds for it yet, we had peace from the Lord to commit to helping all of these families for Passover.Just one hour later I received a text from a local donor asking, \"Do you have a special project to help evacuees from the south?\" I said, \"Of course, we are preparing for Passover right now!\" They said, \"We have a large donation for the evacuees, and we will transfer the donation to you immediately.\"Before we even asked anyone, God already put it on the hearts of His people to provide financially for this need! What a wonderful thing to see the hand of God working through the body of Yeshua to take care of His people!This is the beauty that is in you, dear friends. Today, three months into the year, our outgoing donations have already increased wonderfully, so that we can be a blessing to this nation and tangibly show them the love of God.We are so grateful for you dear friends and heroes!Love,Batya"
    },
    {
      "title": "StoriesAbundant Gratefulness Amid SufferingSaturday, March 9, 2024",
      "link": "https://www.visionforisrael.com/en/blog/abundant-gratefulness-amid-suffering",
      "image": "https://images.prismic.io/vfi-website/c393e541-1ce4-439f-a489-46d0c76495c6_WhatsApp+Image+2024-02-04+at+09.50.08.jpeg?auto=compress%2Cformat&rect=0%2C0%2C1600%2C1000&w=3840&fit=max",
      "image_alt": "Abundant Gratefulness Amid Suffering  ",
      "category": "Story",
      "full_content": "This is Shalom’s story, one filled with great suffering, and yet he chooses to let thankfulness overflow in his heart in the midst of it all.We have known Shalom and his wife, Bruria, since 2015. We provided them with eyeglasses, and have stayed in touch throughout the years.In 2004, Shalom was injured in a rocket attack and his life has never been the same. Both Shalom and his wife have mental and physical disabilities and are supported by the government and Social Security. Shalom takes anti-depressant and anti-anxiety medication, along with weekly treatments at the Sderot Resilience Center and monthly check-ups at the Sderot Mental Health Center.And if that was not enough to battle with daily, on October 7th Shalom and Bruria were also impacted by the massacre. The terrorists were in their neighborhood that day, and this is what Shalom remembers...“On the holy Sabbath, 07/10/23 at 06:27 in the morning, a red alert was activated in the city... Sderot, where I reside. Heavy barrages of rockets landed continuously. In my neighborhood, despicable terrorists started shooting at my building, and at passers-by and killed some of them...We called the local police station in a panic, but there was no answer. It turns out that terrorists were also there and murdered police officers. So, my wife, Bruria, and I locked ourselves in the Mamad (safety room) for about 10 hours until the IDF arrived.We are now staying at a hotel by the Dead Sea... We receive close mental support. These are hard days, and we can't sleep at night. I rarely leave the room, to avoid meeting people in the elevator. It's thinking endlessly about my friends who were murdered and how it happened that they were murdered.Dear Mrs. Segal, know that it is only thanks to your blessed help as always, you give us, thank God, the strength and the desire to get the most out of life despite all the difficulties.“Shalom and Bruria have been evacuated from their home since October 10, 2023, and are staying at a hotel by the Dead Sea, which the government provides. Shalom and his wife were evacuated under intense pressure, massive rocket fire, and terrorists still hiding in their city. As they were leaving their home, Shalom’s laptop fell and broke. They also couldn’t equip themselves properly before leaving their home.VFI is providing Shalom with a new laptop to replace the one that was broken when he fled for his life. Recently, Shalom also discovered that the water heater in his home was damaged and needed to be replaced. He asked us if we would be able to help him, and we are pleased to help provide the finances for a new water heater and solar panels.Shalom wrote us a beautiful, heartfelt thank you letter when he heard the great news:“To the dear, loving, and compassionate \"mother\" and the founder of Vision for Israel - the honorable and amazing lady Segal Batya... A big thank you for the huge help in paying for both the solar heater and the computer.You give a person like me, who waves his hands in a silent, desperate plea, one of the occupants of the last car on the last train, which has long since left the platform and feels lonely and forlorn, crying out in a voice that no one can hear anymore... You are like the first ray of light from the darkness, appearing in her house as the redeeming angel, and hears and responds to help in every request of the guest.Today I sleep in my room at a hotel on the shores of the Dead Sea and dream dreams of peace and quiet despite the difficulties that stand in my way. They have become softer and more pleasant, and by the grace of the great God, I have the desire and courage to get the most from life because of your warm attitude Batya, and your special employees.“Shalom came to visit us at the Millennium Center to receive the aid that we provided him. Following his visit, Shalom wrote us another beautiful thank-you letter:Unfortunately for all of us, this war, whose end is not yet in sight, continues to hurt many. This situation emphasizes the enormous need for the continued existence of your organization. And your giving is so simple and natural, and it is done in a dignified and noble manner so that it relieves me of even the unpleasantness of being needy.Since I fled in panic, shortly after the massacre was perpetrated by the criminals, when I had to be displaced from the family nest urgently and hastily, my laptop broke, I received a new computer from you, on which I am now pouring out my words for you. How can I cherish you and repay you as you deserve? And if this gesture is not enough, the organization also bears the cost of repairing the solar heater and the malfunctioning solar panels.It's been four months that we, all of us, have been in panic, in turmoil, in darkness. Many of us are in mourning over the murder of loved ones and acquaintances. For four months now we have been subject to nerve-wracking and nail-biting anticipation for the return of the hostages. However, there are also soft and good rays of sunshine, warm and illuminating, shining through the thick black clouds and signaling hope. You, dear ones, are not rays of light - you are a beam of light, with all its colors and shades. For years in general and today - even more so - I have seen and felt it.“Even though Shalom and Bruria have suffered much, they choose to let thankfulness fill their hearts and overflow onto many around them. We are grateful to know them and to be able to serve them in their time of need.Join us in continuing to support many other Israeli’s displaced from their homes, as this war continues on."
    },
    {
      "title": "StoriesGod’s Peace & Hope Amid WarSaturday, February 24, 2024",
      "link": "https://www.visionforisrael.com/en/blog/gods-peace--hope-amid-war",
      "image": "https://images.prismic.io/vfi-website/e4198f41-8129-4267-b65c-0304f49b6396_Re%27im_shutterstock_2409242523_med.jpg?auto=compress%2Cformat&fit=max&w=3840",
      "image_alt": "Re'im ",
      "category": "Story",
      "full_content": "Dear friends,Amid war, peace is one of the hardest things to find. On October 7, 2023, the nation of Israel was shaken to the core and lost all peace, when the enemy invaded from Gaza and massacred our citizens. The evil enemy made it their goal to murder babies, children, the elderly, women, and all the citizens who were sleeping in their beds early on a Shabbat morning. This Shabbat was also a holiday — Simchat Torah. It is normally a day of rejoicing, yet instead, the enemy swept in and made it one of the worst days in the history of this nation. These wicked people murdered, butchered, decapitated bodies and limbs, burned babies in ovens, and stole from houses. 1,144 people in Israel were murdered, most of them civilians, and 243 were taken as hostages. And thousands more were injured. We, the citizens, have become the main targets in the enemy's war against us.Pain, suffering, and heavy grief were laid on the shoulders of our people that day. So, in the midst of all of this, how in the world do we find peace? How can we find hope and faith in such chaos and evil? The only place we can find true and deep peace is in Yeshua. He is the only one who can help guard our hearts and our minds by giving us a peace that surpasses all understanding. In the book of John, Yeshua says:\n\n“Peace I leave with you; my peace I give you. I do not give to you as the world gives. Do not let your hearts be troubled and do not be afraid.” - John 14:27\n\nAll of these horrible things bring me (Batya) to a place of searching for justice, especially in the areas of social and personal security for the citizens living in the \"promised\" land. Today, Israelis are looking for promises in the scriptures about the long-awaited days of peace for our people. From the day the state of Israel was established in 1948, we have been at war for our existence and have had battles against terrorism almost daily. Yet, we still believed in signing peace agreements with the Arab countries around us and thought we had entered a new era of ‘peace’. But instead, we find the small state of Israel once again being attacked by enemies around us.Since the war began, the Israeli people have been bombarded with daily updates and news about what is happening to their beloved people and our land. All of this horrible news has stolen our peace. Many are disturbed by their thoughts, horrific images they have seen, overwhelming fear, worry about hostages and loved ones, and many other heartbreaking aspects of this tragedy.Our lives here in Israel have been turned upside down, and we don’t know when this war will end. We all feel the pain, grief, and bereavement. And we ask, ‘Why are we doomed to go through another Holocaust?’ ‘How do we keep our minds at peace during war?’ ‘How do we maintain a balance between the harsh reality and a healthy inner peace for our soul?’One of the ways for us to fight fear and worry is by accepting the word of God and His promises to us.\n\n“Say to those who are fearful-hearted,\n\nBe strong, do not fear!\n\nBehold, your God will come with vengeance,\n\nWith the recompense of God;\n\nHe will come and save you.” — Isaiah 35:4\n\nThe best thing we can do is to read the scriptures, pray, and fix our eyes on the Lord. God intended for us to have a relationship with Him. When we focus on His word our eyes are fixed on Him and not on ourselves. The word of God can redirect our thoughts towards the Lord, instead of being focused on the world and ourselves or overwhelmed by this horrific war.\n\n“The people surviving the sword\n\nfound grace in the wilderness—\n\nwhere I gave Israel rest.”\n\n“From afar Adonai appeared to me.”\n\n“Yes, I have loved you with an everlasting love.\n\nTherefore I have drawn you with lovingkindness. Again I will build you,\n\nso you will be rebuilt, virgin Israel!\n\nAgain you will take up your tambourines as ornaments,\n\nand go out to dances of merrymakers.\" - Jeremiah 31:1-3\n\nWith enemies on all of Israel’s borders and others rising all around the world, Israel needs hope now more than ever.As believers, the only true way to overcome hopelessness is to stand firm in Yeshua. He is our hope and light no matter what we go through. The prophecies in the Bible remind us that the Messiah will redeem and save us. And it is only with the power of the Holy Spirit who resides in us, that we can stand firm in this truth during the war.God’s promises are eternal and unchanging. Three thousand years ago, God promised this land to Abraham, Isaac, and Jacob, and it still belongs to the Lord and His chosen people. And yet, this promise is being challenged by the enemy and many others believing lies about God and His covenant with Israel.Before the war, there was such a great divide among the people here in Israel. There were terrible demonstrations about legal reform that led to the unstable security situations on the borders of our nation. However, since October 7th, there has been a strong unity and a great change in the hearts of the people. We can see the people of Israel supporting one another, comforting one another, and crying together. So many social initiatives, open hearts, giving to those who need help, and speaking about unity to bring peace to one another as the war rages on.The enemy came to destroy us, but the Lord will restore, rebuild, and revive us! Pray with us that the people of Israel will find peace and hope amid war having the assurance of His salvation and everlasting love."
    },
    {
      "title": "StoriesThe Resilience of a Father – Defending Israel & Rescuing His FamilySaturday, December 23, 2023",
      "link": "https://www.visionforisrael.com/en/blog/the-resilience-of-a-father--defending-israel--rescuing-his-family",
      "image": "https://images.prismic.io/vfi-website/6545d141-a256-4a5f-940c-3251a6349ec8_WhatsApp+Image+2023-11-13+at+02.15.52+%281%29.jpeg?auto=compress%2Cformat&fit=max&w=3840",
      "image_alt": "The Resilience of a Father ",
      "category": "Story",
      "full_content": "Caution: This story includes heavy details from a personal testimony of the horrific events on October 7th, 2023.Can you imagine waking up early in the morning to the sounds of shooting and a barrage of rockets? This is what Hezi and thousands of others living in Israel experienced on October 7th, 2023.Hezi is a father of two daughters who lives in the city of Sderot, near the Gaza border. He has 27 years of experience in the security services, was an officer in the Shabash (Israel’s Prison Service), and has suffered from PTSD due to terror attacks. At the end of the Tsuk Eitan operation, Hezi was an officer in the reserves and witnessed a young boy die in a terror attack. That left him with a severe case of PTSD.VFI initially met Hezi through an organization that helps terror victims in Israel. We have supported Hezi and his family for several years, and we are honored to continue to support them and many others amid this war. Despite his struggle with PTSD, this brave father didn’t let it hold him back from defending his nation and his family on that horrific Saturday morning.On a typically peaceful Shabbat morning, Hezi was planning on going for a morning run, when all of a sudden he heard the sounds of intense rocket fire accompanied by a unique sound of shooting. He recognized the sound of the shooting as heavy weapons being fired, and instantly told his brother,“Listen, there are terrorists in Sderot.”Around 7:30 in the morning, he called the army and the southern command, but there was no answer. Hezi explained what he did next,“I called a higher-ranking officer that I really respect. He is a religious person and he usually doesn’t answer the phone on Shabbat. But this time, he did. He thought I was about to talk to him about the rockets, but I told him, ‘What rockets? There are ISIS terrorists here with vehicles.’ He told me, ‘Hezi, maybe because you have PTSD you are still in trauma from the rocket attack. Try to calm down.’”Right away, Hezi took photos of the terrorists outside and sent them to the officer. He also filmed a jeep full of terrorists shooting at an Israeli police vehicle. The same jeep was also shooting in his direction because they saw him in the window. The images the world has seen on TV were a living nightmare and reality for Hezi and thousands of Israelis living near Gaza.When Hezi sent these images to the officer, he quickly understood that there were no forces ready to fight these terrorists. There were only a few police officers in the station, and in the photos, you can see the heroic policemen on the roof of the station fighting for their lives.At this point, Hezi knew he had to help in some way. So the first thing he did was put on the Israeli army uniform that he still had from the reserves. He was no longer a reserve soldier, but he saved his uniform for moments like this. Even though he had his uniform on, he didn’t have a weapon. He was ready to help the IDF soldiers when they arrived, but surprisingly no soldiers came.\n\nInstead, the Magav (Border Police) tactical forces and Sayeret Matkal (General Staff commando unit) officer came and asked Hezi where the terrorists went. Hezi drove with the small team and led them to the police station, where the terrorists went. At one point, Hezi looked at one of the officers, and said, “Friend, I am with you, I just don’t have a weapon”. Hezi explained,“He gave me his gun, and he took his automatic gun. And then I understood at this point that I was joining the fight because there were no forces. There were 30-40 terrorists with no [IDF] forces!”When they arrived at the police station, they saw the police forces of Magav fighting. They managed the fighting, including the infiltration of the building and eliminating the terrorists. All of a sudden, there was a huge explosion that hit Hezi, and he lost consciousness. There was a police officer next to him who was badly injured with shrapnel in his head. They were both taken to Soroka Hospital.Hezi woke up in the hospital. There was a lot of confusion among the staff and the system was overwhelmed. As Hezi lay there in the hospital bed, he could see many soldiers and policemen from different units, all punctured by gunshots. The images of their faces were horrifying. There were little children—terrified by the sights their innocent eyes had to see. The parents were still holding their kids and there was blood everywhere. After seeing how desperate these people looked, Hezi said,“Doctor, why am I here? People need this bed.”The doctor told him that he needed a CT scan of his head.After Hezi received medical treatment, he heard rumors about women and children being kidnapped and taken to Gaza. As he was lying in the hospital bed, he received a message from his youngest daughter (13), who was at Kibbutz Mefalsim with her older sister (16) and mother (Hezi’s ex-wife). The message read:“Abba, I’m scared of being here. There is a shooting here in Kibbutz Mefalsim. There is shooting—Abba, abba. Answer me. I’m scared.”Can you imagine the thoughts running through Hezi’s mind about what could happen to his daughters?As soon as the doctor came back, Hezi asked to leave.The doctor checked him one last time and then released him. Hezi hurried out of the hospital and jumped in the nearest jeep that was full of blood from soldiers who had just come there.As Hezi was driving to the kibbutz, he was horrified by what he saw. Bodies were all over the road to the point that he had to swerve back and forth to avoid running over dead bodies. Hezi recalls,“I drove like crazy to Kibbutz Mefalsim to rescue my daughters. I joined the fighting there too with the soldiers and the local alert force. We fought at the entrance gate of the kibbutz, and then I could enter to reach my girls!”When he finally reached his girls, he saw how terrified they were. They had been hiding in the safe room with their mom for 18 hours. Hezi managed to rescue them and get them out of the kibbutz.As he looked around at Kibbutz Mefalsim, he saw dozens of terrorists on motorcycles shot down by the local alert force and army. Miraculously, the terrorists didn’t get into the homes of the residents. The local alert force and the army unified together to kill the terrorists who were trying to murder and kidnap the people in the kibbutz. There was also a shooting fight at the gate of the kibbutz, where many terrorists tried to enter. Thanks to the bravery of the alert forces, Kibbutz Mefalsim and Hezi’s family were saved.As Hezi rescued his girls from the kibbutz, they grabbed what they could and ran for their lives. The youngest daughter brought her tablet that she received as a Bat Mitzvah gift from VFI a year ago at the annual Bar/Bat Mitzvah celebration. However, in the rush, the tablet fell and broke.After all of this, Hezi contacted us and asked us for some help. His financial situation was hard to begin with, but after the events of October 7th, things got even worse. He asked for 2 tablets, one for each of his daughters, so they could participate in distance learning. They were also in need of basics, like clothing, shoes, and hygienic products. We were able to provide tablets for the girls and also gave Hezi a laptop so he could go back to school, as well as gift cards to help them purchase some basic necessities.\n\nWhen you ask Hezi how he’s doing he answers“...alive on the outside, but dead on the inside.\"He also said,“These sights are haunting me non-stop, and I am suffering from extreme anxiety and long sleepless nights.\"What he and many others have gone through and seen on October 7 is unimaginable. All of these atrocities, horrific memories, and images have shaken him and thousands of others to the core.Let us first pray for them. Pray for God to set his people free from these horrific reoccurring images and trauma that they have gone through during this war. Let us also pray for the hostages that have been released and those still held.A study finds that 84% of Israeli kids, and 40% of parents suffer emotional distress over war.This is the time to take action and show Israel that we are standing with her during this war. Join VFI in meeting the practical needs of Israelis, like Hezi and his family, as we battle through this war!"
    },
    {
      "title": "StoriesOctober Impact Report 2023Saturday, October 14, 2023",
      "link": "https://www.visionforisrael.com/en/blog/october-impact-report-2023",
      "image": "https://images.prismic.io/vfi-website/cde760ab-7bec-484f-9477-b519f3d845ed_WhatsApp+Image+2023-07-30+at+07.17.15+%281%29.jpeg?auto=compress%2Cformat&fit=max&w=3840",
      "image_alt": "Pack to School",
      "category": "Story",
      "full_content": "Over the last few months, we have seen the Lord provide for His people in very personal ways. It is beautiful to see the people so touched by God’s love through a practical need that we were able to meet. Thank you for the incredible impact you are making on the people here in the Land of Israel. Now, let’s take a closer look at how God provided through you and VFI to impact these precious people.\n\nWhile the children of Israel were on summer vacation, the expenses for families were increasing significantly. For distressed families, this is a particularly difficult time. Our team set out to distribute aid to hundreds of families around the country. Each family received a magnetic gift card, hygiene products, food, and a basket of fresh vegetables. The recipients were very happy and expressed their gratitude and appreciation to VFI.One of the recipients, a father of a family who immigrated from the former USSR, shared that his family was in need of hygiene products. They had to give them up because of their severe economic hardship. When he saw that the donation included hygiene items, he exclaimed: \"I'm shocked! Wow, this is unbelievable! Everything is from God! Thank you very much!\" We were very touched by his story and how God provided exactly what he and his family needed.\n\nThe school year began in September and we are happy to know that the sweet children from low-income families arrived at school with high-quality school bags, just like all the other children. During July and August, the VFI team distributed school bags through ourPack to Schoolproject to about 1,000 children from low-income families throughout Israel, including Rishon Lezion, Jerusalem, Sderot, Ashdod, Petach Tikva, Lod, Rosh Ha'Ayin, Tel Aviv, Modi'in, and Netivot. Some of these children are at risk, refugee children, children with special needs, or new immigrants.At some of the distribution points, we held fun activities for the children. On the first day of school, our hearts were filled with comfort as we remembered their sweet smiles and the words of thanks we received from these precious children. Rise and succeed, dear children!\n\nAs part of our collaboration with the Yad b'Yad organization, which cares for children at risk, Vision for Israel invited dozens of children at risk in preschool through 2nd grade for a day of pampering. The children arrived in transportation sponsored by VFI from all over the country to the Millennium Center. Upon their arrival, the children received a light breakfast. The day's activities included an interactive performance by the Sippur Theater, pizza for lunch, and a gift of a backpack with stationery or a kindergarten bag. These dear children, who come from distressed families, impacted us with their smiles, words of thanks, and the light in their eyes.\n\nThe VFI staff distributed 69 school bags to first graders who are asylum-seekers children in Tel Aviv. These families are treated by the municipal welfare unitMesila, which provides them with assistance and psycho-social treatment. We met families with health problems, parents in long-term hospitalization, children with special needs, single-parent families, and more. Many live in abject poverty, without entitlement to allowances in extreme situations, with almost no rights or social services.We received a very moving thank you letter from Mesila, saying: \"I would like to point out the kindness, professionalism, and great kindness on the part of the Vision Israel team [...] They welcomed the parents and children who came to receive the school bags and did not give them even a single moment a sense of need [ ...] A huge thank you for helping many of the community's children start the year with a new backpack and with a smile.\"\n\nWith the high holidays upon us, there is an atmosphere of leaving our troubles behind and looking ahead with hope towards the new year. Every year, Vision for Israel takes care of families who cannot put a holiday meal on the table or celebrate the holidays with dignity.The VFI team arrived in various cities throughout Israel to distribute gift cards to about 1,500 families and individuals to help them buy groceries for the holiday meals, clothes, and anything else they might need. Among the aid recipients were the elderly, minors, parents of children with disabilities, single-parent families, new immigrants, lone soldiers, and more. Everyone expressed gratitude for the essential gift to help them celebrate the holiday comfortably, with hope and a smile."
    },
    {
      "title": "StoriesA Thankful Heart in the Midst of SufferingSaturday, September 23, 2023",
      "link": "https://www.visionforisrael.com/en/blog/a-thankful-heart-in-the-midst-of-suffering",
      "image": "https://images.prismic.io/vfi-website/817f3cb9-e33d-4a78-9323-ef24eb2bfadd_editorial_woman_poverty_shutterstock_1996015922_med.jpeg?auto=compress%2Cformat&rect=0%2C0%2C1700%2C907&w=3840&fit=max",
      "image_alt": "A Thankful Heart",
      "category": "Story",
      "full_content": "One of the most rewarding parts of the work that we do at VFI is to hear the personal stories of how God is making an impact on the lives of His people. And one precious life that we recently had the honor to know and bless is Ruth.In August 2023, the VFI team went to Rishon Lezion to distribute gift cards to families in need. Among these people, we discovered one very grateful woman who caught our attention, and her name is Ruth*. As she arrived at the distribution center and was informed that she was going to receive a gift card, a smile lit up her face. She was so happy and wanted to give thanks to VFI for the support.That day we learned more about Ruth and her story. This precious woman lives all alone and is suffering from health issues caused by a hereditary genetic disease. As a result of the disease, her brother died at the age of 57, and her sister is currently in a very serious condition. This is a disease that has damaged the genome of her entire family. This chronic disease makes it difficult for Ruth to function on a daily basis, so she has not been able to work for several years.She was undergoing rehabilitation, however, since the start of the COVID pandemic, she stopped receiving alternative treatments and special injections from abroad. And now, she is not able to afford these treatments to help her condition.She really wants to recover and return to the workforce, but until then, she struggles through the pain of her disease and uses welfare to buy the special food that she has to eat. Even though Ruth has a very difficult life, she chooses to give thanks for the little things.After Ruth shared with us about the challenges in her life, she continued with a grateful heart and said, “The gift card is very significant and useful because I cannot eat certain foods due to my medical condition. I really appreciate the donation from Vision for Israel, which is very helpful for the holiday.”God impacted Ruth’s life through your support to VFI with a simple gift card, and yet, God also impacted us through her with the way she expressed thankfulness in the midst of her suffering.So, as we pray for healing for Ruth and pray for the many others who are in need, let us remember to give thanks to the Lord even in the midst of our suffering.\n\nThere are so many others who are poor and in need here in Israel. Join us in making an impact in Israel by giving a gift to the poor today. ClickHEREto donate and dedicate your donation to “Aid to the Poor”.*Name has been changed to protect the identity of this woman."
    },
    {
      "title": "StoriesThe Gift of Life — Thoughts about Life, Death, and the In-betweenSaturday, June 10, 2023",
      "link": "https://www.visionforisrael.com/en/blog/the-gift-of-life--thoughts-about-life-death-and-the-in-between",
      "image": "https://images.prismic.io/vfi-website/f6ecacf7-99dd-4c90-9b78-df7f6b246554_shutterstock_1687599988_med.jpg?auto=compress%2Cformat&fit=max&w=3840",
      "image_alt": "Holding Hands",
      "category": "Story",
      "full_content": "Barry and I were eagerly awaiting the birth of our granddaughter, a new life, and great joy being added to the family. Thankfully, she was born and we all celebrated that she entered safely into the world, healthy and sweetTwo days after the celebration of our granddaughter's birth, we received a message from the nursing home where Barry's mother was living. They told us that her breathing was irregular. Only ten minutes later they informed us that she passed away peacefully in her sleep at the age of 95. A strong feeling of great loss took place in our hearts.Everything happened so quickly. In an instant, we went from rejoicing to mourning. God gave a life and God took a  life.It reminded me of when I lost my mother 16 years ago. It happened so quickly, and my first thought was that I didn't have time to sit down with her for long conversations to hear all of her wisdom about life. I wished I would have had more time to do things together with her and to tell her how much I appreciate all her hard work, cooking, and providing for us in the best way she could all those years. Indeed, this feeling of not being able to express our heart's appreciation to those who we love so much and who are no longer with us is very burdening.When Derek Prince was on his deathbed he asked us, \"Have I done enough in my life to serve God?\" Barry answered him and said, \"Of course, you did what you could. You traveled the world and taught from the scriptures. Hundreds of thousands of people were blessed by your fruitful teaching.\" Derek replied, \"I feel I didn't do enough\"...\n\nFor none of us lives for himself, and none dies for himself. For if we live, we live for the Lord; and if we die, we die for the Lord. So whether we live or die, we belong to the Lord. For this reason Messiah died and lived again, so that He might be Lord of both the dead and the living. — Romans 14:7-9\n\nLife can be a non-stop race of action and activity without limits. Therefore, we are not able to make a report of all our achievements throughout our lifetime. God examines our hearts and sees all of our actions.The cycle of life begins as a newborn baby and continues over the years in the bosom of a family. This stage of life is preparation for starting life on our own as mature and responsible people. We celebrate important events in our lives, learn and grow, overcome challenges and hardships, and eventually grow old and come to the end of our lives on this earth.The life we have on earth is short, so the way we choose to live it holds great importance. It is necessary to listen to the ones who have gone before us to gain wisdom on how to live this life God has given us. Barry and I were both blessed with parents who believed in values that were rooted in the word of God and faith. Therefore, we are honored to pass their legacy on to future generations.As you take a moment to reflect on the importance of life, let me ask you a few questions: What is the content you have poured into your life? What is your purpose and meaning in this life? Many of us walk around feeling like we missed out on something. Just like Derek Prince, we feel like we have not done enough.We have to remember we are not all called to do everything, but we are all called to do the things God has asked us to do.\n\nDear reader, now is the time to live out the legacy that God has for your life here on this earth! You were born for such a time as this, and God has a mighty purpose for your life. We encourage you to ask God, “What are you calling me to do right now? What is the legacy you want me to leave behind?” Take time to listen to Him. When God speaks, get ready to step into action. Your simple act of obedience to Him could greatly impact future generations!If you feel led to support VFI in any way, then please visit our website to discover theways you can giveand serve the Jewish people today! Also, if you would like to learn more about VFI’s legacy giving, clickHERE."
    },
    {
      "title": "StoriesVictory Over Terror and LossSaturday, May 13, 2023",
      "link": "https://www.visionforisrael.com/en/blog/victory-over-terror-and-loss",
      "image": "https://images.prismic.io/vfi-website/3092da42-dd66-420f-a5be-5fcca2b55940_emergency_shutterstock_164855477+%28editorial+use+only%29+med.jpg?auto=compress%2Cformat&fit=max&w=3840",
      "image_alt": "Emergency Services",
      "category": "Story",
      "full_content": "Israel is no stranger to terror attacks, and unfortunately, many suffer the devastating and life-altering physical and emotional effects of these attacks even decades later.The story of Gloria Riani, a terror attack survivor, is one we wish was never her's to tell.An outstanding woman with a career working at the Hillel Yaffe hospital, a wife and mother to five children — she and her son's lives were turned upside down, never to be the same.When she recalls that horrific day, Gloria cannot hide her helplessness and, in her own words, considers herself a \"broken vessel,\" not just physically but mostly mentally.Fortunately, Vision for Israel has had the immense privilege of providing Gloria and her family with financial aid for the holidays for several years, including the last Passover.Gloria and her 17-year-old son, Doron, were injured in the bloody attack that took place on July 12th, 2005, at the entrance to the Sharon Mall in Netanya, and since then, their lives have become unbearable.It was a hot July day, and Gloria was dealing with the mundaneness of life — trying to change her son Doron's dental appointment unsuccessfully.So they decided to spend the gap in their schedule on a quick trip to the Sharon Mall near their house. Kids were on their summer break, and the mall was crowded with Netanya residents and hundreds of youth ditching the heat for a hangout at the mall.It was then, when Gloria and Doron left the mall on their way to the appointment, that their lives changed forever. Gloria exited first and sat on a nearby bench beside a man as she took a phone call and waited for Doron to follow. From the corner of her eye, Gloria noticed her son, Doron, coming out of the mall as commotion stirred up.\n\n\"I heard shouts and commotion at the entrance to the mall, but I didn't pay much attention to it, and then it was as if the sky had fallen. Suddenly, there was a huge explosion; everything shook, and I was flung back a few meters. I found myself lying on the ground, feeling great pain in my right arm, and lying motionless next to me was the guy who sat down next to me on the bench. I tried to move him — he was dead. At this point, I tried locating Doron. The force of the explosion sent him flying in a different direction altogether. Despite the immediate commotion, I managed to see him calling to me.“\n\nThe attack at the Sharon Mall in Netanya took a heavy toll. The terrorist who blew himself up at the crossing near the shopping center was responsible for the death of four people and the wounding of 94 men and women.Some of the injured were rushed to the hospital in critical condition.Gloria and Doron were rushed to the Laniado hospital in two separate ambulances, but a short time later, Doron was transferred by helicopter to Hillel Yaffe Hospital due to his serious condition. Between operations, Gloria received updates on her son's critical condition, suffering severe injuries to his left leg, liver, lungs, and ears.\n\n\"Just when a mother should be by her son's side, this was prevented from me,\" she said. \"There is nothing more frustrating than lying helpless, knowing that my Doron needs me, now more than ever — and I cannot save him.\"\n\nMany years have passed since then, but for the Riani family, it seems their lives have been frozen in time. Gloria and Doron, who were severely wounded, are still knee-deep in the healing process and daily struggles of that traumatic and bitter day.\"Life has become one big living hell\", says Gloria, \"from a normal and stable family, we have become a family struck by fate, living only to survive another day. We're stuck in a loop as a result of the attack. It feels like riding a non-stop roller coaster that jerks you from side to side, threatening to take down your whole family.\"Not only has the healing process been grievous, but bureaucratic issues with Doron's national health insurance made life difficult and near impossible. While healing and suffering from severe mental damage, he was sent from one medical committee to another and had endless meetings to receive the care he needed.\"I lost a child. Although Doron was not killed in the attack, he is like the living dead. That's the only way I can describe it. We've reached a dead end, and I can't see a single ray of light in the dark\", Gloria adds.Although Gloria and her son were the only ones in the family injured in the attack, the lives of the whole family were permanently altered as well. She stopped working at the hospital and spent most of her time receiving medical treatments and caring for Doron. For the first two-three years after the attack, her husband, Yaakov, a taxi driver, had to run between the two hospitals in addition to taking care of their other four children at home.The medical treatments required for her and Doron have brought the family to a dire state of poverty; she explained: \"We've exhausted and drained our savings... we have been living on advances and loans. Medical treatments and equipment are costly... I would be lying if I said that suicidal thoughts do not arise occasionally. But then I think about the children and Doron and Yaacov, my husband; I know there is someone to fight for.\"\n\nMany people like Gloria and her son Doron barely made itout alive and whose families suffer greatly. Often, their cases get lost in the healthcare system, and this makes them feel like they are fighting to be seen and receive the help they need.It is our mission to support the broken, the injured, and the traumatized and grant them the help they so desperately cry out to receive. Every care package filled with food, every gift card, and social event is like balm to a struggling family.Healing comes in big and small ways; it's in the intentional look of compassion when you look the survivors in the eyes, it's in the gentle hug and smile, and the knowledge that they know that someone sees and cares about their pain.Every year, VFI reaches out to numerous victims of terrorism through various social events and projects. These initiatives include providing care for families and individuals, awarding educational grants to students, offering special support to families in need, facilitating participation in summer camps for orphans, organizing workshops, and providing general aid.If it wasn’t for the support from partners, donors, and friends like you — Gloria, Doron, and her whole family would still wonder whether someone recognizes their pain.It is because of you that they know — we care."
    },
    {
      "title": "StoriesA Hero, A Prayer & A Mighty GodSaturday, April 22, 2023",
      "link": "https://www.visionforisrael.com/en/blog/a-hero-a-prayer--a-mighty-god",
      "image": "https://images.prismic.io/vfi-website/590b68f4-6aa7-4987-a621-e9698bbdeb29_Shutterstock_1364215928+small.jpg?auto=compress%2Cformat&fit=max&w=3840",
      "image_alt": "Yom Hazikaron",
      "category": "Story",
      "full_content": "Memorial Day or “Yom Hazikaron” in Israel will begin on the evening of April 24th, 2023. Throughout the nation of Israel, a one-minute siren will sound and everyone stops for a minute of silence. The next day around 11 am, another siren sounds and you will see cars, buses, and people stop for an entire minute wherever they are, even on the highway or in the middle of the city.As Yom Hazikaron approaches, it is important to understand that it is a day to remember not only the fallen soldiers but also the victims of terror attacks. I want to share with you a powerful testimony about one of our VFI board members, Ilan, who recently experienced a terror attack.Ilan went to Masada with his family for the day, and as they were returning to Jerusalem they stopped at a restaurant near Jericho. As they were sitting inside, Ilan looked out the window and saw two terrorists get out of a car with two guns.Without even thinking or making a noise, Ilan ran to the front door of the restaurant to block the entrance. He instinctively used his body to block the terrorists from coming inside. The terrorists tried to enter through the door, but they could not get through. They started shooting their guns in the air. Just as they were pointing their guns at the door, their guns jammed and they couldn’t shoot. Immediately, the terrorists became frustrated and fled the scene.At exactly the same time when this was happening, almost to the minute, Barry and I were praying with a group of friends. We prayed for every attempted terror attack to be thwarted and for every further attack to be obstructed by technical problems with the enemy’s guns or firearms. We were very specific in our prayers for God to confuse the enemy, make their guns inoperable, and supernaturally block any terrorist attack…And that’s EXACTLY what happened!\n\nWhen Ilan told us what happened, we got chills and were in awe of how God answered our prayers. A horrific terror attack could have happened that day, but God intervened! God gave Ilan the courage and wisdom to block the door with his body and to protect all of the people and families inside the restaurant. Ilan is a true hero. And we praise God for answering our prayers and protecting Ilan, his family, and everyone in that restaurant.Ilan's story is truly inspiring because it reminds us that NOTHING is stronger than God's power. God sees us, hears our prayers, and is a shield around His people.At VFI, we see how vital it is to support victims of terror attacks because unfortunately, it is a common occurrence here in Israel. We have seen the difficult challenges that these victims of terror attacks endure as they try to overcome the trauma.Therefore, it is our great honor to support and stand with those who have survived terror attacks here in Israel. Some of the ways we support these victims of terror are through grants towards further education, events, and celebrations for them to attend a couple of times a year, and monthly financial gifts to those in need.This Yom Hazikaron we encourage you to pray for the families of the fallen soldiers, those that have lost loved ones in terror attacks, and those who have survived terror attacks.We also hope our testimony of how God answered our prayers encourages you to pray and intercede for the protection of God’s people here in the land of Israel.Shalom and Blessings,Batya"
    },
    {
      "title": "StoriesHolocaust Refugees - More than HeroesThursday, March 23, 2023",
      "link": "https://www.visionforisrael.com/en/blog/holocaust-refugees-more-than-heroes",
      "image": "https://images.prismic.io/vfi-website/ab755a5d-1e55-4ab1-af0a-1bb448401a33_social+eventss+for+holocaust+survivors_LSP_029.jpg?auto=compress%2Cformat&fit=max&w=3840",
      "image_alt": "Holocaust Refugees",
      "category": "Story",
      "full_content": "Many are familiar with the stories of the unimaginable journeys of Holocaust survivors and refugees making their way to immigrate to Israel after World War II.Our eyes tear up, our throats choke, and our hearts are touched as we listen to the stories of these humble heroes. They managed to escape death in the ghettos and hiding places, faced the brutal winters with a lack of food and clothing, and escaped to the land of Israel in the dead of night.About 250,000 Jews found refuge in different countries. Of these, over 136,000 immigrated to Israel, about 80,000 immigrated to the USA, and others to Canada, Central and Western Europe, Russia, Ukraine, South Africa, and more. “Habrichah\" (The Escape) organization helped many of them to move from Eastern Europe to the West, and then to the land of Israel.\n\nHolocaust refugees are Jews who survived the Holocaust, the Nazi regime, and the occupation of Nazi Germany, and at the end of the war did not immigrate to Israel and did not find a permanent place of settlement. These survivors wandered in Europe or were housed in displaced-person camps.In 1941, the Nazis were at the decisive stage of their plot to \"solve the Jewish problem\" with \"Operation Barbarossa\" — the invasion of the Soviet Union by the German army with the aim of winning the war before the upcoming winter. During this period, approximately 4.855 million Jews lived in the Soviet Union, which was about 30% of the world's population of Jewish people. Only about 800,000 Jews lived outside the occupied areas. About 1.2-1.6 million Jews were evacuated to the East. It is estimated that most of the Jews who remained in the occupied areas, approximately 3 million, were killed in the extermination camps.By the end of 1942, about 1.5 million Jews were murdered in the territories of the Soviet Union occupied by the Nazis. After the war, many of the Jews from the Soviet Union did not return to their homes. Many houses were destroyed, burned, looted, and inhabited by non-Jewish citizens after the Jews were sent to concentration camps. At the end of the war, the surviving Jews were destitute. Due to the anti-Semitism that still existed, hundreds of thousands of Jewish refugees wandered in Europe instead of returning to their country of origin.Those who returned to their country settled mainly in Moscow and Leningrad, following the industrial, scientific, and educational development. The Jews of the Soviet Union grew firm roots, integrated into society, and learned Russian. In 1948, with the establishment of the Jewish state and the rise of anti-Semitism, the desire to reach the land of Israel was sparked in the hearts of the refugees.Jewish immigration from the Soviet Union after World War II was one of the largest in history. It is estimated that 2.75 million Jews from the Soviet Union immigrated to Israel, the USA, Germany, and other countries.\n\nThe Holocaust was indeed over, but the challenges did not stop. Many of the Jews who survived the Holocaust lost their family members or their connection with them. Documents and identification papers were also lost, however, this didn’t stop them from looking for their loved ones. Parents anxiously looked for their children, but tragically most did not find them. Those who did locate their children had to ransom them back, and some even had to take them back by force. Some of those children who were given into hiding became orphans, wandered the streets, or were thrown out by the family that hid them.After the war, the number of orphans throughout Europe escalated. Therefore the Zionist youth movements, especially theDrormovement andHashomer HaTsa’ir, established more than 17 training kibbutzim for youth aged 16-21 in Poland. Because of the many difficulties, many parents sent their children to kibbutzim for children, so that they themselves could reach Israel, as well.A large part of the children did not even know they were Jewish because they stayed with Christian families and in monasteries. As a result, a Jewish-Zionist organization called \"The Zionist Coordination for the Redemption of Jewish Children\" was established. They redeemed these children with money, founded children's villages for them, and gave them a pioneering education that included Hebrew lessons and community life.\n\nSome of the refugees and their descendants made their way to Israel. For Holocaust survivors and refugees, the history of the Jewish people is not just an old story, but life memories and experiences engraved in their veins. Now that they live in Israel, we take every opportunity to make them happy and express our appreciation for them.Over the years, Vision for Israel was given the privilege of serving these heroes, the Holocaust survivors and refugees, who went through hardships and difficult challenges after the war until finally arriving in Israel.Recently, we hosted about 50 Holocaust refugees who belong to an organization for refugees and victims of the Holocaust from the USSR and Eastern Europe in Israel. The members came in a shuttle, sponsored by Vision for Israel, from the city of Holon to our Millennium Center in the city of Modi'in. They enjoyed a musical morning with singing. Music seems to lift their spirit and awaken joy in their heart. The guests danced together with Barry and Batya Segal, and we all experienced great joy as we danced and sang together.The guests enjoyed rich refreshments: a variety of quality sandwiches, desserts, pastries, and a selection of cold and hot drinks. At the end of the event, each one received a gift — a warm duvet for winter. We were so moved to see their smiles, which appeared like sparks of hope on their faces. Everyone left happy, excited, smiling, and feeling loved.We are grateful for each opportunity to hear their stories and learn more about their lives. Especially now, as the Holocaust generation is disappearing, we are honored to enshrine their shared memories in our hearts. For the survivors who went through the worst horrors, these simple acts of kindness warm their hearts, ignite hope, and renew trust in others. All that is required are small acts of love and care, which we do on a regular basis: a visit to their home to alleviate their loneliness, a listening ear, a warm duvet for the winter, a basket of food, and more. Even the smallest act is of great importance to them.\n\nThe Jewish people have always helped each other in difficult times. At the end of the war, Zionist organizations contributed by helping smuggle Jews to the Land of Israel, redeeming lost children and giving them an education, and helping increase the slim chance that they will get back on their feet. And this is what VFI is committed to doing today!The State of Israel was founded on the backs of Holocaust survivors and refugees, who with the remains of their strength, courageously built homes and institutions. They built buildings and houses, raised families, laid the foundations and values of our country, and fought for Israel’s protection and growth. They did it all for the coming generations. They did it for us so that we can live here in peace and abundance.Today, there are approximately 161,400 Holocaust survivors living in Israel. Not everyone has family or friends, and they face the difficulties of modern life, which they did not even imagine when they founded the country. Many of them do not have enough money to cover their monthly expenses. The stipend given to them by the state is not enough to survive. Their refrigerator is regularly almost empty and they don't turn on electrical appliances in order to save on expenses. During the cold winters, they layer on warm clothes instead of using a heater, if they even have one. On top of all of this, many of them experience crippling loneliness and a feeling of neglect and abandonment.We should not neglect our elderly brothers and sisters in their plight in old age. So, how can we support these survivors and refugees for all they have done?At Vision for Israel, we recognize the past of Holocaust survivors and refugees. We want to give them the loving care and treatment they deserve. We hold events for the refugees and survivors of the Holocaust with the aim of giving them back their sense of belonging and the joy of life. We do this by not only telling them with words but also with actions, that they are important to us and we haven’t forgotten about them. Every joy-filled event, warm blanket, food basket, gift card, and a home visit, positively affect the lives of Holocaust survivors and refugees.We thank all the donors, supporters, and volunteers who contribute their money, time, and energy toward Holocaust survivors and refugees. Without you, we would not have seen the happy smiles on their faces. Thanks to you, they feel respected and appreciated, especially after all the horrors they have gone through in their lives.Thank you for showing love and care to these precious Holocaust Survivors and refugees! And thank you for continuing to support them in their last years of life."
    },
    {
      "title": "StoriesBringing Hope to the HopelessFriday, March 10, 2023",
      "link": "https://www.visionforisrael.com/en/blog/bringing-hope-to-the-hopeless",
      "image": "https://images.prismic.io/vfi-website/40b78129-5d96-4a8c-bf6d-a56739998857_bigstock-Single-Mother-With-Two-Childre-318615043+%281%29.jpg?auto=compress%2Cformat&fit=max&w=1920",
      "image_alt": "Mother and Children",
      "category": "Story",
      "full_content": "As a young girl, Alina* faced many difficulties within her own home. Her father was a violent man and was in prison on criminal grounds. Because of this, she had to take on the responsibility of raising and caring for her younger siblings, as well as maintaining the household chores. When her father was released from prison, he was violent toward Alina and her mother.Obviously, Alina wanted to escape from this unsafe household, so she got married at a young age. However, her marriage was full of tension due to her husband’s gambling problem. In protection of her two young sons Binyamin* and Gabriel*, Alina divorced her husband. Alina's ex-husband left many debts due to gambling and involvement in the gray market. As a result, Alina's bank account is limited and she is in the process of a writ of execution. The relationship between Alina’s sons and their father is violent as well.Alina married another man and had two more children, but unfortunately, that marriage was also dysfunctional. Today, Alina is trying to raise all the children on her own, without significant support from the fathers of her children or her own family. This family has been treated at the welfare department since 2006 due to financial, marital, and parental difficulties.Hearing of this family’s hopeless situation, VFI jumped in to help bring God’s hope through some financial aid (gift card), a food basket, and a warm blanket for the winter. Unfortunately, there are many people here in Israel that are suffering in hopeless situations. They are in desperate need of a helping hand, someone to pull them out of the pit, and to come alongside them to let them know they are not alone.Our God does not forget the needy. And we rejoice in the fact that our God is a God of hope! Therefore, as children of God, it is our great honor and duty to bring God’s hope to the hopeless. We invite you to join us in bringing God’s hope to Alina and many others suffering from hopelessness here in Israel.Bring hope to the hopeless today through a practical financial gifthere on our website.*Names have been changed to protect the family."
    },
    {
      "title": "StoriesPurim and the Power to RejoiceMonday, March 6, 2023",
      "link": "https://www.visionforisrael.com/en/blog/purim-and-the-power-to-rejoice",
      "image": "https://images.prismic.io/vfi-website/7f6f8595-1b1f-4e17-98bb-77003f89e6fd_Purim_shutterstock_1012366282_small.jpg?auto=compress%2Cformat&fit=max&w=3840",
      "image_alt": "Purim",
      "category": "Story",
      "full_content": "As we enter into the month of Adar, we are reminded to increase our joy no matter what situation we find ourselves in. For the Jewish people, this month is centered around the book of Esther and the great celebration of Purim. The word ‘Purim’ means ‘lots’ and it is the celebration of how God turned the coming destruction into a time of joy and celebration!\n\n“On the thirteenth day of the twelfth month, the month of Adar, the edict commanded by the king was carried out. On this day the enemies of the Jews had hoped to overpower them, but now the tables were turned and the Jews got the upper hand over those who hated them.” - Esther 9:1\n\nIn the book of Esther, evil and wickedness are expressed through Haman and his orders to kill the Jewish people. With a terrifying sentence of extermination, the Jews found themselves in a place of fear and without joy. However, when Esther approached the king on behalf of her people, she moved the heart of the king to write a new decree. This new ruling permitted the Jews to defend themselves against the attack of their enemies. Just in receiving this new decree, the Jews were filled with joy!\n\n“For the Jews it was a time of happiness and joy, gladness and honor. In every province and in every city to which the edict of the king came, there was joy and gladness among the Jews, with feasting and celebrating…” - Esther 8:16-17\n\nHowever, what is extraordinary about their joy at that moment is that they were choosing to rejoice in the Lord even before they received the victory of the battle that still awaited them. Their enemy still hated them and was determined to destroy them. And the Jews still had to face their enemies, fight against them, and destroy them. Yet, they chose to rejoice in the Lord because they fully believed that God was with them.So, as we approach this new month of Adar, how do we also choose to rejoice in the Lord, even in the midst of great suffering or persecution? First of all, we have to know that God is with us. Secondly, we need to receive the fruit of the Holy Spirit in the deep places of our hearts and minds. Only through the power of the Holy Spirit are we able to express genuine joy in the midst of very challenging situations.And thirdly, we need to give thanks to the Lord for everything! There is a great connection between gratitude and joy. When we give thanks to God, genuine joy begins to fill our hearts and strengthens us in faith, security, and fearlessness.There are many verses in the Bible that instruct us to ‘rejoice’, ‘be glad’, and ‘joy’. There are also many Hebrew words that refer to joy in the scriptures:‘simcha’, ‘ditza’, ‘sasson’, ‘tzahala’, ‘rina’, ‘gilah’, ’hodaya’,and more. The word of God highlights just how important it is to rejoice in the Lord throughout our journey of faith here on this earth.Joy is living in faith without worry and without fear. Joy is fixing our eyes on Yeshua in the midst of our pain. Joy is a grateful heart.From all of our staff at VFI, we pray that you have a joy-filled holiday as you celebrate Purim!Chag Purim Same’ach! Happy Purim!"
    },
    {
      "title": "StoriesA Lesson in Humility: Understanding the Need for HelpFriday, February 10, 2023",
      "link": "https://www.visionforisrael.com/en/blog/a-lesson-in-humility-understanding-the-need-for-help",
      "image": "https://images.prismic.io/vfi-website/2bed132c-d58b-4794-98e1-74a0e38a33db_BATYA-6914+small.jpg?auto=compress%2Cformat&rect=0%2C0%2C2000%2C1125&w=3840&fit=max",
      "image_alt": "Batya Segal",
      "category": "Story",
      "full_content": "Recently I was reminded of the words of my dear mother, may her memory be blessed, who said two days before her passing, \"I am not ready to be a burden on anyone, all my life I have taken care of my family, my husband, and children, and if a situation arises where I become a burden and someone has to take care of me, I choose not to be in this place and in this situation.\"Think about a time in your life when you needed help. Maybe it was a physical ailment or a difficult situation at home or work. Whatever it was, I'm sure you remember how it felt to be in that place of need.For me, it was a recent experience with severe pain in my knee and shoulder. I found myself unable to do the things I had always taken for granted — packing and moving, driving, and even lifting a plastic bag. In an instant, I became fully dependent on another person, and it was not a pleasant feeling.But as I thought about my situation, my heart went out to all those who receive assistance and support from anyone who can help them. I thought of each of them as if they were me, and I imagined the difficulty and shame they must feel in asking for help.\n\n(Batya’s mother, Sarah, with the first great grandchild)It's important to remember that the wheel of life turns, and even if we have everything we need to live a good and happy life, even if today we are supporting others, the situation can change and we could become weak in certain ways and need help ourselves. This is humility, that in every situation we have to be in a place of patience, and compassion, and must be attentive to someone else's needs.In our generation, there is a constant preoccupation with ourselves. All social networks are full of the personal stories of so many people. Taking care of ourselves is not the only goal of our lives. Our goal is to serve and train those who need help. The constant search to find those whose cry is not heard. Those whom we don't know their difficulties because they are ashamed to ask for help. This is the most difficult task, to find the quiet and humble.We then who are strong ought to bear with the scruples of the weak, and not to please ourselves. – Romans 15:1\n\nIt is written that Job, who was supposed to be immersed in his great trouble, went to seek and find the most difficult cases, those who needed help. Not all of us can search and find, but every one of us can choose to support the weak and impoverished. When you become a partner with Vision for Israel and support us on a monthly basis, you enable us to be the eyes and the outstretched hand to give assistance to the weak among us, out of humility and modesty."
    },
    {
      "title": "StoriesFrom a Victim to Victory - A Holocaust Survivor StoryFriday, January 13, 2023",
      "link": "https://www.visionforisrael.com/en/blog/from-a-victim-to-victory-a-holocaust-survivor-story",
      "image": "https://images.prismic.io/vfi-website/be3ac0f9-cfc0-428d-81e7-60abad3c334e_bigstock-Closeup-Of-Shiny-Strained-Meta-406933619.jpg?auto=compress%2Cformat&fit=max&w=3840",
      "image_alt": "Barbed Wire",
      "category": "Story",
      "full_content": "We are privileged when we have the rare opportunity to sit with Holocaust survivors, listen to their heroic stories, and learn from their bravery.We recently met Frieda*, born in 1935 in Lithuania, whose wisdom and hope were integral to her inspiring testimony.Frieda grew up in Lithuania in a well-off family - her father was a prosperous businessman in textile and had contacts worldwide.The political and social climate was tense and came to a boiling point. Even before the Germans invaded Lithuania in 1941, the Lithuanians began murdering Jews, 'cleaning out' the Jews from 150 villages, calling them 'Judenfrei' villages, meaning free of Jews.They would murder the Jews in incredibly cruel and public manners, decapitating a Rabbi and displaying his head in a window, herding Jews into a synagogue and setting it on fire, or waterboarding them to death on the streets as onlookers smiled cruelly.When Frieda was about five years old, the Jews in  were forced to pin the yellow star badge with the word 'Jew' to identify as Jewish citizens and a symbol of mockery.It was against the law for Jews to leave their house without them. One day as Frieda’s grandmother stood in line to get bread, she forgot to wear her yellow star. Her neighbor denounced her, and her grandmother was taken and never seen again.As the Germans invaded, Jews were taken to ghettos and forced labor camps. As Frieda told her impossible yet unfortunately true story, we held our breath and took in every word as she described the early days of the war as 'horrific':\"We only took a few possessions; I remember my mother trying to take a huge ficus plant; she didn't know what was happening. My grandfather, who was well off and prosperous, was taken first so that his apartment could be plundered; I was told later that he was humiliated and tortured before being killed\".Once Frieda and her family arrived at the ghetto, they realized no one would ever make it out alive. The German guards would round up the people to see who was useful and who wasn't - the elderly and children were dispensable. Somehow, miraculously, Rosian Frieda and her parents were spared.Time was not on their side, as they knew they would not survive unless they were to find a way to escape, as Frieda recalls:\"My parents timed the guards with their dogs and their searchlights and attempted to dig a hole under the barbwire to see if they could help me escape; each time they did - they risked their lives. It was a tedious procedure because it was only a matter of minutes between the changing of the guards.They dug a hole big enough for me as a 5-1/2 to 6-year-old to pass through. They pushed me through, and on the other side was my father's secretary, that was waiting for me in the shadows. She took me across the river bridge to her apartment.I was crying so much because I didn't understand what was happening, and she couldn't keep me because I was endangering her life\".Fortunately, the selfless and life-risking act of her father's secretary saved her life as she found a new place for her to live in a place where a group of journalists would meet. Natasha, a journalist and Frieda's mother's best friend transferred her to her sister, who had a farm in the countryside.At the farm, Frieda was always on the run and constantly at risk of being discovered when people's suspicion arose, attempting always to blend in and make herself invisible.Like many brave gentiles today, called 'righteous among the nations', the woman covered up Frieda's identity by lying, saying that it was her sister's illegitimate child whom she had taken under her roof.Amongst the unimaginable pain of being separated from her family, these women were like mothers to Frieda, so much so that she even called them 'mother'.Miraculously, Frieda’s mother was with her at the end of the war when Soviet troops liberated them in 1944.Although the war was over and her mother and father survived, the trauma of those horror-stricken years haunted her:\"The fear was always there; there were Germans coming by and searching, and I couldn't understand why they were trying to kill me since I always tried to be a good girl. I was a target for murder; this trauma stays with me to this day, the fear and trust issues.\"For many survivors, the pain is too difficult to speak of ever again; for Frieda, her story is an opportunity to speak out against racism and challenge Holocaust deniers:\"People seem to have their own agenda for denial and distortion because it is too difficult for them to comprehend there were miles and miles of corpses. It's like thinking about eternity or infinity - it's too great for some people. For some people, antisemitism, being anti-Israel, is the way to express themselves and fits their personal agenda and their political views\".If it (the Holocaust) hadn't happened and it wouldn't have sat on the world's conscience for several years after it happened, and if the records weren't there that the Germans kept themselves, it would have been much easier for them to bury them (evidence of the Holocaust).It's like Niccolò Machiavelli said:\"You repeat a lie often enough that it can become a reality,\" and that's the danger because when you live alone and don't see the truth, you yourself become contaminated. And we have to fight (Holocaust denial) that with all our might.If the new generations can see that there is a way out, that we can create a better world, and put our heart, soul, and spirit in that path, then they see will see the light and share it with their families and friends. This can go on for generations and generations, just as we Jews have.I am here to tell this story. This is the continuity of Jews, and it will never stop, andHitler lost'. She added with a victorious smile.Frieda and her family are living proof of the hope that continues to live on throughout the generations. Her mother lived to the age of 101, her father to 96, and she herself has two sons and eight grandchildren.God has strengthened His people to survive history's darkest times and put the spirit of truth and justice in their hearts to stand against antisemitism.When you support Vision for Israel, you are not just giving a basket of food or a warm heaters and blanket to the elderly in the cold winters, but you are helping people such as Frieda preserve her legacy as one of the remaining Holocaust survivors.You are taking a stand against antisemitism by acknowledging the real stories and heroic stories of Jews and the gentiles who risked their lives to save them.In today's world, where antisemitism is rearing its ugly head again and Jews are moving back to Israel to escape racist violence - we are grateful to have the support of our partners in the nations as Israel continues to rebuild itself as a nation rising from the ashes.Thank you for supporting us - so that we can support heroes like Frieda.*Name has been changed."
    },
    {
      "title": "StoriesA Life-Changing Visit – Providing for a Mother and Her ChildrenFriday, November 11, 2022",
      "link": "https://www.visionforisrael.com/en/blog/a-life-changing-visit-providing-for-a-mother-and-her-children",
      "image": "https://images.prismic.io/vfi-website/be8ea758-2d32-4913-be2d-963c95fc73fa_bigstock-Single-Mother-With-Two-Childre-318615043+%281%29.jpg?auto=compress%2Cformat&fit=max&w=1920",
      "image_alt": "Mother and Children",
      "category": "Story",
      "full_content": "Can you imagine the feeling of being adopted as a baby? Well, this is how*Henni’s story began. Only after being in this world for a few weeks, an ultra-Orthodox family adopted Henni.  However, when Henni turned 16, she ran away from home and her family.  She suffered from abuse and didn’t want to stay there anymore. As a result she found herself wandering the streets without any sense of identity and belonging. Finally, she found a safe and warm home in the center of Israel that was specifically for girls at risk. After staying there for two years, it was time to serve in the IDF. During her service, she met her future husband and soon after they got married.After the birth of their second child, the father disappeared and never came back. This left Henni feeling rejected once again and all alone. She had no time to feel sorry for herself. She had to take care of her toddler and baby with no job, no family she could turn to for help, no income, and no support. She was grateful to have her two children, but she didn’t know how she would provide for her kids or herself.\n\n“To rob the needy of justice, and to take what is right from the poor of My people, that widows may be their prey, and that they may rob the fatherless.“ — Isaiah 10:2\n\nTrying to survive against all odds, Henni started working with elderly people. She cleaned for them and cared for their needs. It was hard and the income didn't cover the basic monthly expenses like rent, utilities and all the rest.A request from the social authorities came to assist her.  Vision for Israel team visited Henni at her home. The apartment where they were living was lacking the most basic furniture, no chairs, no table, broken beds. The old rusty refrigerator was empty and had no food. The children were hungry and suffering from malnutrition. Henni also suffered from health issues due to lack of nourishing food, which was only a small symbol of her difficult physical and mental state.This visit to Henni’s house was a turning point for the family and for our staff. Right away we realised Henni is someone very special. From that point on, the family received ongoing support of food packs and financial vouchers, furniture, a new refrigerator, school bags for the kids, clothes, and heaters. All of these provisions helped her realize that her prayers had been answered. As our team just loved on Henni, we saw how she never expected anything and always wanted to give something in return.  She literally had nothing, and yet the little she had she wanted to give to us so we could bless others in need.  On one occasion, she handed us a bag of brand new clothes she was given by another charity organization. She said, “I don't need these nice clothes. Please give it to a needy family”.Henni’s life was transformed. We saw through the years how she became a happier person, started taking care of herself, and was looking healthier. Her children were also improving socially and doing so much better in school.With a grateful heart, Henni sends us messages of blessings and thanks. She never misses an opportunity to phone our office simply to bless our work and our team. Every holiday and every few months, she calls us to simply say, “Hope you all are well. Just calling to let you know you are in my thoughts and prayers”.We love to just be there for others and to see the real change in those we embraced throughout the years. There are thousands of young people who are searching for an ear to hear, an eye to see, and a heart to care.The sincere words of thanks and blessings reflect to us how essential the help is to the recipients. God opened the doors for you and us to be a blessing, and we consider this as an amazing opportunity and a privilege.We invite you to partner with us as God uses us to make a huge impact on the precious lives here in Israel.\n\n“I am sure of this very thing—that He who began a good work in you will carry it on to completion until the Day of Messiah Yeshua.” — Philippians 1:6\n\n*Name has been changed."
    },
    {
      "title": "StoriesShlomo & Rachel - From Rockets to RestorationSaturday, September 10, 2022",
      "link": "https://www.visionforisrael.com/en/blog/shlomo-rachel-from-rockets-to-restoration",
      "image": "https://images.prismic.io/vfi-website/9b15e83b-fca3-447f-9eeb-7c4f951a79db_Rocket+Attack+shutterstock_211423306+small.jpg?auto=compress%2Cformat&fit=max&w=3840",
      "image_alt": "Rocket",
      "category": "Story",
      "full_content": "Unfortunately for many living in Israel today, terror can strike at any moment, leaving unimaginable trauma and disability in its wake.Shlomo* became a victim of hostility when a Qassam rocket fell near his home in 2005. Since this tragic incident, he has received treatment at a mental health clinic every week, attempting to lead an everyday life with the aid of antidepressants and other anxiety-treating medications.Rachel*, his wife, is experiencing challenges of her own since becoming physically disabled due to falling into a pit caused by a Qassam rocket in the city market. She has become limited in movement and is forced to spend her days in frequent clinic visits to receive medical treatment.Shlomo and Rachel have been diagnosed as severely disabled, making their ability to sustain themselves financially impossible.Vision for Israel has had the immense privilege of supporting Shlomo and Rachel for seven years with special requests and assistance in groceries in preparation for the holidays.So when we heard that Rachel needed help to pay for special glasses to restore her eyesight, we were grateful for the opportunity to lend a helping hand.\n\n\"My name is Shlomo,an ultra-Orthodox Jew who lives in the south of Israel by the Gaza strip.By the grace of God, I was born to wonderful parents who gave me an education, love, and endless joy in life.However, when I was 12 years old, my world turned upside down when my dear little brother Reuben* was killed in front of my eyes in a horrific accident.My dear father and mother passed away a few years later from broken hearts at a very young age.To my bitter fate, I am a father whose lovely daughter died at a young age, and my eldest nephew (19 years old) lost his life while serving as a border police fighter during a conflict in the city of Hebron.And now my beloved wife Rachel is severely disabled. We \"live\" on pensions from the National Insurance Institute, which leaves us with nothing; we've had to take out various loans for unexpected medical treatments and are burdened by a case of a writ of execution.With the help of God, I now turn to you for urgent help since my wife underwent complex eye surgery in the last two months and is now in need of special glasses.I ask that you would help us with a financial donation so that we can exist in a way that the remainder of our human dignity will not be taken away from us.“\n\nFor couples such as Shlomo and Rachel, life has not been kind.We may not be able to prevent every tragedy, but we can be the vessels that restore dignity to those stripped of the means to sustain themselves and restore their sense of purpose - one act of kindness at a time.Thankfully, because of your tremendous support and generosity, we were able to provide Rachel with special glasses to improve her eyesight, regain her health and improve the quality of her life.We were overjoyed when we received a heartwarming letter from Shlomo, thanking us for our help:\"I have a special reason to tell you again - thank you! Thank God you stand by my side during this difficult and exhausting time.You are undoubtedly the engine that drives my heart to love life despite my many difficulties. You are beautiful proof that there are still people who help those disabled from terror attacks.I am thankful from the bottom of my heart that you have always dealt with me with sensitivity, professionalism, and friendship - it is a great privilege for me to be treated by your organization. Your investment in my wife and me is priceless.“*All names have been changed to protect the identity of these individuals."
    },
    {
      "title": "StoriesScholarship Ceremony for Victims of Hostilities StudentsMonday, July 25, 2022",
      "link": "https://www.visionforisrael.com/en/blog/scholarship-ceremony-for-victims-of-hostilities-students",
      "image": "https://images.prismic.io/vfi-website/0d6a0718-4fb0-4eb7-be8b-8954590e496f_DSC_5756.JPG?auto=compress%2Cformat&fit=max&w=3840",
      "image_alt": "Scholarship Ceremony",
      "category": "Story",
      "full_content": "For several years, Vision for Israel has had the immense privilege of supporting and collaborating with the organization of victims of hostilities in a special scholarship project for students who are victims of hostilities.Each year we gather to partner together to the point that this well-intended project, which started as a small endeavor, has become a tradition we refuse to miss.Victims of hostilities suffer significant long-term trauma and can often feel isolated from the memories and loss they have suffered as a result.As children and teenagers, they carry the heavy burden of trying to build a future for themselves through education, all while trying to solve complicated mental and emotional difficulties, either endured by their parents or themselves.We believe that providing education for students who are victims of hostilities, will help ease their way back into a normative life cycle, realize their academic abilities, and complete their education according to their skills.Education is of great importance in creating employment opportunities and contributes to improving their self-esteem and confidence. When they see that a whole system of adults believes in their well-being, taking care of their future, and cheering them on -- it shrinks the goliath-size difficulty they stand against.Projects like this are critical and are contributing factors in rehabilitating terror survivors who attend higher education institutions.This year, we were honored to host the scholarship distribution ceremony at the Millennium Center in a festive setting.The students were accompanied by relatives and friends and were greeted with a colorful reception filled with light and rich refreshments, including quality sandwiches, savory pastries, cookies, and cold and hot drinks. In the background, bringing much joy to the event was musician and singalong emcee Shalom Har-Even, which elevated the celebration with his upbeat music.Each student then received a check and a certificate of appreciation in person, accompanied by a melody, and had the opportunity to share about themselves, and their course of study.This year we were able to award 76 scholarships to students who were most in need of the blessed assistance.It was an exciting and very empowering evening. Seeing the smiles on the faces of the children, knowing that we had a small hand in guaranteeing their success as successful members of society, was the highlight of the evening.We are grateful for the fruitful cooperation with the representative organization through which we have been able to touch more and more families in need of assistance and improve their quality of life.We look forward to continue supporting survivors of hostilities and their children as they walk bravely into their destinies by dedicating our resources to better their life and education."
    },
    {
      "title": "StoriesFood Insecurity Increases Among Young Children, ElderlySaturday, July 23, 2022",
      "link": "https://www.visionforisrael.com/en/blog/food-insecurity-increases-among-young-children-elderly",
      "image": "https://images.prismic.io/vfi-website/49b71ca3-2a54-4e94-8bd7-a46c082b2cdb_Orthodox+children+poverty_shutterstock_1157648356_small.jpg?auto=compress%2Cformat&fit=max&w=3840",
      "image_alt": "Orthodox Children",
      "category": "Story",
      "full_content": "Dear friends,During our 28 years as an organization, Vision for Israel has always worked directly with families and children in poverty who are in need of support. Providing food for the hungry is one of our main objectives. In the last few years, we have seen an increase in the poverty rate and the number of children suffering from hunger.When our team visited Riki for the first time we learned she was a single mother with 3 kids. She was a heavy-set woman who lost most of her hair. Her nails were broken and she was explaining that she and her kids are eating bread, pasta, and rice and that she couldn't afford to buy any nutritious food. She was explaining that she suffers from pain in parts of her body. When she opened the fridge, we saw a few slices of bread and margarine. That's when we realized that there are hundreds of thousands of people like Riki.Nutritional insecurity is one of the hallmarks of poverty. Many people who experience poverty cannot get the proper nutrients that they need because they do not have access to healthy food sources. Hunger causes damage to both physical and mental health and can ostracize families from their communities.Children are particularly vulnerable to the lack of nutritional food because they are still developing, and they need proper nutrients to grow. The lack of it can cause them to fall behind in their education or become excluded from their peers. The percentage of children suffering from food insecurity is particularly high among families who are falling under the poverty line. For those who receive a monthly allowance from the Israeli National Security, there is a high percentage ofArab,ultra-Orthodox families, and families receiving disability stipends.The COVID-19 pandemic exacerbated the situation and caused a rise in food insecurity for these communities. As a result, there has been an increase in applications for welfare aid. Charitable organizations are dealing with increased demand, and Vision for Israel is no exception.Those families who have been supported by Vision for Israel feelthey are part of the family. We visit hundreds of families every month to keep the provision going. Each family receivesabasket with high-quality nutritional food.As there has been an increase in poverty, we have had to increase our output. Your support of $100 to Vision for Israel, will provide an entire family with a gift card to buy food. By giving $50, we can provide a family with a food basket filled with nutritious food products.We hope to continue to grow so that we may help as many people as possible. We trust you, our friends and supporters, to help us make a difference for the poor and hungry in Israel.It is always a joy to know we are making a difference and we all have the opportunity to partake in it. Please donatehere.May the Lord bless you and keep you.Your friends,Barry, Batya, and the VFI Team"
    },
    {
      "title": "StoriesAs Evil Missiles Target the Innocent, Israel Will Rise to Protect ItselfSaturday, July 16, 2022",
      "link": "https://www.visionforisrael.com/en/blog/as-evil-missiles-target-the-innocent-israel-will-rise-to-protect-itself",
      "image": "https://images.prismic.io/vfi-website/485fb260-6224-4e7e-b3be-dab8de541e29_WhatsApp+Image+2021-12-29+at+05.31.16+%282%29.jpeg?auto=compress%2Cformat&fit=max&w=3840",
      "image_alt": "Bomb Shelter",
      "category": "Story",
      "full_content": "It was a typical day as Ronit left the supermarket to unload her groceries in her car when a siren wailed loudly throughout the city: Tzeva Adom (Code Red).Panic floods her senses as only 15 seconds stand between her reaching shelter and the rocket hitting the ground. She quickly scans the area with only one thing on her mind: \"Shelter. I need to find shelter\".The moment her feet enter the mobile shelter, she sighs in relief as she is greeted by other pedestrians, all grateful to find one near enough -- and in time.Although Ronit safely returned home that day, there is no way of knowing when more missiles will be launched and if next time she will be so fortunate.Hamas terrorists continue to receive funding to destroy the citizens of Israel in the south and in the north, on the Syrian-Lebanese border, thousands of missiles are continuously aimed at Israel as well.For that reason, in collaboration with security system officials, Vision for Israel has placed dozens of shelters to save lives across the southern border.Recently, Barry toured conflict areas and strategically scouted moreareas to place mobile bomb shelters, especially in high-traffic areas to fill in the gaps where no bomb shelters can be found.With your help, Vision for Israel aims to place dozens more mobile shelters in the southern region of Israel and specifically 14 more areas in the city of Sderot, where there is a dire need. Our goal is to supply additional sheltersto the north as well.One day Israel will reach a place of peace, but till then, we will answer evil with good and place as many shelters as we can till we reach better times.What can you do to help? Head to our website tomake a donationof any amount.Help us provide shelter where shelters are needed the most and be a part of protecting lives in Israel today."
    },
    {
      "title": "StoriesThe Painful Wound that Led to HeroismSaturday, May 14, 2022",
      "link": "https://www.visionforisrael.com/en/blog/the-painful-wound-that-led-to-heroism",
      "image": "https://images.prismic.io/vfi-website/99a03ece-2a4f-4deb-b4c2-9206e628f5a8_PHOTO-2022-04-04-13-41-39+copy.jpg?auto=compress%2Cformat&fit=max&w=3840",
      "image_alt": "IDF Soldiers",
      "category": "Story",
      "full_content": "When life crumbles before us, we have two options: to give in to heartache or to find strength within ourselves to persevere.Many of the soldiers who fight for our freedom come from families affected by acts of terrorism. Consider how much strength it takes to overcome your pain and protect others from terrorists like the ones who harmed your family. Though these people’s lives are full of pain, difficulty, and sorrow because of terrorists, they persevere to save others from the same fate. The strength of these individuals is immeasurable.As an organization, we support both victims of terrorism and IDF soldiers. It inspires us to hear about victims who find the strength to enlist in the army and fight to thwart terrorist acts. These children of God suffer from post-traumatic stress and face endless rehabilitation challenges, but continue to serve and protect our country.Hadar* is one such outstanding and brave soldier who recently received financial aid from VFI for Passover. In 2016, when she was only 13, Hadar was seriously injured in an act of terrorism. Her family was driving in Har Khevron when a vehicle passed them on the road and opened fire at them. Her father was killed on the spot, and her mother and brother were seriously injured. Hadar managed to pull her parents out of the vehicle and seek help.As the daughter of a bereaved family, she needed a signed permit from her mother to join the IDF. Though her mother suffered a serious head injury and extensive rehabilitation, she signed without any hesitation because \"the army is a part of our lives.\" The strong value of defending the homeland has seeped deep into Hadar, who serves with courage, heroism, and excellence.As part of her military service, Hadar chose the position of thwarting terrorist acts in Judea and Samaria. \"For me, my job is to watch over my home. I'm sure Dad smiles from ear to ear and is very proud of me,\" Hadar said.This is an inspiring example of a young girl who managed to find strength in times of darkness and grow from the crisis she experienced. We are proud of her, salute her, and are very happy to support her and her family. It is people like Hadar who inspire us to continue doing what we do. Our work can impact those who have suffered the most, and because of that, we will never stop striving to fulfill our mission.*Name has been changed."
    },
    {
      "title": "StoriesImpact Report—April 2022Saturday, April 9, 2022",
      "link": "https://www.visionforisrael.com/en/blog/impact-reportapril-2022",
      "image": "https://images.prismic.io/vfi-website/d5075a54-c039-411a-81bb-dac2f20e221f_Purim2022_035.jpg?auto=compress%2Cformat&fit=max&w=3840",
      "image_alt": "Purim",
      "category": "Story",
      "full_content": "Your donations and support go a long way, and our team has already helped hundreds of people in the first quarter of this year. This is what we’ve been up to.\n\nRecently, our team at Vision for Israel held Bar and Bat Mitzvah celebration for young adults who have experienced terrorism. Many of these individuals wouldn't be able to celebrate this major milestone without the support of our generous donors.\n\nThis is a letter from President Yitzhak Herzog after the Bar Mitzvah event that took place at his residence for 60 children, victims of hostilities:Dear Barry and Batya,I was excited to receive your letter and I want to thank you for yourcondolences and care following my mother’s passing away.I was happy to see you and get to know VFI’s activity at the recent\n\nBar and Bat Mitzvah event—and even more so, the story that you broughtto my attention in the letter touched my heart. Your ability to look with openeyes at the reality; to recruit partners, resources, time, and means to help theunderprivileged in general and terror survivors, in particular, is inspiring andenables all of us to have an optimistic outlook on the future of the state ofIsrael. I wish you both a long life with health and goodness,and may you continue the meaningful work for the entire Israeli society.\n\nYour success is the success of us all.Warm wishes,\n\nYitzhak HerzogPresident\n\nWe started the year already in full swing, beginning with the distribution of food baskets to low-income families. May we always have an abundance of supplies to give freely.\n\nVision for Israel takes care of Holocaust survivors’ needs every day. We hold weekly social events to help them emotionally cope with the challenges they are going through, and sponsor 500 survivors every month, to receive life-saving panic buttons should they suffer from a fall or other medical emergencies. Together, we are extending God’s care to these dear individuals.\n\nThanks to our loyal friends and donors, Vision for Israel recently placed mobile shelters throughout the Gaza Envelope settlements, including Okafim, Netivot, Kibbutz Nir Am, Giv’olim, Dorot, and Gevim. A total of 48 shelters have been placed thanks to the donors of Vision for Israel, and we are planning on donating more shelters as soon as possible. All shelters are located near public spaces, parks, schools, neighborhoods, and shopping centers so that the maximum number of people have access in case of an emergency.\n\nAt Vision for Israel, we are working on rehabilitation through music and the arts. The workshops we provide approach social justice from a new angle, giving several groups of people an opportunity to grow and heal.The cost for each participant is about $200 and our goal is to sponsor 100 people. This has the capacity to change endless lives, heal generational trauma, and further the mission of social justice well into the future.\n\nWe are preparing to help the families arriving in Israel as much as we can with daily, basic needs and support. These refugees need shelter, food, hygiene products, clothing, shoes, and other basic necessities that the Israeli government is not providing. We are here to fill that gap and make sure that these newcomers feel love and support from the Lord.\n\nVision for Israel sent assistance to our friends who are on the borders of Ukraine. Rescuers Without Borders, an Israeli organization and partner of ours, has sent medical professionals there. We continue to send them funding as we have for many years. With your help, they are able to purchase medicine, food, clothes, blankets, and other support items for refugees who have made it to the safety of Ukrainian border countries like Poland.\n\nWe opened the doors of the Millennium Center to families of victims of terror and violence for Purim this year. Hundreds of parents, children, and grandparents came dressed up in costumes to celebrate and enjoy themselves.MDA volunteers provided an ambulance and volunteers, to make sure that everyone stayed safe all day long. This reassurance is key for many terror survivors."
    },
    {
      "title": "StoriesInspired by Faith: A Terror Survivor’s Amazing StorySaturday, March 12, 2022",
      "link": "https://www.visionforisrael.com/en/blog/inspired-by-faith-a-terror-survivors-amazing-story",
      "image": "https://images.prismic.io/vfi-website/f18c74a7-c2e6-4af8-9c50-cc4a028954ae_IMG_7699_small.JPG?auto=compress%2Cformat&fit=max&w=3840",
      "image_alt": "Bar Mitzvah",
      "category": "Story",
      "full_content": "Our team is working hard, now more than ever, to help the thousands of people who are arriving in Israel in need of support. So many have important, heart-wrenching stories to share, and we take the time to listen and comfort them.This is part of what we do at Vision for Israel. Our job is not only to provide physical items like backpacks, hygiene kits, and food, we also offer emotional support to the people that we help. Many of them want to tell their stories, and though all of them are important, some really stick with us. Dan Ami'el’s story is a lot like theirs.In 2004, Dan Ami'el was injured in a mortar shell attack in Kfar Darom whilehe was outsidethe synagogue, where he cameto praydaily. He was only 19 years oldat the time and was injured severely, to the point of near-death.Dan said, \"The immediate diagnosis was that I had a torn main artery. In such an injury it is only a matter of a minute or two until losing consciousness and death. The fact that earlier two mortar shells had fallen saved me because the standby ambulances were already in the field. If I had been hurt from the firstshellingat this level of injury, the chance of saving me in time would be very slim.”While on the ambulance, Dan recounts:\"Everything was full of blood. I remember the hands being thrown around. One of the doctors was busy with the dressing, the other is trying to keep me awake at all costs andaskingme dozens of times: 'Who are you? Where do you live?' There were moments when I felt extremely tired, I longed to close my eyes and fall asleep. I remember myself focusing on one of the stickers thatwerepasted on the side of the ambulance and reading it back and forth in a desperate attempt to stay awake. The fact that I was conscious gave doctors hope I could be saved,” he said.\"Dr. Sudi arrived and said, ‘What are you crying for? Start speaking the Psalms!’, so I started speaking the Psalms. It was an amazing thing. One moment I was reading stickers in an effort to stay awake and suddenly I found myself mumbling the Psalms.”He was transferred to the operating roomin the Soroka hospital, where the director of the trauma unit operated on Dan himself. There was extensive bleeding in his body, and it was hours before he left the operating room. His doctors said, despite the surgery, his condition was still very serious and that his life was in danger. Dan was transferred to the intensive care unit at the hospital.\"While arriving at the hospital I lost consciousness. I was put straight into surgery during which I received a transfusion of 27 doses of blood. For the next two weeks, I lay unconscious and I remember dreaming a lot. I dreamed of Jews gathering in synagogues to pray for me to heal. There were many dreams about the Land of Israel and the Temple.\"During the lengthy recovery and rehabilitation trajectory, Dan was exposed to other wondrous aspects related to his miraculous rescue. \"One day the head of the trauma department came to visit me with a group of students. He starts explaining to them my injury and how I recovered. They ask him: 'How is it that he did not get shrapnel in the chest and heart area?' Then the professor points to me and says to them: 'You will learn that a tallit is a ceramic element'. My whole body was completely crushed except for the organs that had holy vessels on them. The right hand is injured and the left hand, on which the tefillin was—almost undamaged. The lower body was injured but the upper body,which waswrapped in a tallit, was not injured. The head and neck were not injured thanks to the head tefillin.”Dan returned to the scene of the injury, at the entrance to the Kfar Darom synagogue, and prayed the blessing of Hagomel. \"It was Friday. All the residents left the cooking for the Sabbath evening, stood on the steps of the synagogue, and said 'Amen’ after me. I told them: 'I went looking for a tenth for the minyan, and in the end, I found 150 people .'\"Today, Dan is a father of 6 children. His children participated in the Bar/Bat Mitzvah celebration for terror survivors that Vision for Israel sponsors. Had the Lord not intended that day, Dan and his children would not be among us today.The Lord truly blesses those who are devoted to Him. Though Dan’s experiences were terrifying, God was with him every step of the way.We ask you to help support people like Dan Ami'el and his family. When you donate to Vision for Israel, you help to make sure that people who have survived terror and warfare have the ability to live long, happy, supported lives. Please donatehere.We hope this story touches your heart as much as Dan has touched our lives.May the Lord bless and keep you,Barry & Batya Segal"
    },
    {
      "title": "StoriesA Miraculous Milestone: Ya’ir’s StorySaturday, January 15, 2022",
      "link": "https://www.visionforisrael.com/en/blog/a-miraculous-milestone-yairs-story",
      "image": "https://images.prismic.io/vfi-website/8dc78be6-7a87-4428-b064-07ae909ab215_amitzurphotographer-4128.jpg?auto=compress%2Cformat&fit=max&w=3840",
      "image_alt": "Bar Mitzvah",
      "category": "Story",
      "full_content": "Last month, our team at Vision for Israel hosted a Bar and Bat Mitzvah celebration for young adults who have suffered from terror attacks. By throwing a party, we allowed them to celebrate this major milestone when they otherwise wouldn’t have been able to. Though they all have touching and tragic stories, one of the Bar Mitzvah boys, Ya’ir, had a story that stood out to us. He gave a speech at the President's house during the celebration. We wanted to share his story with you.Though he is now 13, Ya’ir was injured in Sderot when he was 9. That dayhe went to a protected park in Sderot withhis mother and sisters. Ya'ir played with his friends in one area of the park while his sisters played in another area, and his mother sat with the other mothers. All of a sudden, a Code Red alarm sounded and all the children started running in panic. Because he was so young, Ya'ir didn't know what to do. He searched for his mother and could not find her. He began to cry, running everywhere to try and find her. Because of this, he did not have time to get into the mobile shelter. As he looked skyward, he saw the interceptions and heard the terrifying booms of the attack.Although Ya’ir didn't suffer any physical harm, he was mentally injured. Any loud noise, like a plane in the sky or a motorcycle passing by, causes a stress reaction. He can’t shower without the door open, and can’t stay home alone because of his condition. Doctors believe that this is likely a case of Post Traumatic Stress Disorder (PTSD).At first, Ya'ir's mother struggled to identify Ya’ir’s condition. However, after talking with her friends and hearing that their children suffered similar conditions after rocket attacks, she decided to get help for her son.There were times before Ya'ir was injured that his mother went for a walk with the children where there wasn't a protected area. During these walks, if a Code Red siren sounded, Ya’ir’s mother would lay her children on the ground and lie down on top of them. Ya’ir will no longer go for these walks. His sisters are similarly hesitant, though they aren’t as traumatized as Ya’ir is. Not being able to find one’s mother in a time of crisis is truly traumatic.Though Ya’ir’s story touched our hearts, it is unfortunately not the only such story we’ve heard. Thousands of children are terrorized every day by the violence and terror that surrounds Israel. Childhood wonder and freedom are being stripped away, as these children see how brutal and terrifying the world can be. Many of them are forced to grow up faster than they should.Our mission at Vision for Israel is to protect as many of these children as possible. We have been providing mobile bomb shelters so that more people have access to protection. We offer food and financial support to families who have experienced terrorism. We even host Bar and Bat Mitzvah celebrations annually to ensure that these children have some happiness in their young lives.All of the work that we do is made possible by you, our friends and sponsors. Without your regular donations and generous gifts, children like Ya’ir would define their lives only by violence, terrorism, and pain. Because of you, they can receive a bit of happiness and comfort despite what has happened to them.As we enter 2022, please consider beginning or increasing your donation to Vision for Israel. It is because of our donors that we can support so many in need. If you wish to make a donation, you may do sohere.We also acceptCrypto,bank transfers, and many other alternative ways to donate.May we be able to continue our work into this new year, and may the Lord bless and keep you.Your friends,Barry & Batya Segal"
    },
    {
      "title": "StoriesYour Service in ActionFriday, November 26, 2021",
      "link": "https://www.visionforisrael.com/en/blog/your-service-in-action",
      "image": "https://images.prismic.io/vfi-website/99885c9d-c13c-4755-b690-6c386bb99fc7_LauraSiegal_VFIMoneyvouchersOverview026.jpg?auto=compress%2Cformat&fit=max&w=3840",
      "image_alt": "Woman Receiving Gift Cards",
      "category": "Story",
      "full_content": "Dear friends,As many of you know, our organization helps a variety of different people in different stages of life. You also likely know the number of day-to-day tasks and activities that go into making Vision for Israel work. Sometimes, volunteers handle these tasks, while other times Barry or myself shoulder the responsibility. Some years ago, one of these tasks turned into a wonderful chance encounter.For months, our accountants had been trying to take care of a number of documents from the government’s public non-profit institution division. There was no response from this government office for some time, and we began to feel desperate. I decided to simply go to the office during reception hours and get the required documents.I arrived and was the last in line. When it was my turn, the girl at the counter called me to approach the desk. She asked me who I was and what service I needed. I mentioned my name and the name of our organization. I saw that her expression changed when she heard my answer.The truth is, I was worried. I thought maybe something was wrong. Then she asked: “What is your role?” I explained that my husband and I had founded the organization and I also now serve as the general manager. She excused herself and left for a few minutes.When she came back I saw tears in her eyes. She began to tell me her story.\n\nHer story moved me deeply and brought me a deep sense of accomplishment and joy. This is exactly why Barry and I established VFI—to bring light to the lives of people who are experiencing difficulty.I did not hide my joy, and we agreed to stay in touch. It struck me that in the past, she needed my help while now it was my turn to ask for her help with the day-to-day tasks of the organization. VFI is a wheel that never stops turning, and only God can bring us into situations where we meet special people at unexpected times. I knew that this was one of those special people.When I came out of this unexpected encounter, I realized one thing: there is no limit to the happy surprises God puts in our lives. I entered the office worried and left with a sense of satisfaction and joy. The situation with the paperwork happened because I was supposed to go to this government office at this time and place to meet Orly.Stories like these are why we do what we do. Our purpose is to help people when they are in dark times and walk with them into God’s light. Our volunteers and partners make this possible. Without your love and support, who knows where Orly would be today? You have a direct impact on families going through tough times, and that is important work.We are so grateful for all you have done, and all you continue to do. May the Lord bless and keep you.Your friends,Batya and Barry Segal"
    },
    {
      "title": "StoriesImpact Report—November 2021Friday, November 12, 2021",
      "link": "https://www.visionforisrael.com/en/blog/impact-reportnovember-2021",
      "image": "https://images.prismic.io/vfi-website/ae706d42-6bc2-4630-9705-b63306dfca1d_IMG_1229.jpg?auto=compress%2Cformat&fit=max&w=3840",
      "image_alt": "Pack to School",
      "category": "Story",
      "full_content": "Over the last three months, our efforts have been focused on providing basic essentials and prepaid gift cards to families in need throughout the land of Israel. Here are some highlights from our recent activities.\n\nThis has been an amazing summer. We have been hard at work helping anyone and everyone that we can and spreading God’s light throughout our community. Though we know that this work has amazing effects, sometimes it really strikes us how much of an impact we can make through God and our donors and friends.Imagine all the 275,000 children who were the recipients of VFI’s school bags over the years coming together to shout “thank you!” The sound would be tremendous. It is this reality that keeps us going.It warms our hearts when we interact with these children and their parents. Their joy and laughter at our events bring out the children in us too, something that is rare and cherished as the years pass. Through the eyes of these children and their smiles, we can relive our own childhoods. Our ability to help them attend school and gain education is nothing but a blessing.\n\nIn August, we donated two more vehicles to MDA (Magen David Adom): a bloodmobile, and a mobile intensive care unit ambulance (MICU). The dedication event was heartfelt and meaningful, full of sincere speeches and gratitude. So far, over 30,000 emergency responses have occurred with all the vehicles that we have donated. Saving lives and saving people is what it is all about!\n\nEvery year, the weeks before the Jewish High Holidays are especially busy for us at Vision for Israel. One of VFI’s main activities is the distribution of magnetic gift cards to low-income families, the elderly, Holocaust survivors, new immigrants, terror survivors, and lone soldiers.Many times, a gift card means the world to them, especially in preparation for the holidays. This time of year means more expenses and more preparation for family meals and celebrations. Our magnetic gift cards help to ease financial stress and help families to celebrate the High Holidays properly.\n\nWe held a ceremony at the Millennium Center for 52 terror survivor students and their families. The students received scholarships to help them with their higher education. There was a moving speech and beautiful music. The latter was performed by a musician who lost both his parents in an act of terrorism.Giving scholarships brought intense joy to many of these students, and allowed us to help to ease some of the pain and hardship that they carry.\n\nWhen the rockets were falling on us, we found ourselves praying for God's intervention. Our prayers—and our appeals to you, our faithful partners—have been answered. Thanks to your generous participation and faith in our work and in God, we have now ordered enough shelters and locking systems for the first stage of our goal.\n\nWe are so incredibly grateful to have received a donation of 1,020 new pairs of denim overalls from the Netherlands.Our team at Vision for Israel donates the clothing we receive to needy families. We also give to children’s homes and at-risk children, as well as young people with unique emotional and cognitive needs. Our donors in this arena have always been so generous, and we are continually grateful.\n\nHunger does not only exist during the holiday season, so we work with food donations all year long. Our wonderful volunteers have helped us pack hundreds of baskets during every donation event. We then distribute the baskets along with magnetic cards for purchasing food at the major food chains. Dozens of families come to various centers across the country to receive the assistance. We work in collaboration with the welfare departments to locate the people who need help the most. This month, our team distributed food baskets in Neve Yaakov in Jerusalem and Rishon Lezion. We see these baskets making a huge difference for some families, and all of them are so grateful to our donors for making our work possible.\n\nIt's always good when our partnerships with organizations and nonprofits expand. Recently we sorted and packed lots of items to donate to charities. Among the objects were clothing and shoes, medical equipment, tools, housewares, undergarments, bedding, school bags, and more. The organizations that receive the donations address important issues in Israeli society, such as helping minorities, rescue and disaster relief, combating domestic violence, and helping school dropouts.With the help of our partner organizations, we can reach out to more and more people in need.\n\nAs we do every year, this winter we will hold a festive event for dozens of bar and bat mitzvah boys and girls from families affected by terrorist attacks. We do this together with other organizations that represent the victims of hostilities and terrorism.The work begins months in advance, as we plan and improve our methods. All of us are very excited and hope to hold a moving, significant, and memorable event this year for these dear children, who have endured more in the past few years than many of us have in our whole lives."
    },
    {
      "title": "StoriesFood Baskets for the NeedyWednesday, October 27, 2021",
      "link": "https://www.visionforisrael.com/en/blog/food-baskets-for-the-needy",
      "image": "https://images.prismic.io/vfi-website/9badeaea-6ac8-42ba-8089-ee293e1ffb17_VFI+Blog+Oct+28+%232.jpeg?auto=compress%2Cformat&fit=max&w=3840",
      "image_alt": "Food Baskets for the Needy",
      "category": "Story",
      "full_content": "As you know, our team is constantly serving our community. Whether we are giving backpacks to children or funding medical vehicles, God’s work through you is ongoing.The delivery of aid to families this week was particularly interesting. We took supplies and food baskets to about 50 families in downtown Jerusalem. The baskets were heavy, and there were no safe spaces to park and unload. In the end, we had to recruit willing passersby to distribute the baskets to the waiting families. Though it was no small job, these people responded to our pleaand helped us carry the baskets to the distribution point.Families gathered their baskets, thanked us, and went home to cook their meals. However, while we were distributing we received a call from a woman. She was on our list to receive a food basket, but she had a special request. She could not take any dry food, only fresh and ready-to-eat items. This is because she was recently evicted from her home, and had taken to living in a nearby park. She had no stove to cook on, no kitchen to prepare anything in, and no hope of returning to her home. Her financial situation would prevent her from moving back in. We were able to bless her with a gift card so she could purchase food items that fit her situation.God works in mysterious ways. This woman became a reminder from Him that every person we meet is facing a unique and personal struggle. Though we are all human, we all have different problems and issues to overcome. While we can’t pretend to understand this woman’s experience with homelessness, our heart goes out to her and her family.This work can be difficult, but we are constantly encouraged by the fact that our service and our gifts truly mean something. Your help allowed this woman to eat and gave her a basic necessity that she had otherwise been denied. Anything we can do, any kindness we can extend, makes a difference. When we walk in God’s light and do good in His name, we make the world a better place."
    },
    {
      "title": "StoriesImpact Story—October 2021Wednesday, October 13, 2021",
      "link": "https://www.visionforisrael.com/en/blog/impact-story-october-2021",
      "image": "https://images.prismic.io/vfi-website/e03a0b55-f37c-4cea-894a-0a06d21a001f_Impact+Story_shutterstock_182053358+small.jpg?auto=compress%2Cformat&fit=max&w=3840",
      "image_alt": "Mom Hugging Children",
      "category": "Story",
      "full_content": "As you know, the goal of Vision for Israel is to help as many individuals and families as we can. Whenever a child of God is in distress or needs support, we do all that we can to provide them with what they need.Yulia* came to us through her Hebrew teacher. This teacher is a family friend of the Segals, and she approached them out of familiarity with VFI's activities.The teacher had noticed that Yulia seemed distressed, and noted that she had been coming to class with puffy eyes and heavy makeup. The teacher asked Yulia about her safety and security at home. Yulia barely had to say anything. The pain and difficulty of her story were written on her face.Yulia has no family in Israel except her two young children. Both children have special needs and require additional care. She speaks only Russian, but she is studying Hebrew to be able to communicate better. Though she has a husband, she and her children suffered violence from him and now have a restraining order to keep themselves safe. Unfortunately, this restraining order only lasts for three months.In a letter to her teacher, she details the horrors that her husband inflicted upon her and the children. Not only did he physically assault and beat them all, but he also stole the disability support money that the children receive every month. They have experienced mental abuse from him as well, including instances of humiliation and entrapment. He keeps the children from getting an education and does not allow Yulia to have friends or make a living.The abuse against Yulia herself has been occurring for a long time, but until now she was too afraid to speak out.Her goal is to divorce her husband, but Yulia is completely broken and does not know how to proceed from here.Vision for Israel immediately gave Yulia a magnetic gift card and food baskets, toiletries, and several other items for the home. We are now preparing more items for her that she needs, more food baskets and gift cards to buy food, toys for the children, home equipment including furniture, electrical appliances, clothing, bedding, blankets, and more. All of these will be transferred to her in the coming days.It is thanks to our generous donors that we get to help people like Yulia escape from horrific situations. With God and you, our dear partners, by our side, we are able to enact His vision of love, kindness, and peace here on earth. Please consider giving what you can to this life-changing—and sometimes life-saving—cause.*Name has been changed to preserve privacy"
    },
    {
      "title": "StoriesOngoing Tragedy for a Child of GodMonday, August 16, 2021",
      "link": "https://www.visionforisrael.com/en/blog/ongoing-tragedy-for-a-child-of-god",
      "image": "https://images.prismic.io/vfi-website/78f801d9-c3ff-4786-b679-da5666828dfb_shutterstock_2022263723+copy.jpg?auto=compress%2Cformat&fit=max&w=3840",
      "image_alt": "Man by Beach",
      "category": "Story",
      "full_content": "In March of 1988, there was a terror attack known as the Mothers' Bus Attack. Terrorists infiltrated the Egyptian border and managed to take over a bus that was transporting workers to work.That day, Alon’s* father rode that bus as he did every day. But this time, his usual bus ride took a tragic turn. He was held hostage and was eventually murdered by the terrorists.Alon’s father was his only parent when he died. His mother had died shortly before, after a long battle with cancer.It seems symbolic that his father, who acted as both father and mother to his family, was killed on the Mothers’ Bus.The hostages that did not perish said that Alon’s father was a hero, and sacrificed his life rescuing the women that were on the bus as the driver opened the doors and fled. His father was left alone to deal with the horror, and he acted nobly.Alon’s father was far from being ready to die. He was just 39, towards the end of his doctorate studies in laser welding. Many of his coworkers said that he would be the next CEO of the company.This and many other things didn’t happen. Alon and his brothers didn’t get to see their father advance in his career or see his children and grandchildren grow. Alon and his two brothers were very small at the time, and they lost the only remaining parent they had. They were left with no one and were put into foster care.The difficulties Alon faced after experiencing loss at such a young age, are exactly the same as the orphans included in the 2012 Compensation Law for Animosity Orphans. Yet he has not seen compensation through this law.The government was supposed to help and support the victims' orphans rather than create additional hardships. However, Alon was denied essential assistance from the state. In response, he turned to the court to seek protection under The Compensation Law for Animosity Orphans.The state has failed to pay any sort of compensation to Alon.Since the day of the terror attack, Alon has been living in a state of survival. The pain of losing his parents has only grown over the past 33 years. Losing both parents within six months of each other at such a young age is unbearable.The crises that followed the attack were only made worse by the absence of his parents and lack of support. 8 years ago Alon lost the family he was building to a difficult divorce. The economic hardships that followed affect him to this day. He has suffered through layoffs, both due to Covid-19 and otherwise.No matter how old a person is, parental support (mental and financial) is necessary. Even when happy moments occurred in his life, he had no parents to share his joy with. He celebrated his bar mitzvah alone and has lived alone in the world since he came of age.After filing an appeal to the authorities  7 years ago and being denied assistance, Alon had to take out loans over the years just to survive. With the Covid-19 pandemic, Alon is out of work and behind on loan payments. He cannot see his children regularly.  He has no car, and he has no ability to pay spousal support.We at VFI know that God would not leave his children in this situation, and we will not either. We are stepping in to help support Alon during this very difficult time.Alon’s battle will not bring his parents back. His tragedy of the past can become a victory of the present and the future.We want to be part of his victory story. Giving him the power and strength to become an overcomer.Will you join our efforts to bring healing to a broken-hearted person?Your monthly support will go a long way in helping people like Alon.Your contribution is greatly appreciated and needed.*Name has been changed"
    },
    {
      "title": "StoriesWidow, Mom of 11 Had Nowhere to TurnSunday, July 18, 2021",
      "link": "https://www.visionforisrael.com/en/blog/widow-mom-of-11-had-nowhere-to-turn",
      "image": "https://images.prismic.io/vfi-website/f6029124-d7c5-46d6-ae9a-e440a622f170_LauraSiegal_MoneyvouchersBarrybatya064.jpg?auto=compress%2Cformat&fit=max&w=3840",
      "image_alt": "Money Vouchers",
      "category": "Story",
      "full_content": "We recently became acquainted with Miriam*, a mother of 11 children who lost her husband Moshik*, a few months ago. Moshik passed away after a long battle with COVID-19.Miriam and Moshik made Aliyah to Israel a few years ago. It was their dream to come and live here in the Land and they had been planning to move for years. However, it was not a simple decision. Emigrating to Israel with 11 children was difficult, and the transition was complicated for the kids. Learning a new language and getting a job in a new place was not easy, but it was the only way to provide for their big family. Moshik switched professions and became a manual laborer, refurbishing and renovating homes. He worked on the side as a taxi driver.Since Moshik’s passing, Miriam is left as a widow and a single mother to her 11 children, a position that would be difficult for anyone to endure. Her 22-year-old eldest son got married a few months ago, and now he and his wife live with her. He is not working and is receiving unemployment payments. The youngest daughter is 4 years old.Moshik was the main breadwinner. Since he passed, the family has relied on friends to sporadically help them with the cooking, but their troubles are bigger than that. They need help in the long run. Miriam has been working as a taxi driver until they find more permanent assistance. The job’s flexible hours allow her to bring in a little bit of income for the family.The recent conflict in the south has brought more burdens and challenges into her life. With the rockets falling in their neighborhood non-stop, Miriam had to remain close to home for two weeks. This tragedy not only created fear and suffering, but it also prevented her from earning money driving her taxi.Miriam is a very diligent person and she works hard, but despite her efforts, her income is still very low. She approached us to seek financial support to pay the rent, utility bills, as well as help to buy food, clothes, and pay for the children’s educational programs. The last 15 months have been the greatest challenge in her life. Her situation came to our attention and we knew that VFI had to find ways to assist her.Vision for Israel is supporting the family financially, providing household essentials, and giving the children the school supplies that they need. We are in touch with the family, and check in frequently to see if they need anything beyond what we have been giving so far.*Names have been changed"
    },
    {
      "title": "StoriesYour Incredible ImpactSaturday, July 10, 2021",
      "link": "https://www.visionforisrael.com/en/blog/your-incredible-impact",
      "image": "https://images.prismic.io/vfi-website/93f506e4-d0b3-4841-9be1-aa3f080fc3f8_WhatsApp+Image+2021-05-26+at+04.01.15.jpeg?auto=compress%2Cformat&fit=max&w=3840",
      "image_alt": "Food Baskets",
      "category": "Story",
      "full_content": "Poverty, deprivation, and hunger play an integral role in the lives of many people in Israel. Our team at Vision for Israel cares for the food security of hundreds of poor people, and over the past few months, we have distributed hundreds of food baskets--as well as financial vouchers for fresh food, toiletries, and clothing. The distributions were given to families in need in Jerusalem and the areas, Modiin and Rishon Letzion. We were delighted to see the faces of these precious people.\n\nThis year, summer vacation carries with it a special meaning for the children of Israel. After having endured so much—a global pandemic followed closely by a war with Gaza—tensions and anxiety have been high. That’s why this year we are distributing 2,500 school packs to children going into the primary grades. We were so thrilled to get the schoolbags into the hands of those kids who are excited to receive them.\n\nSince 1999, Vision for Israel has helped to provide for the needs of 275,000 children throughout Israel. Each year, we improve the way we distribute, and the quality of the school bags. Even despite Coronavirus, we found creative ways to reach out to the children. We are thrilled to have so many faithful volunteers coming regularly to help us with the packing of all the goodies that fill these children’s bags.\n\nHolocaust survivors, who survived the horrors and came to Israel to find a home and rest, are haunted by the difficult memories, and most of them suffer from severe loneliness, financial distress, and health problems. We distributed about 80 food baskets to Holocaust survivors from Rishon Lezion. The survivors rejoiced at receiving the baskets which are rich in nutritious and healthy ingredients.\n\nWe have partnered with the Foundation for the Benefit of Holocaust survivors, and have run an initiative to fund emergency button services in the homes of Holocaust survivors. So far, we’ve enabled about 800 Holocaust survivors to call immediately for help (doctor or ambulance) in any case of distress—24 hours a day, 365 days a year—whether living alone in their homes or in sheltered housing.\n\nWe receive so much joy by being able to bless this family that came out of the tragedy and is doing all they can to overcome the terror attack they faced years ago. We have been supporting the family financially for several years and recently provided them with 6 months of supplies for their twin babies—including baby formula, diapers, clothes, and toiletries. VFI also donated appliances and other household items.\n\nOur new donated ambulance was recently released from customs, and Barry went down to the bonded warehouse facility with MDA and the UK director for a short dedication ceremony.  This new ambulance is going to serve the city of Modiin, in the area where the Millennium Center is located.All of the VFI donated emergency vehicles have now responded to over 30,000 calls and so many of them life-saving.\n\nFor those living in Israel, rocket attacks from Gaza are not uncommon—but the scale, severity, and range of targets involved in the latest war with Gaza has truly been unprecedented. Once a siren is heard, there are only 15-45 seconds to enter a protected area. We were urgently asked to help and provide lifesaving equipment designed for these emergencies, to provide public protection; mobile shelters, emergency locking systems, and bomb blast doors. We are currently in the process of funding the purchase of mobile shelter units and are continuing to raise funds for this important project.\n\nRecently we got to know the Shavo family. The father, is 60 years old today. He can’t work due to his medical condition. In 1996 he was ambushed by radical terrorists and they stoned him. In self-defense, he responded by shooting at the ground to drive them away and one of the terrorists claimed that he got injured. This led to over 15 years of legal battles resulting in financial distress. In 2002 he lost his wife and three of their children in a separate terror attack. Thankfully he and four of his children survived. Recently we appealed to all of you to help the family. Some of you, our dear friends, have responded and he has now paid his debt fully. Thank you."
    },
    {
      "title": "StoriesFrom Victims to OvercomersSaturday, May 29, 2021",
      "link": "https://www.visionforisrael.com/en/blog/from-victims-to-overcomers",
      "image": "https://images.prismic.io/vfi-website/afd52046-9c1b-4cfd-88e9-fd473df5b97d_image.jpg?auto=compress%2Cformat&fit=max&w=2048",
      "image_alt": "Terror Victims",
      "category": "Story",
      "full_content": "One Shabbat evening in 2002, in the Beit Israel neighborhood—an ultra-Orthodox Jerusalem neighborhood located near the seam line between east and west Jerusalem—a suspicious man in ultra-Orthodox clothing was noted by passers-by.\n\nShortly after 7 PM at the end of the evening prayer that ends Shabbat, the streets were crowded with people. On the way out of a yeshiva in the neighborhood, many people gathered, including a family who had come to spend the Sabbath in Jerusalem to celebrate their sons' bar mitzvah.The suspicious man was a suicide bomber—and he detonated himself near a group of women standing with baby carriages, waiting for their husbands to come out of prayer.In total, ten people were killed, including six children.One of the wounded in the attack was the son of Shlomi* and Michal*, Aryeh*—who, against all odds, was resuscitated at the scene. Shlomi and Michal themselves were also seriously injured and were taken to the hospital for treatment.At that time Michal was pregnant with their daughter Esther.Al-Aqsa Martyrs Brigades later claimed responsibility for the attack—one that marked the beginning of a wave of terrorism known as \"The Black March\" during the second intifada.We met the family at the Bar Mitzvah celebration we do with the organization for terror victims every year. At this special event, we learned about their moving story and became acquainted with the needs of the family.We began to support the family financially and provided them with 6 months of supplies for their twin babies—including baby formula, diapers, clothes, and toiletries. VFI also donated appliances and other household items.Since the terror attack, and despite their severe post-traumatic stress, the family has tried to return to a routine. Embracing the family has been a win-win situation. We always see them smiling and always expressing huge gratitude for the support.We receive so much joy by being able to bless this family that came out of the ashes and is doing all they can to overcome the tragedy they faced years ago. The family always invites us to their special events. This past year they were so happy to invite us to the weddings of two of their eight children—including their 19-year-old son Aryeh who survived the attack.Although we came to help them, we left encouraged and strengthened after having known them and seeing their powerful example of redemption and healing.*Names have been changed"
    },
    {
      "title": "StoriesImpact Story: Fighting Terror Through Incredible HardshipMonday, April 19, 2021",
      "link": "https://www.visionforisrael.com/en/blog/fighting-terror-through-incredible-hardship",
      "image": "https://images.prismic.io/vfi-website/2fba5d20-4adf-46ef-af22-f38b19126880_Screenshot+2021-04-13+at+13.48.00.png?auto=compress%2Cformat&fit=max&w=3840",
      "image_alt": "Terror Victim",
      "category": "Story",
      "full_content": "Recently we got to know the Shavo family. Boaz, the father, is 60 years old today. He can’t work due to his medical condition.\n\nIn 1996 he was ambushed by radical terrorists and they stoned him. In self-defense, he responded by shooting at the ground to drive them away and one of the terrorists claimed that he got injured. This led to over 15 years of legal battles resulting in very big financial distress. But that was far from the end of the tragedy.\n\nBoaz then lost his wife and three of their children in a separate terror attack in 2002. Thankfully Boaz and four of his children survived. His son Asael tells a powerful story:\n\n“In the year 2002 a terrorist broke into our house and shot to death my mother and three of my brothers. I was shot in my right leg--three bullets left me severely wounded. My leg was amputated afterward. I was nine years old. My family went through a terrible trauma; our house was burnt down, I spent two years in the hospital following that terrible night.”\n\nA few years ago, Boaz who was a medic, was called to a terror attack site, where he discovered that his son’s friend’s parents were murdered.\n\nAt the Shiva, he was trying to bring light, hope, and faith.\n\n“My message is that the people of Israel are overcomers and are not afraid. In my case, they wanted to destroy my family—and still, I rose up again, despite the ongoing pain and difficulty. They murdered my wife and three children, but 4 survived, and after remarriage, we have triplets and the house is full of light. We adopted a son 7 years ago and truly there is a lot of joy. I always ask myself, what would Rachel want me to do? The drastic change between the life I had to the new life is hard, there is no school that teaches that.”\n\nAccording to him, coping is difficult but you must get up on your feet.\n\n“I relive the attack all the time. Every little event startles me. [When] I’m on a trip up north, I remember where my son hiked. My dear ones were born in Itamar and were murdered there, and I also buried them there. But we move on, that’s the answer. To raise a family and more families and more children, because the People of Israel is alive.”\n\nBoaz is proud to tell his son’s Asah’el extraordinary success story, who was severely injured in the terror attack and lost his leg.\n\n“He was 9 years old at the time, and he took control of himself. From the day that he woke up in intensive care, he always told me, dad, I want to do everything by myself. I told him, but you don’t have a leg. He insisted on jumping on one leg.\n\nToday he is a grown man. But in the first few years, I accompanied him every day with a lot of difficulties. Sometimes I carried him in my arms until he learned how to walk. Today he is an exceptional swimmer and also a basketball player in Israel’s Disabled Team and he represented Israel in the Rio de Janeiro Paralympics (2016).\n\nToday it doesn’t bother him, he feels like he has 2 legs. He has fun, works, and teaches swimming. He finished his bachelor’s degree in Phy Ed at Wingate. He teaches children to swim and he managed to teach a girl who didn’t want to get out of a wheelchair to swim. I know that the whole subject of terror attacks still hurts him, but he goes on. That is the hope and that is the continuity.”\n\nBoaz is such an inspiration to us—having lived through tragedies that most of us will never experience, yet keeping an optimistic and positive outlook on life. He has no income due to his injuries from the terror attack. Yet he now finds himself with a huge debt. We at Vision for Israel want to help alleviate some of this debt. Will you join us and help Boaz and his family get out of this huge debt?\n\nVFI is supporting the family to cover their balanced debt of $65,000. Will you consider helping us to present them with a financial gift?\n\nLearn more about Boaz here:https://youtu.be/wkZMuZ7XGqw"
    },
    {
      "title": "StoriesTerrorism—and Its Deep, Personal TollSaturday, March 13, 2021",
      "link": "https://www.visionforisrael.com/en/blog/terrorism-and-its-deep-persona-toll",
      "image": "https://images.prismic.io/vfi-website/4adc30a9-df9e-4cc2-ae9f-ddfd0e523d35_0844.jpg?auto=compress%2Cformat&fit=max&w=3840",
      "image_alt": "Bar Mitzvah Celebration",
      "category": "Story",
      "full_content": "Everyone in Israel remembers the deadly attack in south Mt. Hebron in the Adora settlement in 2002. Two terrorists infiltrated the settlement on a Saturday morning, dressed in IDF uniforms and armed with M-16 rifles, and killed four people.We met Shiri Shefi at the Bar Mitzvah celebration we hosted at the Millennium Center in December 2020, when her son was celebrating his Bar Mitzvah.Shiri Shefi who was then a 27-year-old mother of three small children ages 5, 4, and 14 months, lost her eldest daughter, Daniel. She now recounts the moments of horror and says; “To this day, even 19 years later, I sense Daniel everywhere. In the difficult moments, when everything closes in, I feel her hovering over me and pulling me out. Then I [thank God] for both the good and the bad. There is strength at the end of the day, even though the pain cannot be erased.”“Daniel wanted to go to the synagogue with my husband. A month and a half earlier she celebrated her fifth birthday. I remember that because she wore the same clothes to go to the synagogue, I still remember her telling me, “Mom, just a minute”, as she just wanted to finish watching some kids’ show on TV. And as she was saying those words, I saw a man in my living room wearing IDF uniform with a long M16 and a bulletproof vest, standing at the door and starting to shoot. I yelled at him; “what are you doing?!!” and for a moment I didn’t realize what was happening since we had soldiers in our settlement and I hadn’t yet realized this was an attack. He started shooting and from that moment I acted automatically. I went into the adjacent kids’ room, shut the blinders, switched off the TV, shut the door, and hid Daniel and Eliad under the bed, and asked them to be silent, and with my little son Uriel, I went under the other bed. After a few moments, I turned to the children to see what was happening. I saw that Daniel and Eliad were injured, I did not understand what was happening with them. Everything happened in a matter of seconds and all that while I’m hearing rifle shots continuing inside the house.”In those moments Shiri still did not know Daniel was gone, despite whispering to them to check if everything was okay with no answer. She thought they did not answer because she had told them to be quiet. At some point, when the firing subsided, Shiri started thinking about how to alert that they suffered an armed attack.“As I was thinking how to get to my cell phone I heard Daniel’s last breaths and I realized that she is not among the living anymore. As if God was telling me that I cannot touch her as she is no longer mine”, she says. “I quietly called Eliad again and he did not reply and I thought that they are both not alive anymore and that it’s just me and Uriel.”Shiri managed to get to the MIRS device, and at that moment a neighbor from an adjacent settlement called and asked if everything was ok, in reply Shiri said: “The kids are dead.”“I recall telling the neighbor that if God wasn’t there to help, how could she do anything to help?”The call was cut off and Shiri tried to call the police station in Hebron where her husband, both her brothers and brother in law worked. “I spoke to the diarist and yelled to him that the children are dead.” He did not understand what I was talking about because the news about terrorists had not reached them yet. My brother who was there grabbed the phone and told me enforcement was on the way, and I replied that the children were already dead.”When police forces arrived at the scene together with Yaakov, Shiri's husband, a cry came out of Shiri’s throat: “I'm sorry I could not save the children; Daniel and Eliad are dead.”“Eliad survived,” Shiri says. “When I was in the ambulance they brought him to me to see that he was alive. He was injured in the ear and head but thank God he was alive.”“We had two more children later, Noya and Guy. It was difficult looking for a home to live in. Eventually, after several attempts, we decided to live in front of the sea in Ashkelon, after trying dozens of apartments. We are like the sea—sometimes calm and quiet and sometimes raging. What goes on with our emotions is very difficult because something was taken from our soul, which will always be missed and always be painful—it cannot be explained.”“At the end of the day, with all the pain involved we have no other country,” Shiri says. “When Daniel was born we added the name Bat-El to her name. She is named after my late father-in-law which I never got to know, so we added the name Bat-El to hers. After she died, we wrote on the tombstone: \"A land flowing with milk and honey.\" Honey (דבש Dvash in Hebrew) is an acronym for Daniel, Bat-El, and Shefi. Even with all the difficulty, we see the best in the Land,” she concludes."
    },
    {
      "title": "StoriesImpact Story: A Gift of CounselWednesday, January 27, 2021",
      "link": "https://www.visionforisrael.com/en/blog/impact-story-a-gift-of-counsel",
      "image": "https://images.prismic.io/vfi-website/ef1452d2-87dc-46a7-b3c2-c115582756f3_IMG_2165.JPG?auto=compress%2Cformat&fit=max&w=3840",
      "image_alt": "Financial Aid",
      "category": "Story",
      "full_content": "When we do our outreach, we are constantly interacting with recipients of our aid. This woman wished to remain anonymous but was willing to share some of her story with us. Adi* described her situation as desperate. She and her husband had found themselves in a difficult financial crisis after he’d lost his work as a bus driver, and she was left to care for the family through her work in a child care facility.\n\nTheir expenses remained the same: rent, utilities, food, and everything else it takes to raise a family and run a home—but their income became significantly restricted. Adi had become extremely anxious trying to figure out how to address the huge debt they accumulated. Even with the direct financial aid, we offer at Vision for Israel, it wasn’t clear to her how to proceed.\n\nThankfully, we were able to offer them financial counseling services through our trusted nonprofit partner, which combined with the aid itself to help make a much larger positive impact. Not only did they receive the money to give them a boost out of their situation, but the financial tools to use it wisely on their limited income.\n\nAt Vision for Israel, we aim to give all families in need the tools to fight their hardships, so they can have hope for a better future, and be better prepared for the road ahead. So we’re enrolling up to 120 households in a special program that consists of 10 one-on-one, in-depth meetings with a qualified financial consultant. When they complete the course, the couple will receive a financial gift of $1000 to start them off strong."
    },
    {
      "title": "StoriesEnormous Impact on a Very Special DaySunday, January 10, 2021",
      "link": "https://www.visionforisrael.com/en/blog/enormous-impact-on-a-very-special-day",
      "image": "https://images.prismic.io/vfi-website/c13f3357-c5d2-47a8-acfd-4db2648da949_IMG_5866+copy.JPG?auto=compress%2Cformat&fit=max&w=3840",
      "image_alt": "Bar Mitzvah Celebration",
      "category": "Story",
      "full_content": "On a dreary day, the morning of the 7th light of Hanukkah, during a very dark year—the light was rekindled in our hearts.We chose Hanukkah to celebrate bar and bat mitzvah with these sweet children from terror victim families because what better time to shine a light through the darkness?Each year, we at Vision for Israel organize a moving, meaningful, and unforgettable event. 48 boys and girls came to the Millennium Center for a theatrical guided tour.\n\nBelow is an abridged version of the letter we received afterward:\n\n“I would like to express my appreciation and gratitude on behalf of the representative organization and its members, to Vision for Israel, headed by Batya and Barry Segal, for your contribution to the success of the Bar and Bat Mitzvah 2020 event for children affected by acts of hostilities.At the Bar and Bat Mitzvah event, 48 orphaned children, bereaved siblings, disabled children, and children of disabled parents, who were hit by missiles and Qassam rockets in the Gaza surroundings and southern Israel. Children who have lost their families, parents, and siblings in the various deadly attacks have participated in this celebration with us.This project is an exciting, powerful, and unforgettable experience for families and children, especially this year in light of the Corona crisis, where children who reached their bar/bat mitzvah age do not get to experience and celebrate an exciting event that is so important to them.\n\nVision for Israel contributed to the Bar and Bat Mitzvah event 113,141 ILS (US $35,546) for:\n\nThank you for the great effort and investment, for the professionalism and full partnership in the activities for the welfare of the victims of hostilities.\n\nWith deep appreciation for the assistance in the implementation of various projects for the benefit of the members of the organization. May there be more generous and willing donors and, like the directors of Vision for Israel, Batya and Barry Segal.“\n\nRo’ee CohenDirector-General of the Organization of Victims of Hostilities\n\nThe success of each event we organize is measured by one thing—what each person takes with him/her from the event and carries in their memory. All of this would not be possible without your incredible support! Because of you, we were able to lift their spirits and give them an embrace from afar so they know they are not alone.On behalf of the children, we say Thank you!"
    },
    {
      "title": "StoriesThe Warmth of Home for HanukkahTuesday, January 5, 2021",
      "link": "https://www.visionforisrael.com/en/blog/the-warmth-of-home-for-hanukkah",
      "image": "https://images.prismic.io/vfi-website/a0fb5c22-f75c-40b7-a7e8-e50e5c7693fe_IMG_4712.JPG?auto=compress%2Cformat&fit=max&w=3840",
      "image_alt": "Lone Soldiers",
      "category": "Story",
      "full_content": "What is a homeland? Is it the place where you were born and raised? Is it the place where you currently live? Or is it the place where you feel most at home?\n\nMost of the lone soldiers in Israel originate from the US, Canada, UK, and South America. And they came here to serve, without family or friends.Many Jewish youths around the world feel a strong need for a homeland—a place where they can feel at home, where society is their family, and where they can express their Jewish identity.\n\nThey dream of making Aliyah and feel a sense of duty to serve in the IDF and to contribute to the safety of the people of Israel. But fulfilling this dream can be a great challenge, involving a disconnection from their natural environment, and their family and friends. It takes the willingness to start a new life.\n\nDuring Hanukkah, we took a trip to a Warm House for lone soldiers—a place for them to congregate, and warm their hearts. We gave them some Hanukkah gifts: toiletries, towels, and financial vouchers to purchase anything that they might need. The soldiers were delighted to receive these items and support.\n\nLike many good people who support them along the way, we at Vision for Israel also feel admiration towards these young men and women—as well as a responsibility to stand by their side and support them. We thank them for their dedicated service—and you, for your unwavering support for these special young people."
    },
    {
      "title": "StoriesSymbols of Hope in a Time of DarknessTuesday, December 29, 2020",
      "link": "https://www.visionforisrael.com/en/blog/symbols-of-hope-in-a-time-of-darkness",
      "image": "https://images.prismic.io/vfi-website/1bc5d934-d8aa-40e9-a93a-8ec38138dff3_IMG_5778.JPG?auto=compress%2Cformat&fit=max&w=3840",
      "image_alt": "Bar/Bat Mitzvah Celebration",
      "category": "Story",
      "full_content": "On a dreary day, the morning of the 7th light of Hanukkah, during a very dark year—the light was rekindled in our hearts.We chose Hanukkah to celebrate bar and bat mitzvah with these sweet children from terror victim families because what better time to shine a light through the darkness?Their families have been through so much in their lives, and despite the restrictions of Covid-19, we didn’t give up. We were determined to do everything to give them a wonderful day of joyous and moving activity—even in the shadow of Covid.The celebration of Bar/Bat Mitzvah is a huge milestone for Jewish children, and each child deserves to celebrate this event and feel the special meaning of the coming-of-age of Mitzvot.Sadly, not every family can give their child a festive and honorable event. Such is commonly the case with terror victim families—who are often in deep pain, amid a long and difficult rehabilitation process, and suffering from financial distress.Each year, we at Vision for Israel organize a moving, meaningful, and unforgettable event. This year, 45 boys and girls came to the Millennium Center for a fun-filled day that included a theatrical guided tour.The guests were divided into 4 small groups, with a space in the building dedicated to each group—maintaining social distance from the other groups. Entertainment was provided by Hamizvada (The Suitcase) Theatrical Tours, who performed for each group.The actors came with a suitcase, where they have all the equipment and costumes for the show. Each one of the actors presented something special from a specific era in the Jewish people’s history in Israel.As the event came to an end, each child was called forth to receive gifts before going home. Each child received useful, high-quality gifts, including a Teffilin set, Siddur (prayer book), candlesticks, and more. The excitement peaked as each child received an iPad.The success of each event we organize is measured by one thing—what each person takes with him/her from the event and carries in their memory. All of this would not be possible without your incredible support! Because of you, we were able to lift their spirits and give them an embrace from afar, so they know they are not alone.On behalf of the children, we say Thank you!"
    },
    {
      "title": "StoriesA New Medi-Cycle for ZAKAWednesday, December 16, 2020",
      "link": "https://www.visionforisrael.com/en/blog/a-new-medi-cycle-for-zaka",
      "image": "https://images.prismic.io/vfi-website/ee74d67c-0e00-4170-976f-f03e673875c0_0X3A2090.jpg?auto=compress%2Cformat&fit=max&w=3840",
      "image_alt": "A New Medi-Cycle for ZAKA",
      "category": "Story",
      "full_content": "Due to the generous donations of our heroic donors, Vision for Israel has been able to donate a new life-saving medi-cycle to ZAKA, which will be stationed in the south of Israel, in the city of Eilat.\n\nZAKA (abbreviation for Zihuy Korbanot Ason, meaning Disaster Victim Identification) is a series of voluntary community emergency response teams in Israel.\n\nThe medi-cycle was dedicated on Sunday in a small ceremony that was held at the Millennium Center, in the presence of ZAKA's chairman, Barry and Batya, ZAKA's CEO, staff members, and volunteers.\n\nBarry said, \"This is a moving moment for me. I made Aliyah to Israel as a lone soldier about 30 years ago, and since then I have been working a lot to help lone soldiers and the weaker populations. Saving lives is in my blood. I thank the ZAKA volunteers with all my heart for working year-round to save lives... I bless this activity and holy work. We will continue to cooperate between our organizations in saving lives, in order to improve life for humanity and for the people of Israel\".\n\nThe medi-cycle is equipped with the best medical equipment and will provide first-aid, and quick response in the city of Eilat and the surroundings."
    },
    {
      "title": "StoriesClothed in CompassionTuesday, November 24, 2020",
      "link": "https://www.visionforisrael.com/en/blog/clothed-in-compassion",
      "image": "https://images.prismic.io/vfi-website/5b4498f7-1871-4054-901f-640bf152fa90_IMG_3574.JPG?auto=compress%2Cformat&fit=max&w=3840",
      "image_alt": " Clothed in Compassion",
      "category": "Story",
      "full_content": "Our Vision for Israel team and volunteers just had another magical day of giving, this time as part of Clothing Day for Holocaust survivors.\n\nHolocaust survivors in Israel live off very small stipends, and many of them require expensive medicines to get by. The cost of living in Israel can be a heavy burden on them.\n\nSo after weeks of preparation—hand sorting through thousands of clothing items and packing dozens of packages—we finally loaded all the packages into our vehicles and went out for distribution.\n\nWe were so pleased to see that dozens of Holocaust survivors came to the event to choose clothing items that are to their liking. The choices included coats, shirts, pants, winter clothes, jackets, undergarments, pajamas, and more.\n\nThe event was, of course, organized following the strict Covid-19 instructions and limitations that were in place—with an open-air layout and small groups of people allowed together at one time.\n\nWe were very excited to meet them and to see the joy and delight on their faces. Even the weather agreed—blessing us all with a clear blue sky, and the warm sun for our special day.\n\nEach one of the survivors left the place with a bag full of clothing items that fit them and their taste. In return, they left us with words of gratitude and smiles to carry us through during this difficult time."
    },
    {
      "title": "StoriesScience Equipment for Special-Ed KidsTuesday, November 10, 2020",
      "link": "https://www.visionforisrael.com/en/blog/science-equipment-for-special-ed-kids",
      "image": "https://images.prismic.io/vfi-website/c754a9ff-85d6-4197-be02-68327fcb0df4_WhatsApp+Image+2020-10-26+at+05.37.26.jpeg?auto=compress%2Cformat&fit=max&w=3840",
      "image_alt": "science equipment for special ed kids",
      "category": "Story",
      "full_content": "Arazim School, in Jerusalem, is a special place for kids. It educates 76 boys from first grade up to sixth grade with special needs.Over the years, we’ve supported the school's home economics class. But now, due to Covid, the school can't hold these classes anymore. The school has decided to change the work outline in the science course, to adapt to the shifting demands of the pandemic.So we pivoted with them—to support the science program instead.The children there follow a program that focuses on science, independent research, and experiential learning—while immersed in the types of technology that will be relevant to them in their future careers.At Vision for Israel, we responded by donating science kits, which included 3 microscopes, 3 quality binoculars, an electric globe—as well as 2 research kits that will be used for science classes at the school so that children can experiment, explore, discover, and experience the world around them up close.Thank you for your support, and for making this investment in the youth of Jerusalem possible."
    },
    {
      "title": "StoriesAliyah from EthiopiaThursday, October 29, 2020",
      "link": "https://www.visionforisrael.com/en/blog/aliyah-from-ethiopia",
      "image": "https://images.prismic.io/vfi-website/a1bee7b5-2dd9-49dc-92ff-deac5ac12e9c_LauraSiegal_Moneyvouchers018.jpg?auto=compress%2Cformat&fit=max&w=3840",
      "image_alt": "Aliyah from Ethiopia",
      "category": "Story",
      "full_content": "Yatbenash and her family made Aliyah from Ethiopia in 2004. Her family consists of her parents, and her four children; ages 22, 19, 15, and 5. When the family arrived in Israel, they first lived in an absorption center, later moving into one of Jerusalem's poor neighborhoods.In 2015 Yatbenash came to the welfare office because of marital problems, and conflict between her husband and their eldest son. The difficulties between father and son affected the whole family and put a strain on their relationship as well.In their relationship roles, her husband was the only one who made decisions, leaving Yatbenash a bystander with no voice. When it escalated to sustained domestic violence, she didn’t know what to do—but after a particularly abusive encounter, she decided she’d had enough and called the police.Yatbenash works hard to provide for the family but is facing many hardships—both financial and emotional. She does everything by herself, without financial or emotional support from family or friends.She cannot afford to cover all her expenses and payments on her modest income, and her husband doesn't always support her financially with household expenses and bills. Despite all the difficulties, Yatbenash pushes forward—devoting herself to providing for her children."
    },
    {
      "title": "StoriesA Welcome Support for Lone SoldiersThursday, September 24, 2020",
      "link": "https://www.visionforisrael.com/en/blog/a-welcome-support-for-lone-soldiers",
      "image": "https://images.prismic.io/vfi-website/1422e399-8d38-4c8d-8889-1d733636d216_StudioCalau_060.jpg?auto=compress%2Cformat&fit=max&w=3840",
      "image_alt": "Support for Lone Soldiers",
      "category": "Story",
      "full_content": "Over 7,000 lone soldiers serve in the IDF, most of them in combat units.\n\nBut what exactly is a lone soldier?\n\nLone soldiers in the IDF come from many backgrounds: A soldier coming from a distressed family, who is unable to take care of him or herself; a soldier from abroad, who came to Israel to serve the country and is here without any support; the common thread among them is twofold—a deep commitment to service for their country, and loneliness.\n\nOn Shabbats and holidays, when all their friends get to go back to a warm and caring home—to dad's hug, mom's food and treats, to someone doing the laundry and ironing for them—these soldiers come to an empty, cold house.\n\nAt Vision for Israel, we’ve supported hundreds of lone soldiers over the years. Holiday gift cards, for example, have allowed them to warm their hearts by celebrating with food on the holiday table—just like their peers.\n\nThe commander of the Golani Commando Unit, some of whose soldiers received assistance from Vision for Israel for the holidays this year, sent us a moving Certificate of Appreciation, saying, \"Vision for Israel is] always here for us for any assistance, support, and guidance.\"\n\nHe shared with us a few personal stories from the aid recipients:\n\nAmir* lives in a house for lone soldiers. He was born into an ultra-Orthodox family in Bnei-Brak, and due to his difficulties in studying Torah, he was called the black sheep in the family. At the age of 18, he was forced into an arranged marriage against his will, and about a year later he became a father to a son.\n\nAmir felt no joy in his heart. He felt he was out of place, and decided to divorce his ultra-Orthodox wife and embark on secular life, hoping to find his place in the world. His parents opposed vehemently, were angry, and even severed ties with him. Amir has not been in contact with his parents for about 4 years. He enlisted in the Golani Unit and now dedicates all his time and energy to defending the country. In his few exits from the base, he does his best to see his little son.\n\nBenni* immigrated to Israel from Romania at the age of 14, along with his mother and brother, after his father abandoned the family and severed ties with them. When they arrived in Israel, his mother's mental state was difficult, and she was unable to raise her children on her own.\n\nShe informed Benni that she would no longer support him as a mother, that she was disconnecting from him, and that he had to manage on his own. He moved from house to house and from one boarding school to another, and lived for years without a place that he can call home. Recently Benni and his father renewed communication, but the relationship with his mother is still severed. Benni supports himself entirely, without any help.\n\n*Names have been changed"
    },
    {
      "title": "StoriesA Better Future for Terror SurvivorsSunday, September 13, 2020",
      "link": "https://www.visionforisrael.com/en/blog/a-better-future-for-terror-survivors",
      "image": "https://images.prismic.io/vfi-website/86c4a9a4-5dc0-482c-b9d5-11904931c5ed_IMG_5892.JPG?auto=compress%2Cformat&fit=max&w=3840",
      "image_alt": "Terror Survivors",
      "category": "Story",
      "full_content": "Life changed in an instant. Financially, mentally, physically—from that ill-fated moment onward, their lives were cast into disarray. And now, it’s up to us to help them pick up the pieces.\n\nWhen young members from these families enroll in higher education, they literally cling to life, and to the future—with a tremendous effort to rehabilitate themselves and acquire a profession that will help them stand on their own two feet and support their family with dignity.\n\nArchitecture, building engineering, electrical engineering, computers, special needs education teaching, and more…This is their answer to terrorism. It’s their victory over acts of hatred, through the love of life and the strong desire to succeed.\n\nOur team has always been motivated by the desire to give to the needy. But the opportunity to distribute scholarships to students from families affected by terrorism is particularly meaningful.\n\nEvery year, it warms our hearts to see these young people, whose families have been so badly hurt—determined to build their future.\n\nFor six years now we have been a part of their success. And to date, we have helped 420 students fulfill their dream, through scholarships distributed at an event held in collaboration with the Organization for Israel's Terror Victims.\n\nAt this year's event, Vision for Israel distributed scholarships to 76 students—Jews, and Arabs. Due to the Ministry of Health's instructions, we had to hold the event outside, which didn’t diminish in the least the festive and joyous atmosphere.\n\nTalking to the students, we learned about the difficult experiences they went through: infiltration of terrorists into their home, Molotov cocktails thrown at them, terrorists who detonated themselves next to them, missiles that hit them, being orphaned from parents, the death of siblings and children, and other inconceivable traumas.\n\nSarit* and her father were injured in a terror attack in 2001 when she was 17. Terrorists shot at her car. They were both injured, with Sarit in critical condition.\n\nThe period after the attack was very difficult—both mentally and physically. She underwent several surgeries, which resulted in additional health complications.\n\nBut today, Sarit is married with six children—and is the director of the Hila program for ultra-Orthodox girls and at-risk youth.\n\n*Name has been changed"
    },
    {
      "title": "StoriesPromise for a Fresh Start – Pack to School 2020Saturday, September 12, 2020",
      "link": "https://www.visionforisrael.com/en/blog/promise-for-a-fresh-start--pack-to-school-2020",
      "image": "https://images.prismic.io/vfi-website/fabd7108-9709-4fb1-ba08-f32f6153ea36_0X3A7014.jpg?auto=compress%2Cformat&fit=max&w=3840",
      "image_alt": "Pack to School 2020",
      "category": "Story",
      "full_content": "Every summer, our Vision for Israel team works vigorously to distribute school bags to children from distressed families throughout the country, and from all sectors and communities—religious and secular, Arab and Ethiopian, new immigrants, victims of terrorism, at-risk children, asylum seekers, migrant workers, and more.\n\nThe goal has been to reach every needy child we can and to make sure they start the new school year as equals among their classmates—able to concentrate on their studies and succeed.\n\nAt the distributions, our team met families who were suffering from very difficult financial situations—parents unable to support their children due to disability, single-parent families in which the father refuses to pay alimony, and some with many children who are supported only by Social Security.\n\nOne family, in particular, touched our hearts at the distribution—a single mother, doing everything she can to support her son throughout the many difficulties they have in life.\n\nTheir son Gabriel* was included in the \"Babysitter\" program a few months after he was born, so that she could continue to work. Gabriel, who did not speak at all until the age of three, was diagnosed with autism, following a lengthy series of tests.\n\nIn January 2017, the father unexpectedly left home, taking the family savings with him. His departure was devastating for Gabriel's emotional state, not to mention the mother's.\n\nBut despite the enormous difficulty, she persevered—continuing to take care of Gabriel's special needs, and his integration into an appropriate educational setting.\n\nMore hardship struck as she was later fired from her job, and became recognized as a victim of human trafficking—she had been abducted and tortured in Sinai after fleeing her country.\n\nShe has since found a new job and is managing to keep her head above the water for the sake of her beloved son and his special needs.\n\nAnd thanks to the care of his mother, with the help of a social worker, Gabriel now studies in kindergarten—where he is making solid progress. He functions better and is very much loved by the other children and the staff.\n\nThis is one of the countless stories we hear each time we have a distribution—and one of the reasons why this project is so special to us.\n\nThe ability to give these children a chance to start the school year with a schoolbag and study equipment, just like everyone else, gives us great satisfaction—and it’s heartwarming to see the children's eyes glistening with joy, and their parents' enthusiasm for the quality and variety of the schoolbags.\n\nThe light in their eyes is indeed the fuel that motivates us to continue working—with the help of our generous donors—for all the needy in Israel.*Name has been changed"
    },
    {
      "title": "StoriesNew Challenges for the High HolidaysFriday, September 4, 2020",
      "link": "https://www.visionforisrael.com/en/blog/new-challenges-for-the-high-holidays",
      "image": "https://images.prismic.io/vfi-website/c40887c2-53a8-4c23-a9cf-df3a57478b8a_IMG_2269+copy.JPG?auto=compress%2Cformat&fit=max&w=3840",
      "image_alt": "New Challenges for the High Holidays",
      "category": "Story",
      "full_content": "And amid this busy and festive time, Israel continues to reel from the effects of the global Covid-19 pandemic.\n\nAt Vision for Israel, our team has been working hard to help prepare as many families as possible for this time of increased activity, with the additional pressure of financial distress. Many of these families are experiencing joblessness for the first time, and are unsure how to cope with the new pressures of low income, unpaid leave, and medical problems.\n\nIt’s important for us to provide these dear families some relief, to allow them to survive in these difficult times, and make it possible for them to have food on the holiday table.\n\nOver the last few weeks, dozens of needy families have been invited to the Millennium Center, to receive a NIS 300 (USD $90) gift card.\n\nThere, we met single mothers, some with many children, new immigrant families facing assimilation difficulties, and many other families facing financial difficulties due to the physiological and mental health problems of their family members.\n\nOne recipient told us that she was going to go shopping right away using the gift card. We made it clear to her that the essence of the assistance was shopping for the holidays, but she explained that her husband was very ill and that caring for him did not leave her enough time to shop and run errands.\n\nTherefore, she preferred to buy products that do not spoil, such as honey and frozen meat, so that when the holiday approaches, she can make a relatively small purchase in the little time that is available to her.\n\nEspecially in these difficult times, when the coronavirus affects so many people, it remains important for us to allow distressed families to celebrate the holidays joyfully, with enough food on their table."
    },
    {
      "title": "StoriesHolocaust Survivors Brace for Another Harrowing ChallengeThursday, August 6, 2020",
      "link": "https://www.visionforisrael.com/en/blog/holocaust-survivors-brace-for-another-harrowing-challenge",
      "image": "https://images.prismic.io/vfi-website/b55b37b8-9f2b-4456-bc46-b16ef3a1b82d_Laurasiegal_VFI044+copy.jpg?auto=compress%2Cformat&fit=max&w=3840",
      "image_alt": "Holocaust Survivors",
      "category": "Story",
      "full_content": "Life is lonely for Holocaust survivors these days. For them, advanced age, limited mobility, and chronic conditions have long presented challenges—and the pandemic has only added to the risk of social interaction for this vulnerable cohort.\n\nPanic buttons—have served as a literal lifeline, offering security and peace of mind for a population who spend most of their time alone.\n\nIn recent years, we have partnered with the Foundation for the Benefit of Holocaust Victims, and have run an initiative to fund panic button service (they require a subscription service to operate) in the homes of Holocaust survivors.\n\nSo far, we’ve enabled about 800 Holocaust survivors to call immediately for help (doctor or ambulance) in any case of distress—24 hours a day, 365 days a year—whether living alone in their homes, or in sheltered housing.\n\nAvraham* is an 86-year-old Holocaust survivor living in Jerusalem who has received panic button services from us since 2015.\n\nAvraham has a disability in his legs and suffered a terrible fall about eight months ago. Thankfully, he was able to call for help using his panic button, and medics arrived with an ambulance. He sustained a serious injury to his head, requiring an operation to repair. Today, he’s thankful to have survived:\n\n\"I was rocking between life and death,” he said, adding: \"The button is next to me all the time—if God forbid something happens to me,  I know I should press it. It gives me [a sense of] security. I am very grateful for the dedicated service.\"**\n\nWhen the war broke out in Yugoslavia, Avraham’s father was deported to a concentration camp, where he eventually perished. Avraham was only seven years old at the time. He, his mother, and three brothers were then removed from their home.\n\nToo poor for shoes, he spent four years walking without them—leading to his eventual leg disability. His three brothers died during the war, and he and his mother stayed with the partisans until the fighting finally ended.\n\nAfter the war, Avraham remained in Yugoslavia, married, and had two daughters. He became an educator and worked for 36 years as a music teacher for teenagers in Bosnia. He immigrated to Israel in 1996 with his family.\n\nHe currently lives alone and has two daughters, six grandchildren, and two great-grandchildren.\n\nDeeply lonely, he has been assigned several volunteers over the years. Avraham keeps letters and pictures of everyone.\n\nUnfortunately, the Foundation for the Benefit of Holocaust Victims, with whom we partner on this service, has not yet been able to raise all the funding required to provide emergency button service for 2021 and beyond.\n\nIn the absence of sufficient donations, there is no guarantee that the channel will continue to exist—and there is a tangible concern that thousands of existing subscribers will have to be disconnected. No new subscribers have been added since 2018, due to an existing funding shortfall.\n\nWe need your help so that we can continue to allow existing subscribers the opportunity to benefit from the service that is so essential for them.\n\nThe cost of financing the service for a year for each Holocaust survivor is 450 NIS or about $130 USD.\n\nIn a telephone survey conducted for the Foundation in May 2019 by the Smith Research Institute, among a representative sample of Holocaust survivors using the button service:\n\nWe appreciate your prayers, and any financial help you can offer to help us continue to fund this life-saving service. Will you join us in extending security and safety to Holocaust survivors in need?\n\n*Name changed for privacy**Translated from Dan Lavi's article from Yisrael Hayom"
    },
    {
      "title": "StoriesA Grade Above: Critical Supplies to Start the Year StrongSunday, July 26, 2020",
      "link": "https://www.visionforisrael.com/en/blog/a-grade-above-critical-supplies-to-start-the-year-strong",
      "image": "https://images.prismic.io/vfi-website/02fa412c-257d-40ef-aaa1-47ec18792fdc_0047.JPG?auto=compress%2Cformat&fit=max&w=3840",
      "image_alt": "Critical Supplies to Start the Year Strong",
      "category": "Story",
      "full_content": "Despite the many uncertainties and hardships forced upon us by the pandemic, many children are preparing to take an exciting step—entry into the first grade.And with a great many families suffering from unemployment and financial distress due to the Coronavirus, we’ve been working extra hard to ensure that school children have a chance at feeling a sense of normality as we approach the school year.Kids desperately want to feel like they fit in with their peers, despite the hardships their parents may face, so we’re proud to do something to help make a difference for them.This year, we’re distributing high-quality, orthopedic trolley-style school-bags—along with a water bottle, lunch box, and stationery.Recently, a concentrated distribution of these schoolbags was held in the Kiryat-Yovel and Har-Nof neighborhoods in Jerusalem and Sderot.To comply with the social distancing guidelines during the distributions, each family came into the room separately and chose a backpack. Both parents and children were overjoyed.\n\nAmong the families were:\n\nOur team is happy to report: \"the children and parents loved the schoolbags—they were thrilled about the images imprinted on them (SpongeBob and soccer for the boys and princesses for the girls), and they were excited to open the bags’ trolley handles and the different compartments. They were even happier to discover more school supplies inside the school bags.\"Your donations have been vital to promote equal opportunities among the young students. Together, we’re doing our part to narrow the achievement gap for all the children in Israel."
    },
    {
      "title": "StoriesAid to the Ethiopian Community & Issues of InequalityWednesday, July 1, 2020",
      "link": "https://www.visionforisrael.com/en/blog/aid-to-the-ethiopian-community-issues-of-inequality",
      "image": "https://images.prismic.io/vfi-website/fa3c3bec-b72c-4ed7-95ba-3f1c4b9e40b8_0X3A5117+copy.jpg?auto=compress%2Cformat&fit=max&w=3840",
      "image_alt": "Aid to the Ethiopian Community",
      "category": "Story",
      "full_content": "As conversations continue around the world about the role of systemic racism in policy and policing, a growing number of parallels have emerged between Israel, and its ally to the West—the United States.Both nations boast strong national pride, deep faith traditions, and diverse cultural makeup. They also similarly struggle with issues of inequality, despite the rich diversity they enjoy.Today, we’re examining the situation in Israel, and how some officials are acting to make their home safer, and more equitable for all her citizens.\n\nThe killing of African-American George Floyd while in police custody on May 25, and the massive anti-racism protests that event unleashed—both in the US and around the world—has struck a chord with Israel’s Ethiopian community.“We need the whole system to wake up,” said newly appointed Immigrant Absorption Minister Pnina Tamano-Shata.Tamano-Shata is considered a ground-breaker and a leader in the Ethiopian community in Israel. She is the granddaughter of Kais Shato Maharat, who comes from a long line of prominent spiritual leaders among Ethiopian Jewry, a sixth-generation descendant of Abba Meheri Sutal, a Jewish monk who lived and worked in Ethiopia in the 19th century and served as the spiritual leader for the Beta Israel community.Deputy Public Security Minister Desta “Gadi” Yevarkan, himself an Ethiopian Jew, took to Facebook to condemn the killing of 46-year-old Floyd, calling it “one of the most racist, cruel and deadly events ever recorded” and noting that “police violence against blacks has touched many countries in the world.”Although the Israeli police are tasked with making sure that people feel secure and protected, Yeverkan wrote, often “white Israeli citizens feel safe when they see a police car in their neighborhood, while black Israeli citizens feel unsafe.”\n\nLast year, widespread protests rocked Israel when tens of thousands of Ethiopian Jews took to the streets following the shooting death of 19-year old Solomon Tekah at the hands of an off-duty police officer. Protesters blocked roads, burned tires, and, in one incident, burned a car at Tel Aviv’s busy Azrieli Junction.Tekah’s death came six months after Yehuda Biadga, 24, a mentally ill Ethiopian Israeli, was shot and killed by police who say he charged an officer while brandishing a knife. His death led to demonstrations throughout Tel Aviv.May 2015 saw similar protests erupt following the beating of Ethiopian-Israeli soldier Damas Pakada. Those protests devolved into riots in which police officers fired stun grenades, water cannons, and tear gas to disperse the demonstrators, who threw rocks and glass bottles at policemen and also vandalized some storefronts.Rivka Demoza, a resident of Haifa, said: “It’s hard for me to see the footage from the United States. It’s hard because I think ‘What if I was there? What if I was visiting?’ I think as a tourist I wouldn’t want to go there. All my friends are sharing posts and talking about the cases from Israel and the US.”Demoza recalled how her younger brother left home one evening to hang out with friends and was confronted by two police officers while waiting for a cab outside their home. The officers refused to believe that he lived there, even after seeing his ID card, she said, adding that if her uncle had not been a police officer himself, her brother could have been in real trouble.“The situation isn’t so different [in the two countries].” said Shula Mola, former chairperson of the Association for Ethiopian Jews, “Violence is violence and racism is racism and when a white person has the power to kill someone black it’s the same, it doesn’t make a difference here or there.”\n\nStatistics show significant inequalities between Ethiopian-Israelis and the rest of the population.Ethiopian soldiers are sent to military-prison at a disproportionately higher rate than other groups and are arrested in civilian life at a higher rate than the general population. In 2017, approximately four percent of Israel Defense Forces soldiers came from the Ethiopian community, yet they accounted for 15.07% of female and 10.78% of male prisoners, according to the Association of Ethiopian Jews.According to a recent report by the government’s Anti-Racism Coordinating Unit, the number of complaints of racial discrimination it receives doubled in 2019, with 37% of such charges coming from the Ethiopian community. The report also noted that while Ethiopian Jews comprise 1.7% of the population, their arrest rate stands at 3.27%. The unit was set up on the recommendation of a commission established by Prime Minister Benjamin Netanyahu in the wake of the 2015 protests.In February, several police officers were removed from their posts in the southern city of Kiryat Malachi after it emerged that they had mocked and disparaged people of Ethiopian origin in a WhatsApp group, including one young man who had been brought to the police station, bloodied and in handcuffs.\n\n“As a human being and a black woman, I can tell you that a lot of black people around the world and also in Israel can [identify] with what’s happening” in the US, as relating to their own experiences, Tamano-Shata said.She added that she’d told Public Security Minister Amir Ohana he needed to remove problematic officers from the force.“Someone who is racist cannot be in the police. Someone who is a criminal cannot be in the police,” she stated. Things in Israel have improved since 2015 but “unfortunately it’s not enough,” she said.Calling for “affirmative action” and an end to separate classes and programs for Ethiopian students, she said that when people are separated, “they start to believe that they are different and lesser than others.”But while the fight against racism will be a “long struggle” that will only be won with state intervention, many in the Netanyahu administration are sympathetic, she said.“The situation in the US is much worse and the history is different. In Israel, there is a possibility that the political system can fix racism faster, smarter, and more efficiently than in America. We just need the will and leadership.”“I believe in Israel we can make big changes and be an example for the rest of the world.” (TOI / IH / VFI)\n\nSeveral times a week, theVision for Israelteam goes out to distribute hundreds of food bags to needy families in the Jerusalem and Modi'in areas. When preparing food packages, we take into account the needs of the communities we help—so for the Ethiopian community, we include staples they're accustomed to, such as teff, Shiro, rice, and red lentils.During our last trip, we met some very lovely people. Sadly, due to differences in the native language, custom, and other formal differences, their absorption into Israeli society can take years—and make financial survival very difficult. Many within the Ethiopian community are forced to live off a low-income allowance, and severe poverty is common.Ariel, a team member involved in this mission, reported, \"There was an incredibly positive atmosphere, and many people greeted us, wished us a good income, health and that we will always be on the giving end. Due to the heavy weight of the packages—approx. 12kg—the elderly had a hard time carrying them, so we carried the packages for them all the way to their doorstep. We also brought the packages into the homes of people with disabilities of course.\"Thanks to our generous donors and lovely volunteers, hungry people in our community are receiving nourishment for their bodies, and relief for their soul."
    },
    {
      "title": "StoriesLife-Changing Help for Homeless Addicts in Tel-AvivTuesday, May 26, 2020",
      "link": "https://www.visionforisrael.com/en/blog/life-changing-help-for-homeless-addicts-in-tel-aviv",
      "image": "https://images.prismic.io/vfi-website/921b35c2-a0c5-4b03-93f4-02bc08ea1415_WhatsApp+Image+2020-05-21+at+01.26.26+copy.jpeg?auto=compress%2Cformat&fit=max&w=3840",
      "image_alt": "Life-Changing Help",
      "category": "Story",
      "full_content": "Recently, we partnered with a very special organization in south Tel-Aviv that cares for the homeless.Every day, about 50 –100 people arrive and receive food to eat, a kind word, and an open ear—and if necessary—help for rehabilitation from drugs and alcohol.On the upper level, those who struggle with drug addiction have a designated safe space to detox for 3 days. Long term rehabilitation is offered to them as well, at a different location.\n\nWe had recently begun supporting the soup kitchen, so Batya and Barry went in for a visit. They were deeply impressed with the work being done, and the care given to the homeless of Tel Aviv.“They are doing great work, really. The hungry received cereal with milk, a hot meal, hot and cold drinks, and something sweet. We saw several dozen people who came to eat—they were in such rough shape. And because of the Coronavirus, they couldn’t go inside and the food was served to them outside.”Sadly, the neighbors have protested the food distribution so close to their homes. One of the neighbors even poured water from above to drive away the hungry food recipients, while other neighbors called the police. They were stunned by the inability to show compassion towards people who have no roof over their heads, and who suffer from extreme hunger.\n\nWhile they were there, Barry and Batya met a woman named Svetlana, who was serving food. Svetlana herself had been homeless in the past and had been so severely addicted to drugs that she didn’t believe she had the strength to be rehabilitated. She was so thankful for the life-changing help she received that she now feels called to help others like herself.Every day, she and her husband—who had also struggled with addiction—come to Tel-Aviv from Haifa to serve these people. It was wonderful to see.Thanks to your generous support, Vision for Israel has donated dry food items (legumes, rice, flour, sugar, coffee, tea, pasta, tuna, and more), that will satisfy many hungry souls—in addition to clothing for all ages and seasons, blankets, bedding, towels, furniture, electric appliances, books, toys and more."
    },
    {
      "title": "StoriesPanic Buttons for Holocaust SurvivorsThursday, April 30, 2020",
      "link": "https://www.visionforisrael.com/en/blog/panic-buttons-for-holocaust-survivors",
      "image": "https://images.prismic.io/vfi-website/c45e861c-b97e-4651-b448-e6d3a5b666ac_Holocaust+survivor.jpeg?auto=compress%2Cformat&fit=max&w=3840",
      "image_alt": "Panic Buttons for Holocaust Survivors",
      "category": "Story",
      "full_content": "During this pandemic, necessary social isolation measures have led us all to feel lonely. But to some, that loneliness points to far greater risk. Those of advanced age—including Holocaust Survivors—are at higher risk of complications if infected, but also more at risk of serious harm if left unattended for too long.Unable to be checked in on by family members, or even volunteers anymore, our hearts break to hear reports of isolated elderly who died in their homes without anyone knowing, to be found lifeless several days later.\n\nIn this difficult time, it is important more than ever to watch over them, to respond to them when they need help, and to let them know that they’re not alone.Each year Vision for Israel donates hundreds of subscriptions to remote panic buttons for Holocaust survivors. And this year, this donation is more essential than ever.\n\nThe panic buttons are installed in the survivors’ homes, and the subscription allows them to summon immediate help at any hour. A doctor or ambulance comes to the survivor’s home immediately in an emergency such as emotional distress, a fall, injury, or sickness.Holocaust survivors are dear to our hearts, and it’s important for us to embrace them, to support them, and to watch over them—especially during this time."
    },
    {
      "title": "StoriesImpact Story: Michal's Family | JerusalemSaturday, April 18, 2020",
      "link": "https://www.visionforisrael.com/en/blog/impact-story-michals-family--jerusalem",
      "image": "https://images.prismic.io/vfi-website/b9794b14-b646-4205-ae51-68c293df5944_0X3A9940.jpg?auto=compress%2Cformat&fit=max&w=3840",
      "image_alt": "Impact Story: Michal's Family",
      "category": "Story",
      "full_content": "This year, while delivering Passover aid to families in Jerusalem, we met Michal*—a young single mother of two. Coming from a complicated family background where she was raised outside her parents’ home, she married and divorced young. And despite the challenges involved in her lifestyle, she does her best to raise her two small children; Alon* who is in 4th grade, and Nimrod* who is in 2nd grade.\n\nBoth of her children have been diagnosed with severe ADD, and are integrated into classrooms with the help of a paraprofessional. The children also face emotional and social difficulties related to their background.\n\nMichal works full-time as a secretary in a real estate appraisal office and is putting forth many efforts to reach financial independence. Still, she struggles. Her many debts make putting food on the table for herself and her children anything but easy.\n\nTo make matters worse, health complications have also hindered her ability to function both as a professional, and as a mother. Her missed workdays cause her an enormous amount of stress because of the tenuous situation she is in.\n\nYour gifts have directly blessed Michal and her children, and so many others like her. Thank you for remembering Vision for Israel in your tithes and giving—because it is your faithful contributions that truly make the difference for people like Michal, Alon, and Nimrod.\n\nTo make a life-changing donation to help someone like Michal, click the button below."
    },
    {
      "title": "StoriesGenerosity Amid UncertaintyTuesday, April 7, 2020",
      "link": "https://www.visionforisrael.com/en/blog/generosity-amid-uncertainty",
      "image": "https://images.prismic.io/vfi-website/a8e00f1c-fc33-4605-9bb0-e8bbad0aa568_0X3A5081.jpg?auto=compress%2Cformat&fit=max&w=3840",
      "image_alt": "Generosity Amid Uncertainty",
      "category": "Story",
      "full_content": "During this Coronavirus pandemic, a protective mask has the ability to save many people from potential sickness and death.Over the last few weeks, there's been a shortage of masks in Israel, and those who need them most—people at high risk, especially the elderly, Holocaust survivors and others with preexisting conditions, and our heroic front-line medical professionals—are struggling to get their hands on them.Our dear friends in Hong-Kong—Israel-loving Christians—have undertaken to help us all, and donated tens of thousands of protective masks for the people of Israel. At Vision for Israel, it is our duty and honor to distribute these masks to those who need them most.We send our deepest gratitude to the generous donors, and to the Israeli consulate in Hong-Kong for flying the packages to us.\n\nWith Passover beginning on Wednesday evening, we wanted to ensure that all people in need are reached before the holiday—and we couldn't do it without the help of those willing to lend a hand and help at this crucial time.We would like to specifically thank Betty and Asaf, who came to help us and hand out the remaining gift cards to more families in Jerusalem. Despite the traffic difficulties, they persevered—and many more families who anxiously awaited this aid will now be able to purchase their basic necessities for Passover.During these strange days—when the once-bustling streets are quiet leading up to this major holiday—we are relying on the spirit of giving to those around us, to fill our hearts with joy this Passover. Together, we will do good for these dear families. \"When there's a will, there's a way\". And when the will is accompanied by a gift, it becomes a blessing."
    },
    {
      "title": "StoriesPassover Aid in the Shadow of CoronavirusSunday, March 22, 2020",
      "link": "https://www.visionforisrael.com/en/blog/passover-aid-in-the-shadow-of-coronavirus",
      "image": "https://images.prismic.io/vfi-website/14761e71-254a-4456-977a-1928f2250694_WhatsApp+Image+2020-03-18+at+10.30.32.jpeg?auto=compress%2Cformat&fit=max&w=2048",
      "image_alt": "Passover Aid in the Shadow of Coronavirus",
      "category": "Story",
      "full_content": "The Coronavirus crisis weighs heavily on us all—with significant effects on our physical and emotional well-being, our collective sense of security, and of course our economic reality.\n\nMany families who have been fighting for their survival since before the crisis, are in greater need of assistance than ever. Thankfully, we have found some creative ways to continue our vital financial aid distribution for Passover, in accordance with the government's instructions.\n\nOur brave staff members have ventured out, leaving financial-aid debit cards inside bags hanging on the doors of dozens of families in Jerusalem. Hundreds of additional cards are being mailed by registered mail to Holocaust survivors, families, singles in need, citizens of the southern region, terror victims and lone soldiers.\n\nSome Additional Facts:\n\nAll that we’ve been able to accomplish so far has been possible due to your incredible support. Thanks to you, we can continue to be your eyes, hands, and feet in Israel—to do the important work of the Gospel."
    },
    {
      "title": "StoriesA “Legendary” Purim for Underprivileged ChildrenTuesday, March 17, 2020",
      "link": "https://www.visionforisrael.com/en/blog/a-legendary-purim-for-underprivileged-children",
      "image": "https://images.prismic.io/vfi-website/a10d50fe-820f-4634-af2f-723e59699107_ee60a314-34c0-49bf-9749-87ccd6b29947_IMGB3043.jpg?auto=compress%2Cformat&fit=max&w=3840",
      "image_alt": "A “Legendary” Purim for Underprivileged Children",
      "category": "Story",
      "full_content": "Purim is a wonderful holiday for children. And one of the greatest privileges we get to enjoy here at Vision for Israel is bringing the joy and magic of Purim to these dear young souls.Not every child has the opportunity to share in the festivities with their loved ones, as many children in Israel face significant challenges and hardship due to poverty, and complicated home environments.For the past several years, we’ve been supporting a particular school in Jerusalem that caters to the special needs of children just like this. And for this year’s Purim celebration, we decided to give the children a special treat.This Purim, the school celebrated with the theme \"Legendary Purim\"—the children put together activity stations relating to legends. For example, one of them was building a card tower in the Alice in Wonderland station, another was walking in high heels along a course in the Cinderella station, and yet another was an all-you-can-eat experience in the Hensel and Gretel station.At the end of each station, the children received prizes—and at the end of the day, they each left with a bag full of prizes, and a big smile on their faces.Thanks to your heroic donations, we were able to provide a humorous, full-sensory magic show, which got the kids laughing, and taking part in the fun—a sight that moved us greatly. At the end of the show, the magician made each child a balloon hat.Our hearts were especially warmed by the excitement of one boy, who we learned had been dealing with severe emotional problems. This was his first experience with the Purim celebration at the school. His enthusiasm grew with each station he completed, and he was visibly filled with joy at the magic show.None of this could have been possible without your incredible generosity, our dear partners. Thank you for helping us put smiles on the faces of these children, and for giving them a glimmer of hope—and belief—this Purim."
    },
    {
      "title": "StoriesPurim Event for At-Risk ChildrenMonday, March 16, 2020",
      "link": "https://www.visionforisrael.com/en/blog/purim-event-for-at-risk-children",
      "image": "https://images.prismic.io/vfi-website/0335e6b3-ea61-48b0-9fb3-ffc07d68d155_Purim_1_%28286%29.JPG?auto=compress%2Cformat&fit=max&w=3840",
      "image_alt": "Purim Event for At-Risk Children",
      "category": "Story",
      "full_content": "At-risk children face enormous difficulties—commonly due to dysfunction, neglect, or abuse in their homes. And since these precious children need so much support, our organization cares for their needs and well-being in a variety of ways.\n\nThis year, we contributed to a festive and luxurious lunch event for at-risk children in Jerusalem called the Purim Happening. The children enjoyed different activity stations such as target shooting, a treasure hunt, after which students from the “Susiya Yeshiva” presented a play in honor of the event. At the end, the children were given the traditional goodie package for Purim,Mishlo’ach Manot.\n\nAt the event, we met a lovely girl who lives in the shadow of unbearable fights between her parents, accompanied by verbal and emotional abuse. The fights between the parents have resulted in a significant deterioration in the family's financial situation. But despite all this, she managed, for a few hours, to forget the reality of her difficult life, and to take part in the celebration—and even to dress up in a costume.\n\nThe children enjoyed the festive atmosphere, the indulgent meal, the activities, and the attention. Having a break from their routine meant a lot to them, and they were happy to celebrate Purim as much as all children should.\n\nIn a thank you letter, the center’s project manager wrote to us: \"This year also, we all enjoyed a joyful and well-invested opportunity for the children of the facilities*... thanks to the sponsorship of Vision for Israel, for which we are thankful. For the children, it was a meaningful and joyful experience that allowed them to enjoy and celebrate Purim in a festive and joyful atmosphere.”\n\n*Facilities, in this case, are child-care facilities for children at risk"
    },
    {
      "title": "StoriesFlower Arranging with Holocaust SurvivorsMonday, March 9, 2020",
      "link": "https://www.visionforisrael.com/en/blog/flower-arranging-with-holocaust-survivors",
      "image": "https://prismic-io.s3.amazonaws.com/vfi-website/6fee8df6-95b2-400e-92c7-d38f7af4eb45_0418.JPG?rect=0%2C0%2C2000%2C1000&w=3840&fit=max",
      "image_alt": "Flower Arranging with Holocaust Survivors",
      "category": "Story",
      "full_content": "Many of the Holocaust survivors living in Israel today suffer from unbearable loneliness, on top of both physical and health problems, and sometimes poverty too.\n\nAt Vision for Israel, we do our best to care for them in as many ways as possible. For Tu-Bishvat, we hosted 50 survivors from Be'er-Sheva at the Millennium Center for social fellowship centered around a flower arranging activity.\n\nBarry and Batya welcomed the survivors with an accordionist as they disembarked from their bus, and ushered them into the hall for a delicious brunch. The day's activity included a singalong session, which led some of the survivors to dance joyfully.\n\nThe flower arranging workshop began after dessert. The survivors learned how to cut and arrange the flowers in a classic style. Some of our generous volunteers handed out the flowers and provided assistance for those who needed it. To cap off the event, the survivors received useful gifts such as bed linens, towels, scarves, and hats.\n\nShortly after the event, we received a thank you letter from the Foundation for the Benefit of Holocaust Survivors that read in part:\"We received positive and moving feedback from the Holocaust survivors who participated in this event, and they were thankful for the opportunity you gave them—getting out of the house to lessen the loneliness, and to enjoy a delightful and cultural event.\n\nThe survivors told us that this is one of the most amazing events that they got to participate in, that they [thoroughly] enjoyed it, and that they haven't had this much fun in a long time, that it was special, and they will remember this event until the end of their days...\".\n\nWe are honored and privileged to invest your donations in the continued care and support of our beloved survivors. It was such a wonderful day."
    },
    {
      "title": "StoriesAn Evening of Peace for the Families of SderotWednesday, February 19, 2020",
      "link": "https://www.visionforisrael.com/en/blog/an-evening-of-peace-for-the-families-of-sderot",
      "image": "https://images.prismic.io/vfi-website/ef7225c4-1631-417a-ae3c-3e2ae23ad62d_WhatsApp+Image+2020-02-10+at+09.23.06.jpeg?auto=compress%2Cformat&fit=max&w=3840",
      "image_alt": "An Evening of Peace for the Families of Sderot",
      "category": "Story",
      "full_content": "It can be hard to imagine the reality of life for the children of Sderot. Surrounded by harrowing events, and under the constant threat of rocket attacks, they bear on their little shoulders the burdens of their parents—filling their childhood memories with days steeped in sadness and anxiety. If anyone ever deserved a break from the chaos of everyday life—to be transported through fiction to another place for a while, and maybe to have a smile or two—it was these kids.\n\nAnd so, in honor of Tu Bishvat, we at Vision for Israel sponsored a theater play for them. \"An Apartment for Rent,\" is a rich musical adaptation of the famous Israeli book by Le'ah Goldberg. Its story relates to a subject of familiarity—the sometimes-difficult relationships people have with their neighbors and depicts its heroes as finding ways to help each other, finding true friendship along the way.\n\nThe performance took place in the largest protected playroom in Israel, hosting 250 children and their parents for a fun and relaxing evening together. At the end of the event, each child received a grass-head as a gift.\n\nThe Director of the Sderot Development Fund wrote us, saying \"The children of Sderot, most of whom were raised into a difficult reality of security tension and rocket shooting once every few months—are yearning for an activity like this, that can give them a little relief and a sense of normality in the complicated reality that they live in. Thank you to Vision for Israel, and Barry and Batya who head it, and who humbly partner in quite a few initiatives for the welfare of the children of Sderot and its residents.\"\n\nWithout the powerful support that generous donors like you provide, this evening of joy and relaxation for these distressed families could never have been possible. We thank you from the bottom of our hearts and ask that you keep this and our other Outreach Areas in your prayers and ongoing gift considerations.\n\nTogether, we are making a difference."
    },
    {
      "title": "StoriesWarming the Winter for Those in NeedSunday, January 26, 2020",
      "link": "https://www.visionforisrael.com/en/blog/warming-the-winter-for-those-in-need",
      "image": "https://images.prismic.io/vfi-website/836f242d-edfa-455f-9366-ed7d9fcc16f0_IMG_7707.jpg?auto=compress%2Cformat&fit=max&w=3840",
      "image_alt": "Warming the Winter for Those in Need",
      "category": "Story",
      "full_content": "Who doesn't like to snuggle up in a warm blanket with a mug of hot chocolate on a cold winter day?\n\nBut even simple pleasures like this are beyond some people suffering from poverty—who can’t afford to heat their homes, or even blankets—and are exposed to the intense cold. With your generous donations, we at Vision for Israel can provide for them every year with heating and blankets.\n\nThis week, we donated high-quality down comforters to 100 families and senior citizens in need, in the city of Modi’in.\n\nAt the distribution office, we met hard-working families—people who struggle daily for their livelihoods and suffer from an acute shortage of basic needs. We met struggling families who are raising children with special needs, parents who have health problems and cannot work, new immigrants who are also facing the difficulties of absorption into the country, single mothers who raise their children alone, and elderly, destitute Holocaust survivors.\n\nYour generous donations warm the winter—and the hearts—of the people who need it most. Thank you to all who choose to give."
    },
    {
      "title": "StoriesHanukkah Celebration with Holocaust Survivors at the Millennium CenterThursday, January 23, 2020",
      "link": "https://www.visionforisrael.com/en/blog/hanukkah-celebration-with-holocaust-survivors-at-the-millennium-center",
      "image": "https://images.prismic.io/vfi-website/070d6046-9071-479c-b9d4-509609effca9_0X3A0554.jpg?auto=compress%2Cformat&fit=max&w=3840",
      "image_alt": "Hanukkah",
      "category": "Story",
      "full_content": "The average age of the 192,000 or so Holocaust survivors currently living in Israel is 85 years. Survivors tend to have unique problems that accompany them throughout their lives, intensifying over the years: health problems, psychological distress, anxieties, unbearable loneliness, and lack of family and social support that would have sweetened their difficult lives at an advanced age. Their financial situation is very difficult and about a quarter suffer from acute poverty.\n\nThis past Hanukkah, we decided to bring light into the lives of Holocaust survivors—people who have experienced very dark times in their past. We were excited to welcome dozens of survivors at the Millennium Center. After enjoying a rich brunch, an ensemble of instrumental artists performed to them, breathing into them joy, and dispelling the daily miseries that follow them.\n\nThe survivors were looking forward to this day, and it was exciting to see their smiles and laughter, to watch them rise and dance with enthusiasm, and to hear their singing and enthusiastic applause.\n\nThe eighth candle of Hanukkah was lit by the survivor's representative and the candlelight brought warmth to the room, and to everyone’s heart.\n\nAs a souvenir from the joyous and pleasant event, every survivor received a gift: bedding, lap blanket, towel, and scarf. The deep gratitude from the participants was evident and immediate, and they expressed their profound appreciation for the thought that went into every detail of the event.\n\nIn the planning stages of the Millennium Center about 10 years ago, we saw before us a building that would spread the light of joy—a center that would provide assistance, healing, and rehabilitation to the body and mind. On the architectural drawings, we wrote \"Center of the Lighthouse.\"\n\nThere is nothing more gratifying than bringing light into the lives of others, especially those who experienced darkness, evil and bereavement in their lives."
    }
  ]
}